[{
    "movie_id": "tt2488496",
    "movie_title": "Star Wars: Episode VII - The Force Awakens",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BOTAzODEzNDAzMl5BMl5BanBnXkFtZTgwMDU1MTgzNzE@.jpg",
    "movie_storyLines": "As a new threat to the galaxy rises, Rey, a desert scavenger, and Finn, an ex-stormtrooper, must join Han Solo and Chewbacca to search for the one hope of restoring peace. 30 years after the defeat of Darth Vader and the Empire, Rey, a scavenger from the planet Jakku, finds a BB-8 droid that knows the whereabouts of the long lost Luke Skywalker. Rey, as well as a rogue stormtrooper and two smugglers, are thrown into the middle of a battle between the Resistance and the daunting legions of the First Order. A scavenger (Daisy Ridley) and a renegade stormtrooper (John Boyega) enlist the help of legendary smugglers/freedom fighters Han Solo (Harrison Ford) and Chewbacca to transport a droid carrying information regarding the whereabouts of long lost Jedi Master Luke Skywalker to General Leia Organa of the Resistance before it falls into the hands of Kylo Ren and the First Order. When critical information is placed into a simple droid, both the evil First Order and the heroic Resistance go searching for it. Then something neither of them planned for happens: Rey, a scavenger from the planet Jakku finds the droid and keeps it as her own. Finn, an ex-stormtrooper who hopes to leave his past behind him, crosses paths with her and breaks the news of what exactly the importance of the droid is. Next thing either of them know is that they are on the run in order to withhold the droid from the First Order. They meet a pair of old buddies and after a few skirmishes between them and the determined First Order, the droid is brought to the Resistance base. There, multiple plans are hatched against the First Order while the secret information on the droid is slowly and surely working itself out... 30 years ago the Empire was defeated and now a new threat, the First Order has risen from the ashes of the Empire. A scavenger called Rey has come into contact with a droid that contains a map to the legendary Luke Skywalker, who has vanished. Rey and a rogue stormtrooper called Finn find themselves in a monumental conflict between good and evil, that will see faces old and new. Thirty years after the Galactic Empire vanquished, a new threat rises. The First Order attempt to rule the Galaxy and only a small bunch of heroes have the ability to stop them. Meanwhile, a female scavenger named Rey teams up with a rogue stormtroopter to return a droid to the resistance base containing a map to a legendary Jedi Master. The Empire is no more. In its place, The First Order has risen from the ashes of Darth Vader's legacy and aims to consolidate its power across the galaxy. However, The First Order is trying to find Luke Skywalker, the last Jedi, and wipe him off the face of galaxy. In a desperate bid to bide time for Luke, The Resistance sends veteran X-Wing pilot Poe Dameron to find out Skywalker's location. In a race against time and tyranny, The First Order and The Resistance are trying to find the galaxy's greatest Jedi before it's too late. The fate of the universe hangs in the balance.",
    "movie_genre": "Fantasy"
},
{
    "movie_id": "tt1408101",
    "movie_title": "Star Trek Into Darkness",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTk2NzczOTgxNF5BMl5BanBnXkFtZTcwODQ5ODczOQ@@.jpg",
    "movie_storyLines": "After the crew of the Enterprise find an unstoppable force of terror from within their own organization, Captain Kirk leads a manhunt to a war-zone world to capture a one-man weapon of mass destruction. When the USS Enterprise crew is called back home, they find an unstoppable force of terror from within their own organization has detonated the fleet and everything it stands for, leaving our world in a state of crisis. With a personal score to settle, Captain Kirk leads a manhunt to a war-zone world to capture a one-man weapon of mass destruction. As our space heroes are propelled into an epic chess game of life and death, love will be challenged, friendships will be torn apart, and sacrifices must be made for the only family Kirk has left: his crew. The latest mission of the USS Enterprise crew takes them into deep space to rescue an endangered species from an active volcano. However, once again Captain Kirk's reckless behavior compromises the mission and nearly gets him booted from Starfleet. Turning back to his mentor Admiral Pike, Kirk is demoted to an academy cadet and has to start over. However, when a ruthless warlord attacks Starfleet and shoots Admiral Pike in the process, Kirk takes command and takes the Enterprise deep into the neutral zone and the Klingon homeworld. Unknown to the crew, a Starfleet renegade is manipulating the Federation and the Klingons into a possible war. Kirk, Spock and the rest of the crew must stop the war before all hell breaks loose. And what awaits the crew of the USS Enterprise on their forthcoming five-year mission?",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt0121766",
    "movie_title": "Star Wars: Episode III - Revenge of the Sith",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BNTc4MTc3NTQ5OF5BMl5BanBnXkFtZTcwOTg0NjI4NA@@.jpg",
    "movie_storyLines": "Three years into the Clone Wars, the Jedi rescue Palpatine from Count Dooku. As Obi-Wan pursues a new threat, Anakin acts as a double agent between the Jedi Council and Palpatine and is lured into a sinister plan to rule the galaxy. Nearly three years have passed since the beginning of the Clone Wars. The Republic, with the help of the Jedi, take on Count Dooku and the Separatists. With a new threat rising, the Jedi Council sends Obi-Wan Kenobi and Anakin Skywalker to aid the captured Chancellor. Anakin feels he is ready to be promoted to Jedi Master. Obi-Wan is hunting down the Separatist General, Grievous. When Anakin has future visions of pain and suffering coming Padmé's way, he sees Master Yoda for counsel. When Darth Sidious executes Order 66, it destroys most of all the Jedi have built. Experience the birth of Darth Vader. Feel the betrayal that leads to hatred between two brothers. And witness the power of hope. The Jedi Order is on the brink of collapse and Anakin Skywalker no longer believes in the wisdom of his master, Obi-Wan Kenobi. As The Force calls him to decide Padme's fate, Anakin will desperately explore every possibility to save his wife from imminent death in childbirth. Three years after the events of Episode II, a new threat emerges. The commander of the Droid Army, General Grievous, kidnaps Chancellor Palpatine. The Jedi send Anakin and Obi-Wan to rescue the Chancellor and put an end to the Separatists wrath on the galaxy. But with an unfortunate turn of events, things don't turn out the way they'd envisioned... Discover the true power of the dark side in Star Wars:Episode III-Revenge of the Sith. Years after the onset of the Clone Wars;the noble Jedi Knights lead a massive clone army into a galaxy-wide battle against the Separatists. When the sinister Sith unveil a thousand-year-old plot to rule the galaxy;The Republic crumbles and from its ashes rises the evil Galactic Empire. Jedi hero Anakin Skywalker is seduced by the dark side of the Force to become the Emperor's new apprentice-Darth Vader. The Jedi are decimated;as Obi-Wan Kenobi and Jedi Master Yoda are forced into hiding. The chancellor is kidnapped so Anakin and obi wan go to rescue him and kill Count Dooku, the Sith Lord apprentice, which angers Obi Wan because it is not the Jedi way. Anakin finds out Padmé is pregnant, which makes him happy. Anakin has a vision of Padmé dying in childbirth, so he goes to the Chancellor for advice. Papa Palps, AKA The Senate, tells Anakin the tragedy of Darth Plageuis the Wise and tells Anakin that the dark side of the force is the pathway to many abilities some consider to be unnatural, meaning bringing someone back from the dead, essentially granting immortality. This conversation tempts Anakin to the dark side, while also making him suspicious of the chancellor being Darth Sidious. The Senate(Papa Palps) makes Anakin his personal representative on the Jedi Council. However, unlike everyone else on the council, he was not a Jedi Master yet, he was but a lowly Jedi Knight. Thi",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt1517451",
    "movie_title": "A Star Is Born",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BNmE5ZmE3OGItNTdlNC00YmMxLWEzNjctYzAwOGQ5ODg0OTI0XkEyXkFqcGdeQXVyMTMxODk2OTU@.jpg",
    "movie_storyLines": "A musician helps a young singer find fame as age and alcoholism send his own career into a downward spiral. Seasoned musician Jackson Maine (Bradley Cooper) discovers-and falls in love with-struggling artist Ally (Gaga). She has just about given up on her dream to make it big as a singer - until Jack coaxes her into the spotlight. But even as Ally's career takes off, the personal side of their relationship is breaking down, as Jack fights an ongoing battle with his own internal demons. Jackson Maine, a famous country music singer privately battling an alcohol and drug addiction, plays a concert in California. His main support is Bobby, his manager and older half-brother. After the show, Jackson visits a drag bar where he witnesses a performance by Ally, a waitress and singer-songwriter. Jackson is amazed by her performance, and they spend the night speaking to each other, where Ally discloses to him the troubles she has faced in pursuing a professional music career. Jackson invites Ally to his next show. Despite her initial refusal she attends and, with Jackson's encouragement, sings on stage with him. Jackson invites Ally to go on tour with him, and they form a romantic relationship. In Arizona, Ally and Jackson visit the ranch where Jackson grew up and where his father is buried, only to discover that Bobby sold the land. Angered at his betrayal, Jackson punches Bobby, who subsequently quits as his manager. Before doing so, Bobby reveals that he did inform Jackson about the sale, but the latter was too inebriated to notice.",
    "movie_genre": "Drama"
},
{
    "movie_id": "tt0120915",
    "movie_title": "Star Wars: Episode I - The Phantom Menace",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BYTRhNjcwNWQtMGJmMi00NmQyLWE2YzItODVmMTdjNWI0ZDA2XkEyXkFqcGdeQXVyNTAyODkwOQ@@.jpg",
    "movie_storyLines": "Two Jedi escape a hostile blockade to find allies and come across a young boy who may bring balance to the Force, but the long dormant Sith resurface to claim their original glory. The evil Trade Federation, led by Nute Gunray is planning to take over the peaceful world of Naboo. Jedi Knights Qui-Gon Jinn and Obi-Wan Kenobi are sent to confront the leaders. But not everything goes to plan. The two Jedi escape, and along with their new Gungan friend, Jar Jar Binks head to Naboo to warn Queen Amidala, but droids have already started to capture Naboo and the Queen is not safe there. Eventually, they land on Tatooine, where they become friends with a young boy known as Anakin Skywalker. Qui-Gon is curious about the boy, and sees a bright future for him. The group must now find a way of getting to Coruscant and to finally solve this trade dispute, but there is someone else hiding in the shadows. Are the Sith really extinct? Is the Queen really who she says she is? And what's so special about this young boy? When the Trade Federation organize a blockade around the planet Naboo, the Supreme Chancellor Valorum sends the Jedi Qui-Gon Jinn and Obi-Wan Kenobi to negotiate the end of the blockade. However the evil Viceroy Nute Gunray is ordered to kill the Jedi and invade Naboo. However the Jedi escape and Qui-Gon saves the life of the clumsy Gungan Jar Jar Binks. The outcast native takes the Jedi to his submerged city and the Gungan leader gives transportation to them. The Jedi head to the capital to warn Queen Amidala about the invasion. However she has been captured by the Federation droids but the Jedi rescue the queen and her court and they flee in a spacecraft that is damaged when they cross the blockade. They land on a desert planet and Qui-Gon Jinn goes to the town with Jar Jar, the droid R2-D2 and the queen's assistant Padmé to seek the necessary part for the spacecraft. When they find the component, they do not have money to buy it. But the slave boy Anakin Skywalker offers to dispute a race with his pod to raise the necessary money. Qui-Gon feels the Force in the boy and accepts his offer. Will the boy win the race? What will happen to Naboo? Will Queen Amidala be capable to convince the politicians to release her planet from the Trade Federation? While the ruthless Trade Federation ravage the peaceful planet of Naboo, Jedi Master Qui Gon Jinn and his apprentice Obi Wan Kenobi are sent to rescue and protect the young Queen Amidala, who is determined to convince the Senate to help her restore peace to her home. Escaping to the planet Tatooine, the Jedi come across an eager slave boy named Anakin Skywalker who dreams of becoming a Jedi. What they don't know however is that they are being used in a sinister plot by the mysterious Sith, hiding deep in the shadows. When the evil Trade Federation plots to take over the peaceful planet of Naboo, Jedi warrior Qui-Gon Jinn and his apprentice Obi-Wan Kenobi embark on an amazing adventure to save the planet. With them on their journey is the young Queen Ami",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt4587656",
    "movie_title": "The Star",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTU4MDQ4NTM2N15BMl5BanBnXkFtZTgwNDM1NTIzMzI@.jpg",
    "movie_storyLines": "A small but brave donkey and his animal friends become the unsung heroes of the first Christmas. In Sony Pictures Animation's THE STAR, a small but brave donkey named Bo yearns for a life beyond his daily grind at the village mill. One day he finds the courage to break free, and finally goes on the adventure of his dreams. On his journey, he teams up with Ruth, a lovable sheep who has lost her flock and Dave, a dove with lofty aspirations. Along with three wisecracking camels and some eccentric stable animals, Bo and his new friends follow the Star and become accidental heroes in the greatest story ever told - the first Christmas. From the Creators of Miracles from Heaven and Cloudy with a Chance of Meatballs comes the story about a donkey named Bo who wants life beyond his village. He meets a sheep named Ruth and a dove named Dave and they follow the Star to discover the first Christmas which is the birth of Jesus. In \"9 months B.C.\", Mary is visited by an angel telling her she will bear the Messiah. A pygmy named Abby overhears and tells the other animals as a star begins glowing brightly in the night. Six months later, a young donkey is tired of milling wheat and wishes to join a traveling caravan so that he may feel important. An older donkey helps him escape the miller who owns them and he ends up with an injured ankle at the house of Joseph and Mary who just celebrated their wedding. Mary takes the donkey in and names him Boaz, or Bo, and reveals to Joseph that she is pregnant, with Joseph accepting Mary's situation after praying to God. During this time, Bo and his dove friend Dave, plot to escape despite Mary's kindness, but end up staying three more months..",
    "movie_genre": "Religious Drama"
},
{
    "movie_id": "tt2660888",
    "movie_title": "Star Trek Beyond",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BNDc2YThlMTgtN2M3Yi00YzkxLWE4MDQtMWJmYmZiNTNjNjJlXkEyXkFqcGdeQXVyMjUzOTY1NTc@.jpg",
    "movie_storyLines": "The crew of the USS Enterprise explores the furthest reaches of uncharted space, where they encounter a new ruthless enemy, who puts them, and everything the Federation stands for, to the test. After stopping off at Starbase Yorktown, a remote outpost on the fringes of Federation space, the USS Enterprise, halfway into their five-year mission, is destroyed by an unstoppable wave of unknown aliens. With the crew stranded on an unknown planet and with no apparent means of rescue, they find themselves fighting against a ruthless enemy with a well-earned hatred of the Federation and everything it stands for. Only a rebellious alien warrior can help them reunite and leave the planet to stop this deadly menace from beginning a possible galactic war. Getting through the first half of their five-year mission, Captain Kirk and the USS Enterprise crew now venture into uncharted territories. They arrive at Starbase Yorktown for shore leave, Kirk intends to be promoted to Vice Admiral to remain there and has recommended Spock for his present position as ship's captain. After a devastating attack by a massive army of unknown aliens, Kirk and his crew find themselves stranded on an unknown planet with no means of contacting the Federation or each other. The alien warlord Krall seeks an ancient weapon called the Abronath that Kirk has kept after an unsuccessful diplomatic mission. Reunited and aided by the alien warrior Jaylah, Kirk and crew must fight to survive and take on this deadly menace with a strong hatred for the Federation. Will they be able to destroy the new danger before it's too late?",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt0086190",
    "movie_title": "Star Wars: Episode VI - Return of the Jedi",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BOWZlMjFiYzgtMTUzNC00Y2IzLTk1NTMtZmNhMTczNTk0ODk1XkEyXkFqcGdeQXVyNTAyODkwOQ@@.jpg",
    "movie_storyLines": "After a daring mission to rescue Han Solo from Jabba the Hutt, the Rebels dispatch to Endor to destroy the second Death Star. Meanwhile, Luke struggles to help Darth Vader back from the dark side without falling into the Emperor's trap. Luke Skywalker battles Jabba the Hutt and Darth Vader to save his comrades in the Rebel Alliance and triumph over the Galactic Empire. Han Solo and Princess Leia reaffirm their love, and team with Chewbacca, Lando Calrissian, the Ewoks, and droids C-3PO and R2-D2 to aid in the disruption of the Dark Side, and the defeat of the evil emperor. Emperor Palpatine, Darth Vader, and the Empire are building a new Death Star. Meanwhile, Han Solo has been imprisoned, and Luke Skywalker has sent R2-D2 and C-3PO to try and free him. Princess Leia, disguised as a bounty hunter, and Chewbacca go along as well. The final battle takes place on the Forest Moon of Endor, with its natural inhabitants, the Ewoks, lending a hand to the rebels. As the evil Emperor Palpatine oversees the construction of the new Death Star by Darth Vader and the Galactic Empire, smuggler Han Solo is rescued from the clutches of the vile gangster Jabba the Hutt by his friends, Luke Skywalker, Princess Leia, Lando Calrissian, and Chewbacca. Leaving Luke Skywalker Jedi training with Master Yoda, Solo returns to the Rebel fleet to prepare to complete his battle with the Empire. During the ensuing fighting, the newly returned Luke Skywalker is captured by Darth Vader. Light-sabers sparkle, the Millennium Falcon flashes through hyperspace, and creatures from all over the galaxy defy the Galactic Empire, in this stunning third chapter of the \"Star Wars\" saga. As the Rebels prepare to attack Emperor Palpatine's awesome new Death Star, Han Solo remains imprisoned by the loathsome outlaw Jabba the Hutt, who has also captured Princess Leia. Luke Skywalker rescues his friends, but he will not be a true Jedi Knight until he confronts Darth Vader again, who has sworn to win him over to the Dark Side of the Force. With old favorites like Chewbacca, Yoda, R2-D2, C-3PO, and Lando Calrissian, plus the small, but stalwart Ewoks. The Empire is more than halfway through construction of a new Death Star, almost twice as big, but more than twice as powerful. When completed, it will spell certain doom for Luke Skywalker and the rebels. Han Solo is a prisoner of crime lord Jabba the Hutt, and Princess Leia soon finds herself in the gangster's hands. Luke Skywalker, aided by C-3PO and R2-D2, makes his way into Jabba's palace, hoping to secure his friends' freedom. But Jabba has no intention of doing so, and tries to kill them all. After escaping from Jabba and the sands of Tatooine, they regroup with the rebel fleet, which is massing for an attack against the new satellite battle station at Endor. Lando Calrissian is pressed into action to lead the rebel fighter attack, while Han is put in charge of a group of soldiers to take out the shield generator protecting the Death Star. However, Luke Skywalker surrenders to Darth Vader's",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt2527336",
    "movie_title": "Star Wars: Episode VIII - The Last Jedi",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMjQ1MzcxNjg4N15BMl5BanBnXkFtZTgwNzgwMjY4MzI@.jpg",
    "movie_storyLines": "The Star Wars saga continues as new heroes and galactic legends go on an epic adventure, unlocking mysteries of the Force and shocking revelations of the past. Jedi Master-in-hiding Luke Skywalker unwillingly attempts to guide young hopeful Rey in the ways of the force, while Leia, former princess turned general, attempts to lead what is left of the Resistance away from the ruthless tyrannical grip of the First Order. Continuing where   left off,   sees The Resistance striving to stay ahead of The First Order. Rey seeks guidance from Jedi-in-hiding Luke Skywalker so she can learn the ways of The Force, and defected storm-trooper FN-2187 (Finn) will have his faith in The Resistance tested as his past with The First Order comes to haunt not only him, but also threatens the very foundations of the galaxy's future. Following the battle of Starkiller Base, General Leia Organa leads Resistance forces to flee D'Qar when a First Order fleet arrives. Poe Dameron leads a costly counterattack that destroys a First Order dreadnought, but after the Resistance escapes to hyperspace, the First Order tracks them and attacks the Resistance convoy. Kylo Ren, Leia's son, hesitates to fire on the lead Resistance ship after sensing his mother's presence, but his wing-men destroy the bridge, killing most of the Resistance leadership and incapacitating Leia, who survives by using the Force. Disapproving of new leader Vice Admiral Holdo's passive strategy, Poe helps Finn, BB-8, and mechanic Rose Tico embark on a secret mission to disable the First Order's tracking device..",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt2527338",
    "movie_title": "Star Wars: Episode IX - The Rise of Skywalker",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMDljNTQ5ODItZmQwMy00M2ExLTljOTQtZTVjNGE2NTg0NGIxXkEyXkFqcGdeQXVyODkzNTgxMDg@.jpg",
    "movie_storyLines": "In the riveting conclusion of the landmark Skywalker saga, new legends will be born-and the final battle for freedom is yet to come. While the First Order continues to ravage the galaxy, Rey finalizes her training as a Jedi. But danger suddenly rises from the ashes as the evil Emperor Palpatine mysteriously returns from the dead. While working with Finn and Poe Dameron to fulfill a new mission, Rey will not only face Kylo Ren once more, but she will also finally discover the truth about her parents as well as a deadly secret that could determine her future and the fate of the ultimate final showdown that is to come.",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt3748528",
    "movie_title": "Rogue One: A Star Wars Story",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMjEwMzMxODIzOV5BMl5BanBnXkFtZTgwNzg3OTAzMDI@.jpg",
    "movie_storyLines": "In a time of conflict, a group of unlikely heroes band together on a mission to steal the plans to the Death Star, the Empire's ultimate weapon of destruction. All looks lost for the Rebellion against the Empire as they learn of the existence of a new super weapon, the Death Star. Once a possible weakness in its construction is uncovered, the Rebel Alliance must set out on a desperate mission to steal the plans for the Death Star. The future of the entire galaxy now rests upon its success. As the Rebellion spreads its influence among people, the Galactic Empire builds a super weapon capable of destroying an entire planet. A group of rebels disobeys orders and take a shuttle to go on a mission to steal plans that hide secrets on how to destroy this weapon of mass destruction. In a short time period right before the events of A New Hope, we find ourselves in the middle of a galactic war between the Rebel Alliance and the Empire. With a desperate goal of retrieving the secret plans for the weapon of mass destruction: The Death Star, we follow a group of rebel spies whose hope is to restore peace to the galaxy. After the rise of the Galactic Empire in   and before the Battle of Yavin in  ,   follows the outcast Jyn Erso and how she came to join the Rebel Alliance. Joining the Alliance, Jyn finds herself in the middle of the ultimate conflict between the Rebels and the Empire: her father Galen has built a terrifying super-weapon: The Death Star, a battle station capable of destroying an entire planet. Will Jyn and the Rebels be able to save her father from the Empire and cripple their super-weapon, or will it be too late?",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt0796366",
    "movie_title": "Star Trek",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMjE5NDQ5OTE4Ml5BMl5BanBnXkFtZTcwOTE3NDIzMw@@.jpg",
    "movie_storyLines": "The brash James T. Kirk tries to live up to his father's legacy with Mr. Spock keeping him in check as a vengeful Romulan from the future creates black holes to destroy the Federation one planet at a time. On the day of James T. Kirk's birth, his father dies on his damaged starship in a last stand against a Romulan mining vessel looking for Ambassador Spock, who in this time, has grown on Vulcan disdained by his neighbors for his half-human heritage. 25 years later, James T. Kirk has grown into a young rebellious troublemaker. Challenged by Captain Christopher Pike to realize his potential in Starfleet, he comes to annoy academy instructors like Commander Spock. Suddenly, there is an emergency on Vulcan and the newly-commissioned USS Enterprise is crewed with promising cadets like Nyota Uhura, Hikaru Sulu, Pavel Chekov and even Kirk himself, thanks to Leonard McCoy's medical trickery. Together, this crew will have an adventure in the final frontier where the old legend is altered forever as a new version of the legend begins. When a Romulan mining vessel attacks the USS Kelvin, Lt. George Kirk substitutes his captain, who goes to meet the Romulan captain on his vessel to negotiate a ceasefire. He orders the evacuation of the damaged starship, including his wife who goes into labor giving birth to their son James Kirk, and crashes the Kelvin against the vessel. Aboard the USS Enterprise, the most sophisticated starship ever constructed, a novice crew embarks on its maiden voyage. Their path takes them on a collision course with Nero, the Romulan captain from the future whose mission of vengeance threatens the Federation. Once humanity would survive, rebellious young officer James T. Kirk and coolly logical Vulcan officer Spock must move beyond their rivalry and find a way to stop Nero before he destroys Earth.",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt0076759",
    "movie_title": "Star Wars: Episode IV - A New Hope",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BOTA5NjhiOTAtZWM0ZC00MWNhLThiMzEtZDFkOTk2OTU1ZDJkXkEyXkFqcGdeQXVyMTA4NDI1NTQx.jpg",
    "movie_storyLines": "Luke Skywalker joins forces with a Jedi Knight, a cocky pilot, a Wookiee and two droids to save the galaxy from the Empire's world-destroying battle station, while also attempting to rescue Princess Leia from the mysterious Darth Vader. The Imperial Forces, under orders from cruel Darth Vader, hold Princess Leia hostage in their efforts to quell the rebellion against the Galactic Empire. Luke Skywalker and Han Solo, captain of the Millennium Falcon, work together with the companionable droid duo R2-D2 and C-3PO to rescue the beautiful princess, help the Rebel Alliance and restore freedom and justice to the Galaxy. Part IV in George Lucas' epic, this movie opens with a rebel ship being boarded by the tyrannical Darth Vader. The plot then follows the life of a simple farm boy, Luke Skywalker, as he and his newly met allies (Han Solo, Chewbacca, Obi-wan Kenobi, C-3PO, R2-D2) attempt to rescue a rebel leader, Princess Leia, from the clutches of the Empire. The conclusion is culminated as the rebels, including Skywalker and flying ace Wedge Antilles make an attack on the Empire's most powerful and ominous weapon, the Death Star. Luke Skywalker stays with his aunt and uncle on a farm on Tatooine. He is desperate to get off this planet and get to the Academy like his friends, but his uncle needs him for the next harvest. Meanwhile, an evil emperor has taken over the galaxy, and has constructed a formidable \"Death Star\" capable of destroying whole planets. Princess Leia, a leader in the resistance movement, acquires plans of the Death Star, places them in R2-D2, a droid, and sends him off to find Obi-wan Kenobi. Before he finds him, R2-D2 ends up on the Skywalkers' farm with his friend C-3PO. R2-D2 then wanders into the desert, and when Luke follows, they eventually come across Obi-wan. Will Luke, Obi-wan, and the two droids be able to destroy the Death Star, or will the Emperor rule forever? Princess Leia is held hostage by the evil forces of the Galactic Empire in their effort to take over the galaxy. Venturesome Luke Skywalker and dashing Captain Han Solo team together with the lovable robotic duo, R2-D2 and C-3PO, to rescue the beautiful Princess Leia and restore justice in the galaxy. In a distant galaxy eons before the creation of the planet known as Earth, vast civilizations have evolved, and ruling the galaxy is an interstellar Empire created from the ruins of an Old Republic that held sway for generations. It is a time of civil war, as solar systems have broken away from the Empire and are waging a war of rebellion. During a recent battle, technical schematics for a gigantic space station, code named the Death Star, have been unearthed by rebel spies, and a young woman who is a dissident member of the Imperial Senate, under the cover of a diplomatic mission to the planet Alderaan, is trying to smuggle these plans to the rebellion. But her spacecraft is attacked by a vast warship of the Empire and seized. The dissident Senator is captured, but the plans for the Death Star are nowhere to be found",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt0092007",
    "movie_title": "Star Trek IV: The Voyage Home",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BZmU3ZGE3NzEtYTdmYi00YTYxLWIxYTItZGY5YjFlOTA2NWI3XkEyXkFqcGdeQXVyMjUzOTY1NTc@.jpg",
    "movie_storyLines": "To save Earth from an alien probe, Admiral James T. Kirk and his fugitive crew go back in time to San Francisco in 1986 to retrieve the only beings who can communicate with it: humpback whales. The most acclaimed Star Trek adventure of all time with an important message. It is the 23rd century, and a mysterious alien probe is threatening Earth by evaporating the oceans and destroying the atmosphere. In their frantic attempt to save mankind, Admiral Kirk and his crew must time travel back to 1986 San Francisco where they find a world of punk, pizza and exact-change buses that are as alien to them as anything they have ever encountered in the far-off reaches of the galaxy. William Shatner and Leonard Nimoy return as Kirk and Spock, along with the entire Star Trek crew. It is the 23rd century, and a space probe appears over Earth, emanating strange sounds towards the planet, and apparently waiting for something. As time goes on, the probe starts to cause major storms on Earth and threaten its destruction. Admiral James T. Kirk and crew are called upon once again to save mankind. They discover the strange sounds are actually the songs of the humpback whale - which has been hunted to extinction. They have only one choice - to attempt to time travel back into the 20th century, locate two whales, and bring them back to 23rd century Earth to respond to the probe.",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt0102975",
    "movie_title": "Star Trek VI: The Undiscovered Country",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BYzJiZDdmODQtMDM0Yi00ZTcwLWJjMjItM2QxOWJjZDdmYmQ5XkEyXkFqcGdeQXVyMjUzOTY1NTc@.jpg",
    "movie_storyLines": "On the eve of retirement, Kirk and McCoy are charged with assassinating the Klingon High Chancellor and imprisoned. The Enterprise crew must help them escape to thwart a conspiracy aimed at sabotaging the last best hope for peace. After an explosion on their moon, the Klingons have an estimated 50 years before their ozone layer is completely depleted, and they all die. They have only one choice - to make peace with the Federation, which will mean an end to 70 years of conflict. Captain James T. Kirk and crew are called upon to help in the negotiations because of their experience with the Klingons. Peace talks don't quite proceed, and Kirk and McCoy are convicted of assassinating the Klingon High Chancellor, and imprisoned on Rura Penthe, a snowy hard-labor prison camp. Will they manage to escape? And will there ever be peace with the Klingons? After a lunar cataclysm brings the Klingons to their knees, the foreign concept of peace with the Federation may be finally within reach. After 70 years of hostility, the Federation and the Klingon Empire prepare for a peace summit. Ironically, Captain James T. Kirk has been assigned as the first emissary to broker that peace. However, the prospect of intergalactic glasnost with sworn enemies is an alarming one. When the Klingon flagship is attacked and the USS Enterprise is held accountable, the dogs of war are unleashed again, as both worlds brace for what may be their final, deadly encounter.",
    "movie_genre": ""
},
{
    "movie_id": "tt0117731",
    "movie_title": "Star Trek: First Contact",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BYzMzZmE3MTItODYzYy00YWI5LWFkNWMtZTY5NmU2MDkxYWI1XkEyXkFqcGdeQXVyMjUzOTY1NTc@.jpg",
    "movie_storyLines": "The Borg travel back in time intent on preventing Earth's first contact with an alien species. Captain Picard and his crew pursue them to ensure that Zefram Cochrane makes his maiden flight reaching warp speed. In the twenty-fourth century, the crew of the U.S.S. Enterprise NCC-1701-E has been ordered to patrol the Romulan Neutral Zone by the Federation to avoid interference with their battle against the insidious Borg. Witnessing the loss of the battle, Captain Jean-Luc Picard ignores orders and takes command of the fleet engaging the Borg. But the Borg plan to travel back into the twenty-first century through a vortex with the intention to stop Earth's first contact with an alien race (the Vulcans). Following the Borg sphere, Picard and his crew realize that they have taken over the Enterprise in order to carry out their mission. Their only chance to do away with the Borg and their seductive Queen is to make sure that Zefram Cochrane makes his famous faster-than-light travel to the stars. The Borg have invaded Earth's galaxy, resulting in a battle with Star Fleet. The newly-commissioned USS Enterprise-E, commanded by Captain Jean-Luc Pickard, is ordered away from the action as Star Fleet command fear that Pickard's previous assimilation by the Borg will affect his judgement. Once it is clear that Star Fleet are losing the battle, Pickard disobeys orders and sets course for Earth, arriving in the nick of time. The Enterprise manages to save the Earth from destruction but it is soon apparent that the Borg do not intend to destroy Earth but change the course of its history. It is the twenty-fourth century, and the Borg (cybernetic lifeforms) have spread across the galaxy with one sole purpose: to assimilate and conquer all races. Under the command of their seductive and sadistic Queen, the Borg are headed to Earth with a devious plan involving time travel to alter history. After an epic battle against the Borg, Captain Jean-Luc Picard and the U.S.S. Enterprise NCC-1701-E crew follow the Borg sphere back into the twenty-first century, and must battle the Borg Queen before she assimilates mankind. Meanwhile, Picard and his crew must make sure that Zefram Cochrane makes his famous warp flight, and makes Earth's first contact with an alien species (the Vulcans).",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt0098382",
    "movie_title": "Star Trek V: The Final Frontier",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BZmUzNjYzZDEtMWQ1Ny00OGIxLTk4MTktMzU5NTZmZjk5MTQyXkEyXkFqcGdeQXVyMjUzOTY1NTc@.jpg",
    "movie_storyLines": "Captain Kirk and his crew must deal with Mr. Spock's long-lost half-brother who hijacks the Enterprise for an obsessive search for God at the center of the galaxy. When the newly-christened starship Enterprise's shakedown cruise goes poorly, Captain Kirk and crew put her into Spacedock for repairs. But an urgent mission interrupts their Earth-bound shore leave. A renegade Vulcan named Sybok has taken three ambassadors hostage on Nimbus III, the Planet of Galactic Peace. This event also attracts the attention of a Klingon captain who wants to make a name for himself and sets out to pursue the Enterprise. Sybok's ragtag army captures the Enterprise and takes her on a journey to the center of the galaxy in search of the Supreme Being. It is the 23rd Century and vacationing Captain Kirk faces two challenges: climbing Yosemite's El Capitan and teaching campfire songs to Spock. But vacations are cut short when a renegade Vulcan with a startling secret hijacks the Enterprise in order to find a mythical planet. Kirk and his crew set out to stop this madman in an adventure that takes them to the center of the universe and, perhaps, before the face of God. With the crew under Vulcan control, the captain must rely on an unlikely alliance to save the galaxy. Meanwhile, a Klingon captain wants to make a name for himself and sets out to pursue the Enterprise and intercept Kirk.",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt8924990",
    "movie_title": "Star Wars: Episode V - The Empire Strikes Back: Deleted Scenes",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BYmU1NDRjNDgtMzhiMi00NjZmLTg5NGItZDNiZjU5NTU4OTE0XkEyXkFqcGdeQXVyNzkwMjQ5NzM@.jpg",
    "movie_storyLines": "Deleted scenes from Star Wars: Episode V - The Empire Strikes Back (1980).",
    "movie_genre": "Documentary"
},
{
    "movie_id": "tt7653254",
    "movie_title": "Marriage Story",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BZGVmY2RjNDgtMTc3Yy00YmY0LTgwODItYzBjNWJhNTRlYjdkXkEyXkFqcGdeQXVyMjM4NTM5NDY@.jpg",
    "movie_storyLines": "Noah Baumbach's incisive and compassionate look at a marriage breaking up and a family staying together. 'Marriage Story' is Academy-Award-nominated filmmaker Noah Baumbach's incisive and compassionate look at a marriage breaking up--and a family staying together. The film stars Scarlett Johansson and Adam Driver and co-stars Laura Dern, Alan Alda, and Ray Liotta. Sadly, after numerous disastrous sessions of marital mediation, New York City's brilliant theatre director Charlie and one-time Los Angeles movie actress Nicole decide to split up, putting an end to their decade-long marriage. However, divorce is horrible--and as the once close-knit couple struggles to make it work for the sake of their eight-year-old son Henry, vitriolic accusations and bitter resentment threaten the very foundation of Charlie and Nicole's so-called amicable separation. Now, shrewd and absurdly costly lawyers take over, and things are bound to get messy. But why are love's wounds so deep, and cruelly painful? In the end, is love always forever?",
    "movie_genre": "Drama"
},
{
    "movie_id": "tt12247528",
    "movie_title": "Star Wars: Episode II - Attack of the Clones: Deleted Scenes",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BYjczNGQ3OTgtOWRmYi00NzFlLTlmNWMtYmE0MWY0NDlhOTFiXkEyXkFqcGdeQXVyNjY5Mzc0MTU@.jpg",
    "movie_storyLines": "Deleted scenes from 'Star Wars: Episode II - Attack of the Clones'.",
    "movie_genre": "Documentary"
},
{
    "movie_id": "tt5118314",
    "movie_title": "Star Wars: Episode III - The Return of Darth Vader",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMjE0MDI1NTE2Ml5BMl5BanBnXkFtZTcwNjM1ODAzMQ@@.jpg",
    "movie_storyLines": "A short feature on Darth Vader.",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt1821658",
    "movie_title": "The Nut Job",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTQ1NjAxMDUzN15BMl5BanBnXkFtZTgwOTE5NDM3MDE@.jpg",
    "movie_storyLines": "An incorrigibly self-serving exiled squirrel finds himself helping his former park brethren survive by raiding a nut store, a location that also happens to be a front for a human gang's bank robbery. In a city park, Surly the Squirrel has finally gone too far with his latest caper . Now exiled, Surly and his rat buddy Buddy's collective nightmare on the streets ends when they discover a nut store to raid. With no other options, she arranges a deal to help in Surly's heist for the colony, even while Surly fully intends to betray it. However, there is more going on with the nut store being a front for bank robbers while Raccoon has his own agenda to ensure his own power. In the mayhem to come, Surly finds himself challenged in ways he never expected and discovering the real prize to treasure in this adventure. Surly is a squirrel who believes that the world is every man for himself, when his latest crime gets him kicked out of the park community, but what they don't know is that the joint is actually a hideout for criminals who plan to rob the bank next door, also unaware that raccoon, the park leader plans to destroy the nut heist to reclaim his power: with obstacles, surly must claim the nuts, stop the bank robbery, foil raccoon's plans and finally learn what life is really about. In the fictional town of Oakton City, a purple squirrel named Surly (Will Arnett) and his mute rat partner Buddy reside in Liberty Park where their thieving reputation has made them outcasts. A group of urban animals led by Raccoon (Liam Neeson) and his cardinal assistant are running low on food for winter. Red squirrel Andie (Katherine Heigl) and glory hogging gray squirrel Grayson (Brendan Fraser) compete with Surly and Buddy to scavenge from a peanut cart manned by Lucky (Scott Yaphe) and Fingers (James Rankin) who are casing a bank. The squirrels' efforts inadvertently end with the cart's propane tank exploding in the park after its cord was bitten by Fingers' pug Precious (Maya Rudolph). The runaway cart ends up destroying and burning the tree, where the animals store their food. Surly is banished and Buddy follows him..",
    "movie_genre": "Animation, Comedy"
},
{
    "movie_id": "tt11057644",
    "movie_title": "The Christmas Chronicles: Part Two",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMGJiZDc1OWMtNzMwMC00NzM0LTljMDgtZGJjODVhZDMzMmJjXkEyXkFqcGdeQXVyODk4OTc3MTY@.jpg",
    "movie_storyLines": "Kate Pierce, now a cynical teen, is unexpectedly reunited with Santa Claus when a mysterious troublemaker threatens to cancel Christmas - forever. While on Christmas vacation in Cancun with their respective mom and dad, a true Santa believing girl and a boy are kidnapped by a rebellious Santa hater as a plot for him to get into Santa's Village on the North Pole and destroy it. The kids are saved by Santa and taken to the elf populated Santa's Village and Mrs. Claus, where they get a tour of the place, dinner and bedtime story. The Santa hater starts his sabotage.",
    "movie_genre": "Adventure"
},
{
    "movie_id": "tt0060028",
    "movie_title": "Star Trek",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BNDRkMTNiNjgtZDIyOC00NmE1LTlkZjEtMGZiNTcyZDQ0NjcxXkEyXkFqcGdeQXVyNTE1NjY5Mg@@.jpg",
    "movie_storyLines": "In the 23rd Century, Captain James T. Kirk and the crew of the U.S.S. Enterprise explore the galaxy and defend the United Federation of Planets. A 1960's science fiction action adventure series set in the twenty-third century based around the crew of the U.S.S. Enterprise, representing the United Federation of Planets (including Earth) on a five-year mission in outer space to explore new worlds, seek new life and new civilizations, and to boldly go where no one has gone before. The Enterprise is commanded by handsome and brash Captain James Tiberius \"Jim\" Kirk ( ). Kirk's two best friends are Commander Spock ( ) (last name unpronounceable to humans) the ship's half-human/half-Vulcan Science Officer and First/Executive Officer (i.e. second-in-command) from the planet Vulcan, and Chief Medical Officer Dr. Leonard H. \"Bones\" McCoy ( ). They, along with a crew of approximately four hundred and thirty, including helmsman Lieutenant Hikaru Kato Sulu ( ), navigator Ensign Pavel Andreievich Chekov ( ), communications officer Lieutenant Nyota Uhura ( ), chief engineer Lieutenant Commander Montgomery \"Scotty\" Scott ( ), Nurse Christine Chapel ( ) and Yeoman Janice Rand ( ). The series follows them as they confront strange alien races, friendly and hostile alike, as they explore unknown worlds. We see the Enterprise and her crew battle aliens, megalomaniac computers, time paradoxes, psychotic murderers, and even Khan Noonien Singh ( ). The series is known for looking at then (1960's) hot topics such as sex, war, God, religion, politics, and racism and other things that make up the human condition through a lens of the future. The 79 (eighty if including  ) episode television series, which was produced from 1966 to 1969, has now cult characters and has fans all over the world. It is the twenty-third century and together with the crew of the Federation starship Enterprise we travel across the galaxy to meet new and exciting life forms on distant planets. The eighty episode television series, which was produced from 1966 to 1969, has now cult character and has fans all over the world.",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt0107290",
    "movie_title": "Jurassic Park",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMjM2MDgxMDg0Nl5BMl5BanBnXkFtZTgwNTM2OTM5NDE@.jpg",
    "movie_storyLines": "A pragmatic paleontologist touring an almost complete theme park on an island in Central America is tasked with protecting a couple of kids after a power failure causes the park's cloned dinosaurs to run loose. Huge advancements in scientific technology have enabled a mogul to create an island full of living dinosaurs. John Hammond has invited four individuals, along with his two grandchildren, to join him at Jurassic Park. But will everything go according to plan? A park employee attempts to steal dinosaur embryos, critical security systems are shut down and it now becomes a race for survival with dinosaurs roaming freely over the island. On Isla Nublar, a new park has just been built with genetically engineered dinosaurs. Tragedy strikes when one of the workers is killed by a velociraptor. The founder of the park, John Hammond, (Sir Richard Attenborough) requests Paleontologist Dr. Alan Grant (Sam Neill) and his assistant, Dr. Ellie Sattler (Laura Dern) to come to the park and ensure that it is safe. Also joining them are Hammond's lawyer Donald Gennaro (Martin Ferrero) and chaotician Dr. Ian Malcolm (Jeff Goldblum). When they reach the island, they are amazed to discover that Hammond has created living dinosaurs. However, at the same time, they all have their doubts. Later, Hammond's grandchildren Lex and Tim (Ariana Richards and Joseph Mazzello) join the group in a tour of the park. Sattler leaves the tour to take care of an ill triceratops. Soon the power in the park is shut down by computer systems geek Dennis Nedry (Wayne Knight), who wishes to steal embryos from the park to sell to a secret buyer. In the process, many dinosaurs escape their paddocks, including the deadly Tyrannosaurus Rex, who, during a thunderstorm, escapes his paddock and attacks the children, and eats Gennaro. Malcolm is injured and Grant and the children are then lost in the park. Meanwhile, Hammond, Sattler, and the rest of the operations team learn that Nedry (who in the meantime has been killed) has locked up the computer system to cover his tracks. They attempt to get power back in the park in order to escape the island. After shutting down the system, then restoring it, the group realizes that velociraptors are also on the loose, and are now on the hunt for the visitors. Paleontologists Alan Grant and Ellie Sattler and mathematician Ian Malcolm are among a select group chosen to tour an island theme park populated by dinosaurs created from prehistoric DNA. While the park's mastermind, billionaire John Hammond, assures everyone that the facility is safe, they find out otherwise when various ferocious predators break free and go on the hunt. John Hammond--the visionary billionaire entrepreneur and founder of the bio-engineering company InGen---calls in three experts to witness the wonders of the first-ever dinosaur preserve and put the investors' minds at ease. But there, on the isolated island of Isla Nublar, the hand-picked visitors' wide-eyed excitement will soon turn into pure horror when a devastating malfunc",
    "movie_genre": "Adventure"
},
{
    "movie_id": "tt3486354",
    "movie_title": "Star Wars: The Last Jedi",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BYTg3N2VkZGEtNjkwYi00ZWVlLWE1YmYtOTZiM2ZiZDY4NTE1L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzM4MjM0Nzg@.jpg",
    "movie_storyLines": "Two kids fight with light sabers around the house.",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt8111088",
    "movie_title": "The Mandalorian",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BZDhlMzY0ZGItZTcyNS00ZTAxLWIyMmYtZGQ2ODg5OWZiYmJkXkEyXkFqcGdeQXVyODkzNTgxMDg@.jpg",
    "movie_storyLines": "The travels of a lone bounty hunter in the outer reaches of the galaxy, far from the authority of the New Republic. After the stories of Jango and Boba Fett, another warrior emerges in the Star Wars universe. The Mandalorian is set after the fall of the Empire and before the emergence of the First Order. We follow the travails of a lone gunfighter in the outer reaches of the galaxy far from the authority of the New Republic.",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt0167261",
    "movie_title": "The Lord of the Rings: The Two Towers",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BZGMxZTdjZmYtMmE2Ni00ZTdkLWI5NTgtNjlmMjBiNzU2MmI5XkEyXkFqcGdeQXVyNjU0OTQ0OTY@.jpg",
    "movie_storyLines": "While Frodo and Sam edge closer to Mordor with the help of the shifty Gollum, the divided fellowship makes a stand against Sauron's new ally, Saruman, and his hordes of Isengard. The continuing quest of Frodo and the Fellowship to destroy the One Ring. Frodo and Sam discover they are being followed by the mysterious Gollum. Aragorn, the Elf archer Legolas, and Gimli the Dwarf encounter the besieged Rohan kingdom, whose once great King Theoden has fallen under Saruman's deadly spell. The Fellowship is torn apart. Sauron's power is growing stronger. While venturing on to Mordor, Frodo and Sam come across the grotesque creature Gollum, who is forever consumed by the Ring's power. Meanwhile, Aragorn, Gandalf, Legolas and Gimli meet up with new allies in the Plains of Rohan. Together, they must work to defend the people of Rohan against Sauron's puppet Saruman as he unleashes his armies from Isengard. All the while, Sauron prepares to launch an attack on Gondor. The War for the Ring begins here. Sauron's forces increase. His allies grow. The Ringwraiths return in an even more frightening form. Saruman's army of Uruk-hai is ready to launch an assault against Aragorn and the people of Rohan. Yet, the Fellowship is broken and Boromir is dead. For the little hope that is left, Frodo and Sam march on into Mordor, unprotected. Several new allies join with Aragorn, Gimli, Legolas, Pippin, and Merry, and they must defend Rohan and attack Isengard. Yet, while all this is going on, Sauron's troops mass toward Gondor, for the War of the Ring is about to begin. The Fellowship has been broken. Boromir is dead, Frodo Baggins and Samwise Gamgee have gone to Mordor alone to destroy the One Ring, Merry and Pippin have been captured by the Uruk-hai, and Aragorn, Legolas, and Gimli have made friends of the Rohan, a race of humans that are in the path of the upcoming war, led by its aging King, Théoden. The two towers between Mordor and Isengard, Barad-dûr and Orthanc, have united in their lust for destruction. The corrupt wizard Saruman, under the power of the Dark Lord Sauron, and his slimy assistant, Gríma Wormtongue, have created a grand Uruk-hai army bent on the destruction of Man and Middle-earth. The rebellion against Sauron is building up and will be led by Gandalf the White, who was thought to be dead after the Balrog captured him. One of the Ring's original bearers, the creature Gollum, has tracked Frodo and Sam down in search of his \"precious\", but is captured by the Hobbits and used as a way to lead them to Mt. Doom. The War of the Ring has now begun. Frodo and Sam take Gollum prisoner and continue on to Mordor on the mission to destroy The One Ring. While their former companions Aragorn, Legolas, Gimli, Merry, and Pippin make new allies in the Ents, the Riders of Rohan, and the Stewards of Gondor, and launch an assault on Isengard. All the while a growing Shadow falls upon Middle-earth as the Dark Lord's Army marches on to Gondor. The War of the Ring has begun.",
    "movie_genre": "Epic Fantasy"
},
{
    "movie_id": "tt0112178",
    "movie_title": "Star Trek: Voyager",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BYWIwMTI4NzctZmNjZi00OGU2LThhMGItZDI0ODAwOWI1NTFlXkEyXkFqcGdeQXVyNTE1NjY5Mg@@.jpg",
    "movie_storyLines": "Pulled to the far side of the galaxy, where the Federation is seventy-five years away at maximum warp speed, a Starfleet ship must cooperate with Maquis rebels to find a way home. The Federation starship USS Voyager, chasing a band of Maquis rebels, enters the dangerous space nebula known as the Badlands. Both ships are transported by a distant space probe to the Delta Quadrant, 75,000 light-years from Federation space. Voyager's crew and the Maquis form an uneasy truce to rescue crewmen of both ships, kidnapped by the probe's builder, the powerful, dying Caretaker. The Maquis ship is destroyed in a battle with the warlike Kazons. To prevent a Kazon aggression against a helpless world, Voyager destroys the space probe. Without the probe, it will take 75 years for Voyager to travel back to Federation space. With the differences between them rendered meaningless by time and distance, The Federation and Maquis crews unite aboard Voyager. Together, they embark on their new mission: to boldly go - home.",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt4975722",
    "movie_title": "Moonlight",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BNzQxNTIyODAxMV5BMl5BanBnXkFtZTgwNzQyMDA3OTE@.jpg",
    "movie_storyLines": "A young African-American man grapples with his identity and sexuality while experiencing the everyday struggles of childhood, adolescence, and burgeoning adulthood. Three time periods - young adolescence, mid-teen and young adult - in the life of black-American Chiron is presented. When a child, Chiron lives with his single, crack addict mother Paula in a crime ridden neighborhood in Miami. Chiron is a shy, withdrawn child largely due to his small size and being neglected by his mother, who is more concerned about getting her fixes and satisfying her carnal needs than taking care of him. Because of these issues, Chiron is bullied, the slurs hurled at him which he doesn't understand beyond knowing that they are meant to be hurtful. Besides his same aged Cuban-American friend Kevin, Chiron is given what little guidance he has in life from a neighborhood drug dealer named Juan, who can see that he is neglected, and Juan's caring girlfriend Teresa, whose home acts as a sanctuary away from the bullies and away from Paula's abuse. With this childhood as a foundation, Chiron may have a predetermined path in life, one that will only be magnified in terms of its problems when he reaches his difficult teen years when peer pressure affects what he and many of his peers do, unless he follows Juan's advice of truly making his own decisions for himself. Labelled as \"soft\" for the way he walks, the sensitive nine-year-old boy, Chiron, or Little, is an easy target in 1980s Miami. Running away from bullies nearly all his life, the intimidated boy finds refuge in a derelict crack-den, where Juan, the expendable drug dealer, takes him under his wing. However, in a world where everything can change at the sight of a knife or a gun, Chiron is doomed to live a predestined life, caught in a vicious cycle of antitheses. In other words, Juan is now the boy's pale paternal figure, while Paula, Chiron's neglectful mother, is Juan's best customer. But, violence begets violence, and as Little grows into an introverted sixteen-year-old teenager who struggles with his identity, only a tough facade can shield him against the world. After all these years, three periods define a vulnerable young adult Chiron who, above all, is still struggling with complex pent-up emotions. Will Little finally discover himself in his desperate journey to evolution?",
    "movie_genre": "Drama"
},
{
    "movie_id": "tt7467820",
    "movie_title": "Fantastic Beasts and Where to Find Them: Before Harry Potter",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BNWUxNDcxOGEtZTRmOS00OTY3LTk4YTUtZTE4ZjNiMzM5YjVjXkEyXkFqcGdeQXVyODA1NjQ0OTY@.jpg",
    "movie_storyLines": "A fantasy by Rowling's book takes place in the world of Harry Potter. Newt Scamander, a member of the wizarding community in New York, is trying to locate any mystery that destroys the city.",
    "movie_genre": "Fantasy"
},
{
    "movie_id": "tt7467858",
    "movie_title": "Fantastic Beasts and Where to Find Them: Newt",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BOWU1MGVjMGEtMWQ5MS00NmYxLThkMjAtOTFjMjQ4N2I1NDA1XkEyXkFqcGdeQXVyODA1NjQ0OTY@.jpg",
    "movie_storyLines": "A new take on the magical Harry Potter universe staring newt, a wizard carrying a case full of magical creatures.",
    "movie_genre": "Fantasy"
},
{
    "movie_id": "tt0492389",
    "movie_title": "Furry Vengeance",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMjM5Mzg5NjA0Nl5BMl5BanBnXkFtZTcwMjg3MDEyMw@@.jpg",
    "movie_storyLines": "In the Oregon wilderness, a real-estate developer's new housing subdivision faces a unique group of protestors: local woodland creatures who don't want their homes disturbed. Hoping to make enough money through an overseas employer to live comfortably, Real Estate Developer Dan Sanders manages to convince his son, Tyler, and wife, Tammy, to re-locate in a remote corner of Oregon. Tyler does seem content after he meets with lovely Amber, but Tammy is concerned about her husband when he near-hysterically claims that local creatures, including beavers, ravens, bears, fox, etc. have joined forces to sabotage his project. Dan Sanders is land developer whose boss treats him like dirt. He made Dan move his family to Oregon to oversee a project. His son resents him for making him move there. But when his son meets a girl named Amber, he sees a ray of sunshine but she doesn't approve of what his father is doing. When Dan does something to one of the forest animals, the animals led by a raccoon decide to get back at him. And when Dan tells everyone what's happening to him they don't believe him. But his son does some research and learns that this is not first time this has happened to someone who encroaches on their territory. But Dan decides to ignore it.",
    "movie_genre": "Adventure"
},
{
    "movie_id": "tt0762125",
    "movie_title": "Planet 51",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BYzA3NDEwMGYtZWVmNi00MDRiLWExYWItM2I1ZTQ5NDI4NTQyXkEyXkFqcGdeQXVyNTIzOTk5ODM@.jpg",
    "movie_storyLines": "An alien civilization is invaded by Astronaut Chuck Baker, who believes that the planet was uninhabited. Wanted by the military, Baker must get back to his ship before it goes into orbit without him. Lem is just an average teenager working on getting the girl and furthering his career at the local planetarium - except that he's an alien. At least to U.S. astronaut Captain Charles T. Baker who lands on Lem's planet hoping for a quick flag plant and a hasty return to earth and his millions of screaming fans. But on this alien planet the media has tagged spacemen as brain-eating, zombie-creating monsters, causing Baker to run for his life and into Lem's house. Now it's up to the green native to get the clumsy astronaut back to his spaceship before military dictator General Grawl and mad scientist Professor Kipple manage to exterminate the Earthly visitor.",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt0088247",
    "movie_title": "The Terminator",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BYTViNzMxZjEtZGEwNy00MDNiLWIzNGQtZDY2MjQ1OWViZjFmXkEyXkFqcGdeQXVyNzkwMjQ5NzM@.jpg",
    "movie_storyLines": "A human soldier is sent from 2029 to 1984 to stop an almost indestructible cyborg killing machine, sent from the same year, which has been programmed to execute a young woman whose unborn son is the key to humanity's future salvation. Sent back from a dystopian 2029--where the cold machines have conquered the entire world--to 1984 Los Angeles, the indestructible cyborg-assassin known as the \"Terminator\" commences his deadly mission to kill humankind's most important woman: the unsuspecting Sarah Connor. However, from the same war-torn post-apocalyptic future comes a battle-scarred defender--Kyle Reese, a brave soldier of the human Resistance Army--bent on stopping the cybernetic killer from eliminating the world's last hope. But, the Terminator has no feelings, he doesn't sleep, and above all, he won't stop until he carries out his grim task. Does our future lie in our past? A cyborg is sent from the future on a deadly mission. He has to kill Sarah Connor, a young woman whose life will have a great significance in years to come. Sarah has only one protector - Kyle Reese - also sent from the future. The Terminator uses his exceptional intelligence and strength to find Sarah, but is there any way to stop the seemingly indestructible cyborg ? In the future, Skynet, a computer system fights a losing war against the humans who built it and who it nearly exterminated. Just before being destroyed, Skynet sends a Terminator back in time to kill Sarah. The terminator can pass for human, is nearly indestructible, and has only one mission. One soldier is sent back to protect her from the killing machine. He must find Sarah before the Terminator can carry out it's mission. A cyborg assassin called \"The Terminator\" is sent back through time to 1984 to kill the seemingly innocent Sarah Connor--a significant woman in a bitter future war with a race of machines. If the Terminator succeeds, mankind is doomed. Sarah's only hope is a soldier from that post-apocalyptic war, who has chased the Terminator back through time. The future of the human race depends on which one finds her first.",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt11067072",
    "movie_title": "Star Wars: The Last Jedi - Movie review (Spoiler section)",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BYjk3Y2NiNDMtZWM4Zi00ODllLWE5MTAtZWZjNjRmODczYjk2XkEyXkFqcGdeQXVyODE1OTI0Mjg@.jpg",
    "movie_storyLines": "It looks like we don't have any Plot Summaries for this title yet.  Be the first to contribute! Just click the \"Edit page\" button at the bottom of the page or learn more in the  .",
    "movie_genre": ""
},
{
    "movie_id": "tt0120737",
    "movie_title": "The Lord of the Rings: The Fellowship of the Ring",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BN2EyZjM3NzUtNWUzMi00MTgxLWI0NTctMzY4M2VlOTdjZWRiXkEyXkFqcGdeQXVyNDUzOTQ5MjY@.jpg",
    "movie_storyLines": "A meek Hobbit from the Shire and eight companions set out on a journey to destroy the powerful One Ring and save Middle-earth from the Dark Lord Sauron. An ancient Ring thought lost for centuries has been found, and through a strange twist of fate has been given to a small Hobbit named Frodo. When Gandalf discovers the Ring is in fact the One Ring of the Dark Lord Sauron, Frodo must make an epic quest to the Cracks of Doom in order to destroy it. However, he does not go alone. He is joined by Gandalf, Legolas the elf, Gimli the Dwarf, Aragorn, Boromir, and his three Hobbit friends Merry, Pippin, and Samwise. Through mountains, snow, darkness, forests, rivers and plains, facing evil and danger at every corner the Fellowship of the Ring must go. Their quest to destroy the One Ring is the only hope for the end of the Dark Lords reign. The future of civilization rests in the fate of the One Ring, which has been lost for centuries. Powerful forces are unrelenting in their search for it. But fate has placed it in the hands of a young Hobbit named Frodo Baggins, who inherits the Ring and steps into legend. A daunting task lies ahead for Frodo when he becomes the Ringbearer, to destroy the One Ring in the fires of Mount Doom where it was forged. The power of Bilbo Baggins' ring of invisibility may have been underestimated, Gandalf the Grey fears its power even with his unfathomable magical abilities. As the power of the one Ring grows, so too do the armies of Sauron and Sarumon as their evil spreads across the lands of man, dwarf, and elf alike. It is up to a ragtag band of heroes to carry the ring to Mount Doom, the evil place of its birth, and cast it into the eternal fires that forged it. Does the fellowship have what it takes to complete its task, or will the powers of evil overcome those of good leaving behind a world ravaged by the rage of Sauron, the Dark Lord? In ancient times the Rings of Power were crafted by the Elven-smiths, and Sauron, the Dark Lord, forged the One Ring, filling it with his own power so that he could rule all others. But the One Ring was taken from him, and though he sought it throughout Middle-earth, still it remained lost to him. After many ages it fell, by chance, into the hands of the Hobbit, Bilbo Baggins. On his eleventy-first birthday, Bilbo disappeared, bequeathing to his young nephew, Frodo, the Ruling Ring, and a perilous quest: to journey across Middle-earth, deep into the shadow of the Dark Lord and destroy the Ring by casting it into the Cracks of Doom. In ancient times, the Elven-smiths created the Rings of Power. Then the Dark Lord Sauron created a Ring to rule the Lesser Rings. But the Ring was stolen, and for a long time, he thought it to be lost. But many years later, the Ring came to the hobbit, Bilbo Baggins. In a land called the Shire, Frodo inherits the Ring from his uncle, Bilbo. Now Frodo must take a journey across Middle-earth, and throw the Ring into the volcano, Mt. Doom, the only place it can be destroyed.",
    "movie_genre": "Fantasy"
},
{
    "movie_id": "tt20723374",
    "movie_title": "Tales of the Jedi",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BODMwYmE1ZGItYWVjNi00ZWUxLWFjYjQtNjdjN2MzNzY0NmRlXkEyXkFqcGdeQXVyMTUzMTg2ODkz.jpg",
    "movie_storyLines": "It showcases animated shorts that feature Jedi from the prequel era.",
    "movie_genre": "Animation"
},
{
    "movie_id": "tt12708542",
    "movie_title": "Star Wars: The Bad Batch",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BNDA5YzQzYmItZTE4NC00NTNkLTljZGItNDQ0YjI3MzdhZjlhXkEyXkFqcGdeQXVyMTEyMjM2NDc2.jpg",
    "movie_storyLines": "The 'Bad Batch' of elite and experimental clones make their way through an ever-changing galaxy in the immediate aftermath of the Clone Wars. The clone special unit called \"The Bad Batch\" consists of clones with helpful side effects, such as super strength, make their way through the newly founded empire and trying to find out why all clone troops, except themselves, opposed their jedi generals. The Clone Wars are over; now The Galactic Empire has taken over The Republic. But from the embers of The Clone Wars is The Bad Batch: a ragtag group of 'defective' clones whose skills are off-the-charts for any breed of soldier. In order to stand up to The Empire, The Bad Batch must get up to speed with the rest of the Galaxy, or die with the past.",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt0118480",
    "movie_title": "Stargate SG-1",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTc3MjEwMTc5N15BMl5BanBnXkFtZTcwNzQ2NjQ4NA@@.jpg",
    "movie_storyLines": "A secret military team, SG-1, is formed to explore other planets through the recently discovered Stargates. General Hammond summons Colonel Jack O'Neill out of retirement to embark on a secret rescue mission. O'Neill confesses that he disobeyed orders to destroy the Stargate on Planet Abydos, and that scientist Daniel Jackson may still be alive. Arriving on Abydos with his team, O'Neill meets up once again with the scientist, who has discovered a giant elaborate cartouche in hieroglyphics. All signs point to the fact that this is a map of many Stargates that exist throughout the galaxy - a development that makes the dream of the SG-1 team to travel throughout the universe in time a reality.",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt5171438",
    "movie_title": "Star Trek: Discovery",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BNjg1NTc2MDktZTU5Ni00OTZiLWIyNjQtN2FhNGY4MzAxNmZkXkEyXkFqcGdeQXVyMTkxNjUyNQ@@.jpg",
    "movie_storyLines": "Ten years before Kirk, Spock, and the Enterprise, the USS Discovery discovers new worlds and lifeforms as one Starfleet officer learns to understand all things alien.",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt8806524",
    "movie_title": "Star Trek: Picard",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMzY3MTcyNTktZGY0Yy00MmNhLTllYjQtMWFkNGM1YzNiOWRkXkEyXkFqcGdeQXVyODk4OTc3MTY@.jpg",
    "movie_storyLines": "Follow-up series to   and   that centers on Jean-Luc Picard in the next chapter of his life. At the end of the 24th Century, and 14 years after his retirement from Starfleet, Jean-Luc Picard is living a quiet life on his vineyard, Chateau Picard. When he is sought out by a mysterious young woman, Dahj, in need of his help, he soon realizes she may have personal connections to his own past. Shortly after the Destruction of Romulus,Starfleet reneged on a prior commitment to help the evacuation of Romulus. Culminating With a battalion of \"Rogue\" Starfleet Synthetics attacking The Mars Colonies (Short Trek: children of mars) This set forth a series of unprecedented events which leads to a Galactic Conspiracy. After ten years into his retirement, Jean Luc Picard has a stranger ask for his help. Which unearths unnerving questions that no one will answer. So now it is up to Picard to rise up and face those challenges head on. Many years after STNG, Jean-Luc Picard has retired to his vineyard on Earth. Haunted by past events, they increasingly invade his dreams. When a stranger visits, his life is suddenly turned upside down when he learns the impossible may have occurred.",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt1895587",
    "movie_title": "Spotlight",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMjIyOTM5OTIzNV5BMl5BanBnXkFtZTgwMDkzODE2NjE@.jpg",
    "movie_storyLines": "The true story of how the Boston Globe uncovered the massive scandal of child molestation and cover-up within the local Catholic Archdiocese, shaking the entire Catholic Church to its core. When the Boston Globe's tenacious \"Spotlight\" team of reporters delves into allegations of abuse in the Catholic Church, their year-long investigation uncovers a decades-long cover-up at the highest levels of Boston's religious, legal, and government establishment, touching off a wave of revelations around the world. In existence since the 1970s, Spotlight is the investigative reporting unit of the Boston Globe. They can spend months or years on a single story, which they choose amongst themselves. As such, they are somewhat autonomous from the rest of the newspaper, only needing to report to their superior. As a rule, they are not to discuss their work with anyone else, whether it be other staff, friends and or family. In 2001, the four person team consisted of its editor   - Robby to his friends - and his team of three investigative journalists,  ,   and Matt Carroll. Robby reports to the assistant managing editor,  . Upon his arrival from his most recent position in Florida, Marty Baron, the newly appointed editor-in-chief. Mr. Baron requests Spotlight to place their current project on hold and dig deeper into a recent story written by fellow Globe reporter and columnist Eileen McNamara, regarding allegations against a Catholic priest of sexual abuse of a minor and what appears to be the subsequent cover-up by the head of the Archdiocese of Boston, Cardinal Bernard Law. They are at first hesitant to work on the story, seeing Baron as an outsider to Boston, he who doesn't understand what is important to locals. Baron's outsider status includes not being born and raised there, and not being Catholic (he being the Globe's first Jewish editor-in-chief). Spotlights first task is to see if they can get some court documents on the case unsealed, which means they will need a court order. The Church and its parishioners could falsely interpret this as The Globe suing the Catholic church. This could have major, negative consequences for The Globe due to the fact that a majority of their subscribers are Catholic. Robby and his team begin by speaking to lawyers who have or are working on alleged sexual abuse cases perpetrated by Catholic priests in and immediately surrounding Boston (those lawyers said including Eric MacLeish and  ), known victims (such as  , the head of the Survivors Network of those Abused by Priests (SNAP)) and insiders in the Catholic church. Through this investigation, they get wind that the problem is not contained to a couple of priests and few victims, in essence changing the focus from the priest(s) to the systemic problem of the Archdiocese not only covering up the abuse but in reality doing nothing to stop it and thus condoning it. Their goal is not only the end product of an important story, but making sure that the other major local newspapers, such as the Boston Herald, do not beat them ",
    "movie_genre": "Drama"
},
{
    "movie_id": "tt0410519",
    "movie_title": "The Matrix Recalibrated",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BODE1NWM0NmYtMmM1Ny00OTg3LWE3YWUtOTJhMzVkNWEzOGI0XkEyXkFqcGdeQXVyODA1NjQ0OTY@.jpg",
    "movie_storyLines": "The making of Matrix Revolutions, The (2003) is briefly touched on here in this documentary. Interviews with various cast and crew members inform us how they were affected by the deaths of Gloria Foster and Aaliyah, and also delve into the making of the visual effects that takes up a lot of screen time.",
    "movie_genre": "Documentary"
},
{
    "movie_id": "tt8706598",
    "movie_title": "The Hitman's Bodyguard: The Hitman vs. The Bodyguard",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BYWUwNjA0Y2UtYWM4Zi00ZWE5LTkyYzUtYzZlOGQxOTViZGEwXkEyXkFqcGdeQXVyMTY1MTcxMzc@.jpg",
    "movie_storyLines": "Ryan Reynolds and Samuel L. Jackson star as an elite bodyguard and renowned hit man who is forced to work together. In order to succeed, they don't just have to avoid getting killed, they have to avoid killing each other.",
    "movie_genre": "Action-Comedy"
},
{
    "movie_id": "tt0467110",
    "movie_title": "Underdog",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTk5NjkyNzEwOV5BMl5BanBnXkFtZTcwODc5NDI1MQ@@.jpg",
    "movie_storyLines": "A Beagle must use his newly-bestowed superpowers to defend Capitol City from mad scientist Simon Barsinister. A bomb-sniffing beagle is fired from the mayor's office for a faux pas. That night a mad scientist dognaps him and injects him with an elixir. The dog escapes, but now has superpowers. He's adopted by a security guard - an ex-cop, who's a widower with a moody teen son, Jack. The boy discovers that the dog, named Shoeshine by dad, has super powers, but it's their little secret. While Underdog saves people in distress, the mad scientist and his underling continue their plot to catch him and take over the city. There's also a girl Jack likes who has a dog that Shoeshine takes a shine to. Will every dog have his day? The story begins with a normal, bumbling everyday watchdog beagle named Shoeshine who gets exposed to a substance that gives him the powers of a superhero. And not to mention the ability the speak during an accident. He is adopted by a security guard - an ex-cop, who's a widower with a 12-year-old moody son, Jack Unger. Shoeshine uses his superpower to protect his love and the citizens of Capitol City from the evil Simon Barsinister. Underdog dedicates himself to good, quickly becoming revered as a superhero, but ultimately it will take the combined efforts and understanding of Underdog, Jack, Dan, Molly, and Polly to defeat Barsinister and save Capital City from destruction. A bomb-sniffing dog is fired from the police force for a high profile mistake. That night Cad (Patrick Warburton) dognaps him, Cad works as a henchman for Simon Barsinister (Peter Dinklage) a mad scientist, who injects him with an elixir. The dog escapes, but now has superpowers. He's adopted by Dan Unger (James Belushi) a security guard - an ex-cop, who's a widower with a moody teen son, Jack. While Barsinister and Cad plot to catch him and take over the city.",
    "movie_genre": "Adventure"
},
{
    "movie_id": "tt0327084",
    "movie_title": "Over the Hedge",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTQwMTQxNTcwOF5BMl5BanBnXkFtZTcwMzQ1NzUzMQ@@.jpg",
    "movie_storyLines": "A scheming raccoon fools a mismatched family of forest creatures into helping him repay a debt of food, by invading the new suburban sprawl that popped up while they were hibernating...and learns a lesson about family himself. RJ, a raccoon who needs food, accidentally takes food from a hungry bear named Vincent and he wants his food to be found in exactly the same place in a week. He finally finds that an animal family, with a tortoise named Verne as their leader, could help him restore the food from the suburbia, the gateway to the good life. But little does RJ know, there is a woman who has recently hired an exterminator to try to hunt them down. Traveling raccoon con artist, RJ, arrives in a woods outside a human city in the Midwest, excited about the wonders that living near humans can bring hungry animals. What he finds, however, is an Amish-like community that is deathly afraid of humans, after their leader, Vern the tortoise (Shandling), has an encounter with human boys that terrifies him. Encouraged by RJ, however, the animals slowly venture over the hedge that separates them from the brand new suburban development that appeared over the winter while they were sleeping, and what RJ shows them is a whole new world where humans leave tin cans full of fish and other food in big canisters, ripe for the taking. As they get closer and closer to humans, however, their comfortable lives in the woods appears to be threatened... Upon waking up after hibernation, a group of forest animals discover that a tall hedge has appeared out of nowhere, half their forest is gone, they have little to no food left. While Verne, a nervous turtle who acts as leader, suggests they simply adapt, RJ the raccoon shows up and gives them another option: go over the hedge and get food from the humans! The other forest animals quickly give into RJ, sneaking into the human world to get all the food they can grab. What they don't know is that RJ is actually in debt to a hungry bear, who has given him one week to replenish his food supply, or RJ takes its place! RJ is a raccoon, specialist on finding and stealing food, as every raccoon in the world. During a night, RJ tries to steal all the food reserves of Vincent, a big bear, but the raccoon's ambition makes that all the food loot get lost. Vincent warns RJ that he'll should put back all his food when full moon comes, otherwise he will regret having stolen the food. Meanwhile, a group of animals headed by a cautious turtle, Verne, is worried because spring has come and there's not enough food for everyone. Verne tells that they will be fine eating plants and some bark. Later, they find that their wood has a frontier, formed by a giant bush. They're scared of crossing to the other side, where the suburbs exist. But RJ comes to the scene, telling that there's no danger in the suburbs, and that they will find all the food they want there. Nevertheless, Verne distrusts RJ, because he thinks that there's something suspicious about him, trying to convince the group that natur",
    "movie_genre": "Animation, Comedy"
},
{
    "movie_id": "tt0095016",
    "movie_title": "Die Hard",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BZjRlNDUxZjAtOGQ4OC00OTNlLTgxNmQtYTBmMDgwZmNmNjkxXkEyXkFqcGdeQXVyNzkwMjQ5NzM@.jpg",
    "movie_storyLines": "A New York City police officer tries to save his estranged wife and several others taken hostage by terrorists during a Christmas party at the Nakatomi Plaza in Los Angeles. NYPD cop John McClane goes on a Christmas vacation to visit his wife Holly in Los Angeles where she works for the Nakatomi Corporation. While they are at the Nakatomi headquarters for a Christmas party, a group of robbers led by Hans Gruber take control of the building and hold everyone hostage, with the exception of John, while they plan to perform a lucrative heist. Unable to escape and with no immediate police response, John is forced to take matters into his own hands. New York City policeman John McClane (Bruce Willis) is visiting his estranged wife (Bonnie Bedelia) and his daughter and son Christmas Eve. He joins her at a holiday party in the headquarters of the Japanese-owned business she works for. But the festivities are interrupted by a group of terrorists who take over the exclusive high-rise, and everyone in it. Very soon McClane realizes that there's no one to save the hostages -- but him. John McClain, a new York City cop flys to LA to visit his wife at a Christmas party. But when twelve terrorist attack the building at the same night, McCain is the only hope of saving everybody. With nothing but a handgun and his wits he is forced to take on Hans Gruber and his fellow terrorists. Tough New York cop John McClane finds himself in a tight situation when an office building in Los Angeles is taken over by terrorists. Apart from himself, everyone else in the building - including his wife - is held at gunpoint while their captors spell out their demands. The F.B.I. are called in to survey the situation, but John McClane has other plans for the terrorists... New York cop John McClane flies to Los Angeles on Christmas eve to spend the holidays with his family. He arrives at the Nakatomi corp. building for his wife's office party. International terrorists take over the building and hold every one as hostage to steal $600 million of bonds from the vaults of the building. Now its up to McCLane to face the terrorists and save his wife and the other hostages. In the city of Los Angeles, a Christmas party is held on the 30th floor of the Nakatomi Plaza Hotel. While the party is going on, downstairs, a band of German terrorists arrive and take the entire building hostage including its employees and attempt a huge robbery. But the only one who eludes capture is New York City Cop John McClane who launches a one man war in an attempt to stop the terrorists and save all hostages including his wife Holly. John McClane is a cop from New York City who is on his way to Los Angeles to see his kids and his wife Holly, who moved to LA because of a job at the Nakatomi Corporation. When he arrives at Nakatomi Plaza, he meets Holly's boss Joe Takagi and her co-worker Harry Ellis. He and Holly go into a private bathroom and get into an argument. When Holly leaves to give a speech, thirteen armed terrorists lead by Hans Gruber seize control ",
    "movie_genre": "Action"
},
{
    "movie_id": "tt0093773",
    "movie_title": "Predator",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BY2QwYmFmZTEtNzY2Mi00ZWMyLWEwY2YtMGIyNGZjMWExOWEyXkEyXkFqcGdeQXVyNjUwNzk3NDc@.jpg",
    "movie_storyLines": "A team of commandos on a mission in a Central American jungle find themselves hunted by an extraterrestrial warrior. A team of special force ops, led by a tough but fair soldier, Major \"Dutch\" Schaefer, are ordered to assist CIA man, Colonel Al Dillon, on a rescue mission for potential survivors of a Helicopter downed over remote South American jungle. Not long after they land, Dutch and his team discover that they have been sent in under false pretenses. This deception turns out to be the least of their worries though, when they find themselves being methodically hunted by something not of this world. Assigned to locate a Central American cabinet minister and eliminate the region's scattered guerrillas, battle-hardened Major Alan \"Dutch\" Schaefer leads his hand-picked squad of elite commandos into the jungle. However, they are unaware that an unidentified interstellar spacecraft has landed near them. Now, an otherwise routine rescue mission turns into a bloodbath, as ritualistically mutilated bodies found at the scene give away only one thing: someone, or perhaps something, is hunting them for sport. When Dutch attempts to confront the extraterrestrial tracker with his combat experience, he discovers their primitive weapons are no match for the creature's state-of-the-art weaponry. Does the outgunned and outmatched squad stand a chance against the ultimate hunter, the Predator? Dutch and his group of commandos are assigned to rescue downed airmen from guerillas in a Central American jungle. The mission goes well but as they return they find that something is hunting them. Nearly invisible, it blends in with the forest, taking trophies from the bodies of its victims as it goes along. Occasionally seeing through its eyes, the audience sees it is an intelligent alien hunter, hunting them for sport, killing them off one at a time. Dutch and a team of commandos have been sent into a Central American jungle to track down some missing airmen that were kidnapped by terrorists. By the time they get to the camp, the airmen have been butchered in a very violent fashion and the commandos retaliate on the terrorists' camp. After that's over, they wait for a helicopter to pick them up, but something strange begins to happen in the woods. It isn't long before the commandos start getting killed off and Dutch and a girl from the camp, Anna, are the only people left and fighting for their lives. But what they discover is too shocking for them to imagine. What's been killing them is the Predator, an alien that hunts rare species and make his trophies out of their skulls. And human beings are the new species he has discovered.",
    "movie_genre": "Action-Adventure"
},
{
    "movie_id": "tt0137523",
    "movie_title": "Fight Club",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BNDIzNDU0YzEtYzE5Ni00ZjlkLTk5ZjgtNjM3NWE4YzA3Nzk3XkEyXkFqcGdeQXVyMjUzOTY1NTc@.jpg",
    "movie_storyLines": "An insomniac office worker and a devil-may-care soap maker form an underground fight club that evolves into much more. A nameless first person narrator ( ) attends support groups in attempt to subdue his emotional state and relieve his insomniac state. When he meets Marla ( ), another fake attendee of support groups, his life seems to become a little more bearable. However when he associates himself with Tyler ( ) he is dragged into an underground fight club and soap making scheme. Together the two men spiral out of control and engage in competitive rivalry for love and power. A young man leads a pretty humdrum life assessing car crashes to determine if his automobile company should issue recalls to fix problems. He also suffers from insomnia and takes to attending group therapy sessions for people who have survived various diseases. There he meets Marla who like him attends these sessions though she is neither a victim nor a survivor. His life changes when he meets Tyler Durden on a flight home. Tyler seems to be everything that he's not and together they create a men-only group for bare-knuckle fighting. It soon becomes all the rage with fight clubs springing up across the country and the group itself becoming an anti-capitalist domestic terrorist organization. Tyler and Marla develop a relationship leaving him often on the outside of what is going on. He soon finds that the group is out of control and after a major self-revelation decides there is only one way out. An insomniac unnamed narrator needs a fantasy to escape from his deadly boring life, he tries joining a cancer support group however the only thing they do in the group is cry into each others chest, but then he is on a plane on his way back from what a viewer would assume is a business trip our unnamed narrator encounters Tyler Durden, a soap selling bad-ass who happens to run a secret fight club in the diner parking lot with his friend who follows 8 simple rules set out by Tyler, our unnamed narrator of course is taken into this scheme ran by Tyler. Posing as a pitiful sufferer during fruitless late-night sessions in highly addictive support groups for terminal illnesses, an unhappy insomniac struggles to find meaning in his mundane and dysfunctional existence. Then, a fateful encounter with the anarchist philosopher and travelling soap salesman, Tyler Durden, changes his life, as--for the first time in a long while--the bored white-collar worker reconnects with his inner self. Much to his surprise, the formerly depressed loner finds himself deriving pleasure out of pain through bare-knuckle brawls in the Fight Club: an underground society of men who yearn to free themselves from the fetters of a cruel modern life. Now, he is ready to wage war. Are violence and freedom the two sides of the same coin? Sick of his dead-end corporate career and disgusted with the empty consumer culture, a young man (Norton) and his devious friend (Pitt) create a new club where young men come to relieve their frustrations by beating each other to a p",
    "movie_genre": "Drama"
},
{
    "movie_id": "tt2310332",
    "movie_title": "The Hobbit: The Battle of the Five Armies",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTYzNDE3OTQ3MF5BMl5BanBnXkFtZTgwODczMTg4MjE@.jpg",
    "movie_storyLines": "Bilbo and company are forced to engage in a war against an array of combatants and keep the Lonely Mountain from falling into the hands of a rising darkness. After the Dragon leaves the Lonely Mountain, the people of Lake-town see a threat coming. Orcs, dwarves, elves and people prepare for war. Bilbo sees Thorin going mad and tries to help. Meanwhile, Gandalf is rescued from the Necromancer's prison and his rescuers realize who the Necromancer is. Bilbo and the Company of King Thorin Oakenshield are forced into war by the Orcs of Gundabad and Moria lead by Azog and Bolg and chief leader Sauron. Its a remarkable battle with the Dwarves of Erebor and the Iron Hills, The Elves of the Woodland Realm, The people of Laketown, The eagles lead by Radagast and Beorn and the Orcs of Gundabad and Moria. How will this battle end? As Smaug breathes fire and destruction onto Laketown, another sort of dragon-danger threatens Thorin Oakenshield - the gold madness that seized his Grandsire Thror, King Under the Mountain of old. The people of Laketown flee to the ruins of Dale, in the shadow of the Lonely Mountain, only to be greeted by an army of Elves led by Thranduil, marching there too. Asking Thorin for their own fair share of the gold, Men and Elves are answered by Dwarvish defiance. Thorin seems overmatched until an army led by Dwarf-Lord Dain, Thorin's kinsman, approaches from the Iron Hills to the northeast. Meantime, Gandalf, imprisoned in the ruins of Dol Guldûr, seems about to be finished off by the Nine Ring Wraiths, led by the deadliest of their lot, Witch King of the ancient, evil realm of Angmar. And what on Middle Earth will happen when an enormous army of Orcs and Wargs suddenly pours out of tunnels under the earth, surrounding and threatening doom to all the other armies gathered at the Lonely Mountain? Orcs and their Fell Beasts, Elves, Dwarves, Men - Five Armies join battle, and the result will determine the fate of the North in the gathering War of the Ring. After seizing Erebor from Smaug, Smaug burns down Lake-town and the aftermath causes the people of Lake-town to take up refuge in the ruins of Dale which is in the shadow of Erebor. Gandalf is inprisoned by The Necromancer and is eventually rescued and The Necromancer reveals himself as Sauron. Bilbo and Company must protect Erebor from the Elves of Mirkwood, the Gundabad and Moria Orcs, the Men of Lake-town. Atop the reclaimed Lonely Mountain, Bilbo Baggins and the fellowship of Dwarves witness the mighty winged drake, Smaug, swooping down upon Laketown in a fit of fiery rage, as refugee denizens and Elves converge on Erebor to claim the realm's inestimable treasure. However, as Prince Thorin II Oakenshield rapidly succumbs to the hypnotic allure of the corrupting mounds of gold, friendships shatter over greed, and a war is brewing. And just as all races prepare for battle, dark lord Sauron's evil forces led by the Orc chieftain, Azog, emerge from the dark bowels of the earth, flanking the vast battlefield, in Middle-earth's greatest c",
    "movie_genre": "Fantasy"
},
{
    "movie_id": "tt0796264",
    "movie_title": "Eureka",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTkyMDQ0NDY1M15BMl5BanBnXkFtZTcwOTU1Njk3MQ@@.jpg",
    "movie_storyLines": "A U.S. Marshal becomes the sheriff of Eureka, a remote, cozy little Northwestern town where the best minds in the US have secretly been tucked away to build futuristic inventions for the government which often go disastrously wrong. With help from Albert Einstein and other trusted advisors, President Harry S. Truman commissioned a top-secret residential development in a remote area of the Pacific Northwest, one that would serve to protect and nurture America's most valuable intellectual resources, where our nation's greatest thinkers, the über-geniuses working on the next era of scientific achievement, would be able to live and work in a supportive environment. The best architects and planners were commissioned to design a welcoming place for these superlative geniuses to reside, an area that would offer the best education for their children, the best healthcare, the best amenities and quality of life. A community was created to rival the most idyllic of America's small towns, with one major difference: this town would never appear on any maps. At least, none that haven't been classified \"eyes only\" by the Pentagon.",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt5691552",
    "movie_title": "The Orville",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMzBkZGM1OTQtYmIyNi00ZjM4LWJlNGItNGM0ZWVhODU3YWVlXkEyXkFqcGdeQXVyNzY3NzAzOTA@.jpg",
    "movie_storyLines": "Set 400 years in the future, finds the crew of the U.S.S. Orville continuing their mission of exploration, as they navigate both the mysteries of the universe and the complexities of their own interpersonal relationships. Set 400 years in the future, the show follows the adventures of the Orville, a not-so-top-of-the-line exploratory ship in Earth's interstellar Fleet. Facing cosmic challenges from without and within, this motley crew of space explorers will boldly go where no comedic drama has gone before.",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt1950186",
    "movie_title": "Ford v Ferrari",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BM2UwMDVmMDItM2I2Yi00NGZmLTk4ZTUtY2JjNTQ3OGQ5ZjM2XkEyXkFqcGdeQXVyMTA1OTYzOTUx.jpg",
    "movie_storyLines": "American car designer   and driver   battle corporate interference and the laws of physics to build a revolutionary race car for Ford in order to defeat Ferrari at the 24 Hours of Le Mans in 1966. As  's fast Rosso-Corsa racing cars dominate the mid-1960s motorsport world, the American car designer,  , is forced to retire after winning the demanding 1959 '24 Hours of Le Mans' endurance race. But, before long, an unexpected proposition by the Vice President of  's motor company,  , will offer an opportunity to beat the Italians at their own game. Now, under those pressing circumstances, the British sports car driver and racing engineer,  , reluctantly agrees to lend a hand and improve the firm's image, as Ford's race team has less than ninety days to rewrite history. As a result, the non-conformist duo comes up with the mighty Ford GT40 Mk I high-performance racing car. Can Shelby and Miles break Ferrari's streak? American automotive designer   and British race car driver   compete in a fierce corporate battle as well as nature itself, to build a vehicle for the Ford automobiles. Together, they plan to compete against the race cars of   at the 24 Hours of Le Mans in France in 1966. Ford Company has a big problem in selling its cars in the 1960s. They decide to take part in 24 Hours of Le Mans endurance race to show and advertise their cars. Ferrari's fast racing cars dominate the mid-60s racing world. Ford's advertisement team request Carrol Shelby to build fast cars for the race. Shelby asks British driver and racing engineer, Ken Miles to be the main driver for Ford's company in the race.",
    "movie_genre": "Drama"
},
{
    "movie_id": "tt3228088",
    "movie_title": "Spark: A Space Tail",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTcwNzc2Mzk2M15BMl5BanBnXkFtZTgwNzU2MzA2MTI@.jpg",
    "movie_storyLines": "Spark, a teenage monkey and his friends, Chunk and Vix, are on a mission to regain Planet Bana, a kingdom overtaken by the evil overlord Zhong. Thirteen years ago, the power-mad General Zhong seized control of Planet Bana and tore it to pieces in the process. Now splintered into hundreds of shards, Zhong is Bana's evil-overlord, ruling with an iron fist. Enter Spark, a teenage monkey and his friends, Vix, a battle-ready fox, and Chunk, a tech-savvy pig. Spark learns of Zhong's secret plan to take over the universe by capturing a giant space monster known as the Kraken, a beast that has the power to create black holes. If Zhong manages to harness the Kraken's power, he'll have history's deadliest weapon at his fingertips, and it's up to Spark and his friends to stop him. Spark's journey takes him to the farthest reaches of the universe, where he encounters great dangers and discovers the secret of his true identity. An action-packed space adventure full of humor and heart, this movie is the story of a boy who takes on great responsibility and in the process discovers his rightful place in the universe. Spark is a wisecracking teen living on an abandoned planet with his friends Chunk and Vix. Thirteen years ago, the power-hungry General Zhong seized control of their planet Beta, wiping out Spark's family and sending him into hiding. But now they've learned of Zhong's plan to wipe out the entire universe using the deadly space Kraken, and no one but Spark can stop him.",
    "movie_genre": "Adventure"
},
{
    "movie_id": "tt1436562",
    "movie_title": "Rio",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTU2MDY3MzAzMl5BMl5BanBnXkFtZTcwMTg0NjM5NA@@.jpg",
    "movie_storyLines": "When Blu, a domesticated macaw from small-town Minnesota, meets the fiercely independent Jewel, he takes off on an adventure to Rio de Janeiro with the bird of his dreams. In Rio de Janeiro, baby macaw, Blu, is captured by dealers and smuggled to the USA. While driving through Moose Lake, Minnesota, the truck that is transporting Blu accidentally drops Blu's box on the road. A girl, Linda, finds the bird and raises him with love. Fifteen years later, Blu is a domesticated and intelligent bird that does not fly and lives a comfortable life with bookshop owner Linda. Out of the blue, clumsy Brazilian ornithologist, Tulio, visits Linda and explains that Blu is the last male of his species, and he has a female called Jewel in Rio de Janeiro. He invites Linda to bring Blu to Rio so that he and Jewel can save their species. Linda travels with Blu and Tulio to Rio de Janeiro and they leave Blu and Jewel in a large cage in the institute where Tulio works. While they are having dinner, smugglers break into the institute and steal Blu and Jewel to sell them. Linda and Tulio look everywhere for Blu, who is chained to Jewel and hidden in a slum. Meanwhile, Jewel and Blu escape from their captors and befriend a group of birds that help them to get rid of the chains. It is Carnival and the smugglers and mean cockatoo, Nigel, do not intend to give up Blu and Jewel, and chase the birds through the crowded streets. When Blu, a baby blue macaw that lives in Brazil, was captured by dealers and was smuggled to USA, a little girl named Linda decided to take care of him and it continues until they were adults. Unfortunately, because Blu was with Linda since he was little, he never learned to fly. And when an ornithologist named Tulio finds Blu and tells Linda that he is the last male of his kind, Tulio decided to bring Blu back to Brazil to breed with a female macaw named Jewel. But in the night Blu was captured again along with Jewel and must find his way back to Linda while trying to overcome his fear to learn how to fly with Jewel and a toucan, Rafael. By a tragic twist of fate, the bright-coloured blue macaw parrot, Blu, never had the chance to learn how to fly. Far away from sunny Brazil, Blu now lives in snow-covered Minnesota as the pet-friend of his human companion, Linda; however, as the last of his endangered species, the flightless bird will soon find himself in Rio de Janeiro to meet the last female of his kind--the feisty, Jewel. But, when calamity strikes again, and the feathery couple gets kidnapped, Blu must summon up the courage to finally believe in himself, if he wants to save his charming dream-girl. The question is, can he make it in time?",
    "movie_genre": "Animation/Adventure"
},
{
    "movie_id": "tt1606378",
    "movie_title": "A Good Day to Die Hard",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTcwNzgyNzUzOV5BMl5BanBnXkFtZTcwMzAwOTA5OA@@.jpg",
    "movie_storyLines": "John McClane travels to Russia to help out his seemingly wayward son, Jack, only to discover that Jack is a CIA operative working undercover, causing the father and son to team up against underworld forces. Iconoclastic, take-no-prisoners cop John McClane, for the first time, finds himself on foreign soil after traveling to Moscow to help his wayward son Jack - unaware that Jack is really a highly-trained CIA operative out to stop a nuclear weapons heist. With the Russian underworld in pursuit, and battling a countdown to war, the two McClanes discover that their opposing methods make them unstoppable heroes. John McClane learns that his son Jack, whom he hasn't spoken to in years, is in Russia and was arrested for killing someone. When the Russian prosecutor talks to Jack he claims to have information that could help convict a man named Komarov who is going to be tried. McClane arrives and proceeds to the Russian courthouse where Komarov's going to be tried. When he arrives there's an explosion that levels the courthouse. Jack takes Komarov and they escape, McClane shows up and Jack is not happy to see him. The men who bomb the courthouse chase Jack. McClane follows and helps Jack. Jack then picks him up then they go somewhere, where McClane discovers that Jack is a spy and he was suppose to get Komarov because it seems he has evidence against a corrupt Russian official who was behind the bombing. When he agrees to give them the evidence in exchange for his freedom and daughter's, the men find them. So McClane and Jack have to get the evidence and get out of Russia. When they go to meet the man's daughter, McClane senses something is not right. New York City cop John McClane arrives in Moscow to track down his estranged son, Jack. McClane thinks his son is a criminal, so it comes as a shock when he learns that Jack is actually working undercover to protect Komarov, a Russian government whistleblower. With their own lives on the line, McClane and Jack must overcome their differences in order to get Komarov to safety and thwart a potentially disastrous crime in the Chernobyl region. In Moscow, Viktor Chagarin, a high-ranking, but corrupt, Russian official plans to incriminate former billionaire and government whistle-blower Yuri Komarov in an imminent rigged trial unless Komarov hands over a secret file believed to contain evidence incriminating Chagarin. Separately, Jack McClane, who has been arrested after an assassination attempt, negotiates for a shorter sentence by offering to testify against Komarov. Meanwhile, Jack's father, NYPD Detective John McClane, who has not been in touch with his son for several years, has learned his son is in trouble and, taken to the airport by his daughter Lucy McClane, flies to Russia to help. As John arrives and approaches the courthouse where Komarov is on trial, a bomb explosion, orchestrated by Chagarin's henchman Alik, occurs in the courthouse and Jack breaks free with Komarov. Seeing his son, John confronts him, but their dispute is cut short as Alik and",
    "movie_genre": "Action"
},
{
    "movie_id": "tt1130884",
    "movie_title": "Shutter Island",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BYzhiNDkyNzktNTZmYS00ZTBkLTk2MDAtM2U0YjU1MzgxZjgzXkEyXkFqcGdeQXVyMTMxODk2OTU@.jpg",
    "movie_storyLines": "In 1954, a U.S. Marshal investigates the disappearance of a murderer who escaped from a hospital for the criminally insane. In 1954, up-and-coming U.S. marshal Teddy Daniels is assigned to investigate the disappearance of a patient from Boston's Shutter Island Ashecliffe Hospital. He's been pushing for an assignment on the island for personal reasons, but before long he thinks he's been brought there as part of a twisted plot by hospital doctors whose radical treatments range from unethical to illegal to downright sinister. Teddy's shrewd investigating skills soon provide a promising lead, but the hospital refuses him access to records he suspects would break the case wide open. As a hurricane cuts off communication with the mainland, more dangerous criminals \"escape\" in the confusion, and the puzzling, improbable clues multiply, Teddy begins to doubt everything - his memory, his partner, even his own sanity. Federal Marshall Teddy Daniels and his new partner Chuck Aule travel to a government-run institution for the criminally insane on Shutter Island, near Boston, when there is a report that a prisoner has gone missing. Daniels, weighed down with his own baggage, has his own reasons for wanting to get to the island. He is still traumatized from what he saw when his army unit liberated one of the Nazi concentration camps at the end of World War II, and still haunted by his wife's more-recent death in a fire. The head of the hospital, Dr. John Cawley, treats him decently, but others give the agents a cooler reception. Daniels particularly wants to find out what goes on in the ward that's reserved for the most serious offenders. As he begins to peel away the layers of deceit, it becomes obvious that not all is as it seems. Assigned the thorny task of investigating the incomprehensible disappearance of a deranged child-murderess, troubled U.S. Marshal Teddy Daniels and his new partner, Chuck Aule, travel to Ashecliffe Hospital: Shutter Island's impregnable asylum for the criminally insane. Soon, within the dark purgatory's thick stone walls, indescribable nuances of medical malpractice suggest that the institution's cryptic senior psychiatrists must be hiding something. Then, a raging tempest traps patients and investigators alike in the dark off-shore prison, triggering Teddy's crippling migraines and gruesome flashbacks of a haunting past. Is the already perplexed detective losing his grip on reality? In 1954, Federal Marshal Teddy Daniels and his new partner Chuck Aule travel from Seattle to Shutter Island to investigate the disappearance of a patient there, Rachel Solando. She had been sectioned at the institution for dangerous criminals at Ashcliffe Hospital because she drowned her three kids. Teddy is a veteran WWII soldier, traumatized by the war experience in the liberation of the Dachau concentration camp and the loss of his beloved wife in a criminal fire. Teddy is unable to access the records of employees and patients and feels that the management by the Federal facility are obstructing ",
    "movie_genre": "Psychological Thriller"
},
{
    "movie_id": "tt1853728",
    "movie_title": "Django Unchained",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMjIyNTQ5NjQ1OV5BMl5BanBnXkFtZTcwODg1MDU4OA@@.jpg",
    "movie_storyLines": "With the help of a German bounty-hunter, a freed slave sets out to rescue his wife from a brutal plantation-owner in Mississippi. In 1858, a bounty-hunter named King Schultz seeks out a slave named Django and buys him because he needs him to find some men he is looking for. After finding them, Django wants to find his wife, Broomhilda, who along with him were sold separately by his former owner for trying to escape. Schultz offers to help him if he chooses to stay with him and be his partner. Eventually they learn that she was sold to a plantation in Mississippi. Knowing they can't just go in and say they want her, they come up with a plan so that the owner will welcome them into his home and they can find a way. In 1858, in Texas, the former German dentist Dr. King Schultz meets the slave Django in a lonely road while being transported by the slavers Speck Brothers. He asks if Django knows the Brittle Brothers and with the affirmative, he buys Django for him. Then Dr. Schultz tells that he is a bounty-hunter chasing John, Ellis and Roger Brittle and proposes a deal to Django: if he helps him, he would give his freedom, a horse and US$ 75.00 for him. Django accepts the deal and Dr. Schultz trains him to be his deputy. They kill the brothers in Daughtray and Django tells that he would use the money to buy the freedom of his wife Broomhilda, who is a slave that speaks German. Dr. Schultz proposes another deal to Django: if he teams-up with him during the winter, he would give one-third of the rewards and help him to rescue Broomhilda. Django accepts his new deal and they become friends. After the winter, Dr. Schultz goes to Gatlinburgh and learns that Broomhilda was sold to the ruthless Calvin Candie von Shaft, who lives in the Candyland Farm, in Mississippi. Dr. Schultz plots a scheme with Django to lure Calvin and rescue Broomhilda from him. But his cruel minion Stephen is not easily fooled. In the late 1850's, former dentist turned bounty-hunter Dr. King Schultz buys the freedom of a man named Django from a slave trader duo in a quest to find and kill some men he wants dead. Afterwards, Django sets out with help from Schultz to find and rescue his wife Broomhilda who like him was sold into slavery by an anonymous owner. Their journey takes them to a plantation called Candieland, owned by a ruthless tycoon. Also, they come to some suspicions of the head slave named Stephen. Two years before the Civil War pits brother-against-brother, German-born bounty-hunter Dr. King Schultz (Academy Award-winner Christoph Waltz) arrives in America determined to capture the outlaw Brittle brothers dead or alive. In the midst of his search, Dr. Schultz crosses paths with Django (Academy Award-winner Jamie Foxx), a freed slave and skilled tracker who seeks to rescue his beloved wife Broomhilda (Kerry Washington) from ruthless plantation-owner Calvin Candie (Academy Award-nominee Leonardo DiCaprio). Once Django has aided Dr. Schultz in coral ling the Brittle brothers, the two team up to capture some of the most wa",
    "movie_genre": "Western"
},
{
    "movie_id": "tt1790809",
    "movie_title": "Pirates of the Caribbean: Dead Men Tell No Tales",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTYyMTcxNzc5M15BMl5BanBnXkFtZTgwOTg2ODE2MTI@.jpg",
    "movie_storyLines": "Captain Jack Sparrow is pursued by old rival Captain Salazar and a crew of deadly ghosts who have escaped from the Devil's Triangle. They're determined to kill every pirate at sea...notably Jack. Captain Jack Sparrow (Johnny Depp) finds the winds of ill-fortune blowing even more strongly when deadly ghost pirates led by his old nemesis, the terrifying Captain Salazar (Javier Bardem), escape from the Devil's Triangle, determined to kill every pirate at sea...including him. Captain Jack's only hope of survival lies in seeking out the legendary Trident of Poseidon, a powerful artifact that bestows upon its possessor total control over the seas. Captain Salazar (Javier Bardem), a deadly ghost escapes the Devil's triangle with his crew and is taking over the seas in search of his arch-rival and author of all his pain, Captain Jack Sparrow (Johnny Depp). In the meantime, Jack is approached by a boy who needs to locate the Trident of Poseidon, something he believes only Sparrow can help him find. Carina Smyth (Kaya Scodelario) an astronomer and horologist joins the team to help them find something she believes her father had always wanted her to find. Jack's only hope is to find the mythical Trident of Poseidon, who's master gets control of all the seas, or so it's said. Captain Jack Sparrow's (Johnny Depp's) luck has run out. Captain Salazar (Javier Bardem) has released the most deadly ghost pirates of the sea from the Devil's Triangle. Captain Salazar is the oldest villain of Jack Sparrow. The ghost pirates hunt every single pirate at sea, including Jack Sparrow. The only hope to survive this adventure is to collect the legendary Trident of Poseidon. This weapon is the most powerful weapon and the owner gets control of all seas. Is Jack going to collect this powerful weapon and can he ensure he is not going to get killed by Captain Salazar and his pirate ghosts?",
    "movie_genre": "Adventure"
},
{
    "movie_id": "tt21832076",
    "movie_title": "The Hobbit: The Battle of the Five Armies - Extended Edition Scenes",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BZGI4ZjA4MTEtY2ExYy00ZTg5LWFhMTctODI3OTY2OWU2ZWRjXkEyXkFqcGdeQXVyMTEwNDU1MzEy.jpg",
    "movie_storyLines": "Extended scenes from 'The Hobbit: The Battle of the Five Armies'.",
    "movie_genre": "Action/Adventure"
},
{
    "movie_id": "tt7161862",
    "movie_title": "Stargate Origins",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BOTg0Y2ZkYjUtZjA2NC00Y2M4LWFkMjctZmEyMjRmY2Y3NTdiXkEyXkFqcGdeQXVyMzM2NzQwNDM@.jpg",
    "movie_storyLines": "Young Catherine Langford embarks on an unexpected adventure to unlock the mystery of what lies beyond the Stargate in order to save the Earth from darkness.",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt20235400",
    "movie_title": "Talking the Orville",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BNDc2Yjc3Y2EtMDkwNS00YjNlLWIwZGItOGI5ZGNiOTlmNWE1XkEyXkFqcGdeQXVyMjEwNDA5Mzk@.jpg",
    "movie_storyLines": "Talking The Orville is the #1 source for everything going on in the 25th century. Celebrate Seth MacFarlane's sci-fi, space series, The Orville, with your fellow fans.",
    "movie_genre": "Comedy"
},
{
    "movie_id": "tt0372784",
    "movie_title": "Batman Begins",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BOTY4YjI2N2MtYmFlMC00ZjcyLTg3YjEtMDQyM2ZjYzQ5YWFkXkEyXkFqcGdeQXVyMTQxNzMzNDI@.jpg",
    "movie_storyLines": "After training with his mentor, Batman begins his fight to free crime-ridden Gotham City from corruption. When his parents are killed, billionaire playboy Bruce Wayne relocates to Asia, where he is mentored by Henri Ducard and Ra's Al Ghul in how to fight evil. When learning about the plan to wipe out evil in Gotham City by Ducard, Bruce prevents this plan from getting any further and heads back to his home. Back in his original surroundings, Bruce adopts the image of a bat to strike fear into the criminals and the corrupt as the icon known as \"Batman\". But it doesn't stay quiet for long. As a child, a young Bruce Wayne witnesses the death of his parents at the hands of a crazed criminal. As an adult, Bruce travels the world seeking the means to fight injustice. He lives amongst the boroughs of criminals and thieves in central Asia. Eventually, he meets a mysterious figure named Ra's Al Guhl and joins his gang called the League of Shadows. Using his training, he is able to defeat his trainer. Finally meeting up with his estate caretaker Alfred Pennyworth, Bruce Wayne returns to Gotham. There, he becomes the new head of Wayne Enterprises. Together, with the help of the C.E.O. of the Wayne Enterprises Applied Sciences division, a man name Lucius Fox, he dons a new persona: Batman. As Batman takes on the criminals and organized crime underworld of Gotham, a sinister new underbelly of the city is exposed, and a new class of criminal is born. Will Batman be the one to stop them all, or does Gotham need a hero with a face? Bruce Wayne, who experiences the death of his parents at a very young age, relocates to Asia and trains with his mentors, Henri Ducard and Ra's Al Ghul in fighting injustice. He returns to a crime-ridden Gotham and with the help of his old butler and estate caretaker, Alfred, the C.E.O. of Wayne Enterprises Applied Science Division Lucius Fox, he dons a new persona, Batman, to strike fear into the hearts of the criminals and the corrupt. With the help of rising cop Gordon, and the Assistant District Attorney, and Bruce's love interest Rachel Dawes, he is able to take down the Mafia Don Falcone, and the twisted doctor/drug dealer Jonathan Crane a.k.a. The Scarecrow. With Ra's Al Ghul's return with his evil plan to destroy Gotham by inducing fear into the hearts of the people, Batman must defeat his mentor once again so as to bring peace in Gotham. As a boy, a young Bruce Wayne watched in horror as his millionaire parents were slain in front of his eyes, a trauma which led him to become obsessed with revenge, but his chance is cruelly taken away from him by fate. After disappearing to the East where he seeks counsel with the dangerous but honorable ninja cult leader known as Ra's Al-Ghul, he returns to his now decaying Gotham City overrun by organized crime and dangerous individuals manipulating the system while the company he inherited is slowly being pulled out from under him. The discovery of a cave under his mansion, and a prototype armored suit leads him to take on a new persona,",
    "movie_genre": "Action-Adventure"
},
{
    "movie_id": "tt3401738",
    "movie_title": "Fast & Furious 6: Take Control",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMGNlNTA3ZjEtMjkzMC00ZmZiLTgwYWEtNTczMmU1OTA2NGNlXkEyXkFqcGdeQXVyMjI1MTU3NTM@.jpg",
    "movie_storyLines": "Intro by Producer Vin Diesel on how #6 was made with Paul Walker and the Skyline R35, Justin Lin says the title says 'Furious 6,' it was intentional as it was supposed to be the last film for this cast of characters. Vin talks about the character Hobbs and the skill and dominance he brings to the role.",
    "movie_genre": "Action"
},
{
    "movie_id": "tt2822672",
    "movie_title": "Rock Dog",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMjA5MTAwMzM3OF5BMl5BanBnXkFtZTgwNTk4NjYyMTI@.jpg",
    "movie_storyLines": "When a radio falls from the sky into the hands of a wide-eyed Tibetan Mastiff, he leaves home to fulfill his dream of becoming a musician, setting into motion a series of completely unexpected events. Teenage Tibetan Mastiff Bodi (Luke Wilson) is expected to be the next guard of the village of Snow Mountain, succeeding his father Khampa (J. K. Simmons), who years ago drove out a pack of gangster Grey wolves, led by the villainous Linnux (Lewis Black). Khampa has some local sheep disguised as Mastiffs to give the illusion the village has multiple guards to keep the wolves at bay, but Bodi has trouble perfecting his father's signature move the Iron Paw, which projects a powerful blast that can only happen if Bodi \"finds the fire.\" Khampa has forbidden music in the village as it distracted Bodi from his duties when he was younger..",
    "movie_genre": "Animation"
},
{
    "movie_id": "tt0104714",
    "movie_title": "Lethal Weapon 3",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BOTFlNjI0NDQtMzlkNC00ZDU0LWE0ODktYmI2OTc2YjZlZmVlXkEyXkFqcGdeQXVyMTQxNzMzNDI@.jpg",
    "movie_storyLines": "Martin Riggs and Roger Murtaugh pursue a former LAPD officer who uses his knowledge of police procedure and policies to steal and sell confiscated guns and ammunition to local street gangs. Archetypal buddy cops Riggs and Murtaugh are back for another round of high-stakes action, this time setting their collective sights on bringing down a former Los Angeles police lieutenant turned black market weapons dealer. Lorna Cole joins as the beautiful yet hardnosed internal affairs sergeant who catches Riggs's eye. Martin Riggs finally meets his match in the form of Lorna Cole, a beautiful but tough policewoman. Together with Roger Murtaugh, his partner, the three attempt to expose a crooked former policeman and his huge arms racket. The crooked cop (Jack Travis) thwarts them at every turn, mainly by killing anyone who is about to talk, but Murtaugh has personal problems of his own as his family are brought into the equation. Police officers Riggs and Murtaugh team together for the third time. This time they must track down a guy who has robbed weapons from the Los Angeles police depot. Riggs and Murtaugh also have to deal with Leo Getz, the hectic guy from Lethal Weapon 2 and Riggs has very special problems with a young and beautiful female police officer. Los Angeles police sergeant Roger Murtaugh and his partner, Sergeant Martin Riggs, arrest Billy Phelps for trying to rob an armored truck, this being just 8 days until Murtaugh is scheduled to retire. In the interrogation room, Billy is murdered by Lieutenant Jack Edward Travis, a vicious former cop who now sells guns that are stolen from evidence storage facilities. The investigation of Travis teams Riggs and Murtaugh up with Sergeant Lorna Cole of the Internal Affairs Division. Leo Getz, who is now a legitimate real estate agent, gets involved when he sees Travis's face on a paused videotape then says he recognizes Travis. Riggs finds himself falling in love with Lorna. Later, in a shootout against a street gang, Murtaugh kills a gangster who turns out to be Darrell Smithers, the best friend of Murtaugh's son Nick. A guilt ridden Murtaugh later tries to drink himself to death, but Riggs helps him realize that they must go after Travis, the man that Darrell's gun came from. Riggs and Murtaugh are back. This time after another one of Riggs' goofs, they are busted down to patrolmen. But they come across a robbery and they catch one of the robbers and discover that he has in his possession armor piercing bullets. Which means that no cop is safe. They go and try to speak to the man but Lorna Cole, a cop from Internal Affairs also wants to speak to him but Riggs is obstinate, so they go to the Captain, who not only backs them up but reinstates them as detectives. But when they go to see him, they find the man dead. But the learn who the killer is, a former cop named Jack Travis. But when they learn about this Cole shuts them out. But they get a lead from Leo Getz but unfortunately he gets away. Later Murtaugh shoots a boy who is armed with an automatic ",
    "movie_genre": "Action"
},
{
    "movie_id": "tt0482571",
    "movie_title": "The Prestige",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMjA4NDI0MTIxNF5BMl5BanBnXkFtZTYwNTM0MzY2.jpg",
    "movie_storyLines": "After a tragic accident, two stage magicians in 1890s London engage in a battle to create the ultimate illusion while sacrificing everything they have to outwit each other. In the end of the nineteenth century, in London, Robert Angier, his beloved wife Julia McCullough, and Alfred Borden are friends and assistants of a magician. When Julia accidentally dies during a performance, Robert blames Alfred for her death, and they become enemies. Both become famous and rival magicians, sabotaging the performance of the other on the stage. When Alfred performs a successful trick, Robert becomes obsessed trying to disclose the secret of his competitor with tragic consequences. Set in London in the 1800s, two rival magicians read each others diary containing the secrets of their magic tricks and personal life. As we go back in time when the diaries were written, both magicians become obsessed with their rival's best trick. The tricks, as shown to the audience, look the same, but neither magician can figure out how his opponent does it. Two magicians, who used to be partners, battle over years in order to create a flawless method for the ultimate disappearing trick, \"the Transported Man\", turns into an informal war between them, and soon, they will do anything to be able to preform the trick sooner and better than the other; which as time passes makes their friends and loved ones get away from them, and little-by-little destroys their lives until they eventually succeed to preform the trick, each by a very different way. In nineteenth century London, illusionist Alfred Borden is on trial for the murder of fellow illusionist, Robert Angier. Borden's indictment is largely possible because of the eyewitness account of John Cutter, who saw Borden backstage in the area where Angier was killed. At the end of one of his shows, Angier fell through a trap door in the stage floor into a clear water-filled tank below, that tank which was a prop for one of Angier's tricks performed earlier in the show. Angier ended up drowning, as the tank was locked after he fell into it. Borden, Angier, and Cutter have a shared largely turbulent history, which also provides motive. Early in their magic careers, both Borden and Angier worked under \"Milton the Magician\", while Angier's wife Julia worked as his on-stage assistant, and Cutter as his ingénieur, staging the tricks and providing the apparatus required, work that he still does for others. Based on a specific incident during this stage of their relationship led to both Borden and Angier striking out, creating their own shows, and them having a feud, which was not only in the professional realm, but a personal one, where each man wanted to ruin the other. While Borden is arguably more accomplished in the technical aspects of the illusions, Angier is the more accomplished showman. In the professional realm, they tried to outdo each other, especially in the illusions considered either the most dangerous and/or mysterious, those two being catching-the-bullet trick, and more so, ",
    "movie_genre": "Drama"
},
{
    "movie_id": "tt1515091",
    "movie_title": "Sherlock Holmes: A Game of Shadows",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTQwMzQ5Njk1MF5BMl5BanBnXkFtZTcwNjIxNzIxNw@@.jpg",
    "movie_storyLines": "Detective Sherlock Holmes is on the trail of criminal mastermind Professor Moriarty, who is carrying out a string of random crimes across Europe. With Dr. John Watson about to marry and end their partnership, a disconsolate Sherlock Holmes occupies his time investigating the schemes of his archenemy, Professor James Moriarty. However, when Moriarty warns that he considers the Watsons a legitimate target for his retaliation against the detective, Holmes must save them and get John involved in one last case. To do so, they join the Roma lady Madam Simza Heron's quest to find her missing brother, Renee, who may be the key to defeating Moriarty. Together, the trio find themselves involved in a dangerous international conspiracy led by the Napoleon of Crime in which the fate of all of Europe hangs in the balance. Sherlock Holmes is investigating terrorist attacks in London alone since his old partner Dr. John Watson will get married a few days later with Mary. His investigations point to Professor James Moriarty as the person responsible for the explosions. When Dr. Watson and Mary are attacked in the train while traveling for their honeymoon in Brighton, Holmes delivers Mary to the protection of his brother Mycroft. Soon Holmes and Dr. Watson disclose that Professor Moriarty has bought arms and ammunition factories and is trying to start a war in Europe killing political leaders and politicians. Now Sherlock and Watson have to stop Moriarty and his dangerous associate, the skilled former Colonel Sebastian Moran to avoid the imminent war. Against the backdrop of global unrest, shortly after the nearly supernatural events in  , the keenly observant detective and artist of deduction, Sherlock Holmes, along with his loyal comrade-in-arms, Dr Watson, find themselves drawn deeper and deeper into a sinister international conspiracy. As war closes in on 1891 Europe, a faint trail of breadcrumbs leads Sherlock to the cryptic Romani fortune-teller, Madame Simza Heron, and an unexpected but diabolical adversary: the mathematical genius and long-time arch-nemesis, Professor James Moriarty. Now, before the criminal mastermind's elaborate web of murder, no one is safe; especially those close to Holmes and Watson. Can the intrepid duo prevent collateral damage? Is the world prepared for Moriarty's sinister game of shadows? Sherlock Holmes, a now established master artist of deduction, is to take on his biggest challenge yet; navigating mysteries without the companion of his best friend, Dr. Watson, for he is getting married and decides to retire. As Holmes traverses a new web of atrocious crimes across 1891 Europe, he eventually traces it all back to the evil mastermind James Moriarty. With everyone around them being in grave danger, Holmes and Watson join forces for one last mystery. Are they prepared for Moriarty's sinister game of shadows, or are they but puppets he will skillfully play on their strings?",
    "movie_genre": "Action-Adventure"
},
{
    "movie_id": "tt7905466",
    "movie_title": "They Shall Not Grow Old",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BZWI3ZThmYzUtNDJhOC00ZWY4LThiNmMtZDgxNjE3Yzk4NDU1XkEyXkFqcGdeQXVyNTk5Nzg1NjQ@.jpg",
    "movie_storyLines": "A documentary about World War I with never-before-seen footage to commemorate the centennial of the end of the war. Through ground breaking computer restoration technology, filmmaker Peter Jackson's team creates a moving real-to-life depiction of the WWI, as never seen before in restored, vivid colorizing & retiming of the film frames, in order to honor those who fought and more accurately depict this historical moment in world history. Using state-of-the-art technology and materials from the BBC and Imperial War Museum, filmmaker Peter Jackson allows the story of World War I to be told by the men who were there. Life on the front is explored through the voices of the soldiers, who discuss their feelings about the conflict, the food they ate, the friends they made and their dreams of the future.",
    "movie_genre": "Documentary"
},
{
    "movie_id": "tt11198330",
    "movie_title": "House of the Dragon",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BZjBiOGIyY2YtOTA3OC00YzY1LThkYjktMGRkYTNhNTExY2I2XkEyXkFqcGdeQXVyMTEyMjM2NDc2.jpg",
    "movie_storyLines": "An internal succession war within House Targaryen at the height of its power, 172 years before the birth of Daenerys Targaryen. The Targaryen dynasty is at the absolute apex of its power, with more than 10 dragons under their yoke. Most empires crumble from such heights. In the case of the Targaryens, their slow fall begins when King Viserys breaks with a century of tradition by naming his daughter Rhaenyra heir to the Iron Throne. But when Viserys later fathers a son, the court is shocked when Rhaenyra retains her status as his heir, and seeds of division sow friction across the realm. Nearly two hundred years before Game of Thrones King Viserys of the House of Targaryen is the undisputed ruler of Westeros and surrounding lands. However, when he names his daughter Rhaenyra as his heir he sets in motion a series of events that many years in the future will lead to a bitter feud over who should sit on the Iron Throne.",
    "movie_genre": "Fantasy"
},
{
    "movie_id": "tt13406094",
    "movie_title": "The White Lotus",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BYjdjNzBmYjEtM2Y5My00YjI0LWJjY2YtOGQ4MjNkNmE2MDVjXkEyXkFqcGdeQXVyMTEyMjM2NDc2.jpg",
    "movie_storyLines": "Set in a tropical resort, it follows the exploits of various guests and employees over the span of a week. An all-star cast head to a resort and unleash their worst, most privileged impulses. The series is a sharp social satire following the exploits of various guests and employees of the fictional White Lotus resort chain, whose stay becomes affected by their various dysfunctions. A week in the life of vacationers is unraveled as they relax and rejuvenate in paradise. With each passing day, a darker complexity emerges in these picture-perfect travelers, the hotel's cheerful employees, and the idyllic locale itself.",
    "movie_genre": "Drama"
},
{
    "movie_id": "tt7631058",
    "movie_title": "The Lord of the Rings: The Rings of Power",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BNTg3NjcxYzgtYjljNC00Y2I2LWE3YmMtOTliZTkwYTE1MmZiXkEyXkFqcGdeQXVyNTY4NDc5MDE@.jpg",
    "movie_storyLines": "Epic drama set thousands of years before the events of J.R.R. Tolkien's 'The Hobbit' and 'The Lord of the Rings' follows an ensemble cast of characters, both familiar and new, as they confront the long-feared re-emergence of evil to Middle-earth. This epic drama is set thousands of years before the events of J.R.R. Tolkien’s The Hobbit and The Lord of the Rings, and will take viewers back to an era in which great powers were forged, kingdoms rose to glory and fell to ruin, unlikely heroes were tested, hope hung by the finest of threads, and the greatest villain that ever flowed from Tolkien’s pen threatened to cover all the world in darkness. Beginning in a time of relative peace, the series follows an ensemble cast of characters, both familiar and new, as they confront the long-feared re-emergence of evil to Middle-earth. From the darkest depths of the Misty Mountains, to the majestic forests of the elf-capital of Lindon, to the breathtaking island kingdom of Númenor, to the furthest reaches of the map, these kingdoms and characters will carve out legacies that live on long after they are gone.",
    "movie_genre": "Fantasy"
},
{
    "movie_id": "tt10768636",
    "movie_title": "Stargate: The Definitive History",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMWQ0NTY2NzItMTNjZS00ZjlkLWI3ZDktNDliNjM2ZmRjOTVlXkEyXkFqcGdeQXVyMTA2MzcyNDE3.jpg",
    "movie_storyLines": "The History of the Franchise starting with the various Stargate books in the 1960's to Stargate the Movie in 1994, the TV series Stargate SG1, Stargate Atlantis, and Stargate Universe, the Stargate Infinity Animated Show, and now the latest Prequel from StargateCommand.co titled Stargate Origins.",
    "movie_genre": "Documentary"
},
{
    "movie_id": "tt2362866",
    "movie_title": "Star Wars: Detours",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTM4ZjNkYjItM2NkYy00MzRmLTgxZDktOWZiNThiNjFlM2RiXkEyXkFqcGdeQXVyMjg5NDMwMQ@@.jpg",
    "movie_storyLines": "A comedic look at some of our favorite characters' more mundane moments during the reign of the Empire.",
    "movie_genre": "Comedy"
},
{
    "movie_id": "tt0322259",
    "movie_title": "2 Fast 2 Furious",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMzExYjcyYWMtY2JkOC00NDUwLTg2OTgtMDI3MGY2OWQzMDE2XkEyXkFqcGdeQXVyMTQxNzMzNDI@.jpg",
    "movie_storyLines": "Former cop Brian O'Conner is called upon to bust a dangerous criminal and he recruits the help of a former childhood friend and street racer who has a chance to redeem himself. EX LAPD cop Brian O'Conner (Paul Walker) teams up with his ex-con friend Roman Pearce (Tyrese Gibson) and works with undercover U.S. Customs Service agent Monica Fuentes (Eva Mendes) to bring Miami-based drug lord Carter Verone (Cole Hauser) down. Now an ex-cop , on the run ,Brian O'Connor (Paul Walker) hooks into outlaw street racing. When the Fed's strong arm him back O'Connor's no rules win-or-die skills are unleashed against an international drug Lord . With his velocity-addicted buddy ( Tyrese) riding shotgun ,and a drop dead- gorgeous undercover agent( Eva Mendes) dialing up the heat , 2 fast 2 furious accelerates the action into a desperate race for survival, justice ... and a mind - blowing jaw dropping speed! Former cop Brian O'Conner who teams up with his ex-con pal Roman Pearce to transport a shipment of 'dirty' money for shady Miami-based import-export dealer Carter Verone, while actually working with undercover agent Monica Fuentes to bring Verone down. Brian O'Conner has left LA due to his illegal actions from the first movie and now soars the streets of Miami making money here and there by street racing. Watched by Customs Agent Monica Fuentes, Brian is caught by the police and is given a deal by Agent Markham and Bilkins to go undercover and try to bring down drug lord Carter Verone in exchange for his criminal record to be erased. Brian agrees but only if he is given permission to choose his partner. Brian heads home to Barstow, California where he recruits an old friend Roman Pearce to help him. Pearce agrees but only for the same deal Brian was offered. With the help of Monica, Brian and Rome work together to take down Verone.",
    "movie_genre": "Action"
},
{
    "movie_id": "tt5273612",
    "movie_title": "Furious 7: Tower Jumps",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BYTcxYTRhNjItYjJlNy00NTYyLTg4MjQtZGRiYjcxMGRhY2FkXkEyXkFqcGdeQXVyMjQ5NjgwMjA@.jpg",
    "movie_storyLines": "This piece focuses on another of the film's signature car stunt scenes.",
    "movie_genre": "Action"
},
{
    "movie_id": "tt0096874",
    "movie_title": "Back to the Future Part II",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BZTMxMGM5MjItNDJhNy00MWI2LWJlZWMtOWFhMjI5ZTQwMWM3XkEyXkFqcGdeQXVyMTQxNzMzNDI@.jpg",
    "movie_storyLines": "After visiting 2015, Marty McFly must repeat his visit to 1955 to prevent disastrous changes to 1985...without interfering with his first trip. Marty McFly has only just gotten back from the past, when he is once again picked up by Dr. Emmett Brown and sent through time to the future. Marty's job in the future is to pose as his own son to prevent him from being thrown in prison. Unfortunately, things get worse when the future changes the present. This movie begins where Back to the Future ended; with Marty, Doc and Jennifer going into the future to help Marty and Jennifer's children. After doing that they return to 1985. But when they arrive they discover that things are not as they remember it. There's a casino which is owned by, of all people, Biff. Marty learns that his father was killed a few years ago and his mother is now married to Biff. Marty meets with Doc who thinks he knows what happened. Somehow Biff got his hands on a book from the future which has in it all sports results and he used it to bet on sports and amass his fortune. Marty said he considered doing that but Doc nixed it. Somehow the Biff from the future discovered about the time machine and Marty's plan and used the time machine to give his younger self the book. So they have to find out when Biff got the book so they can take it away from him. So Marty goes to see him and confronts him about it and Biff also tells him that he was the one who killed George. Marty and Doc then go back to, of all places, 1955 on the day of the school dance. So Marty tries to get the book while trying to avoid being seen by Doc's younger self and himself who's getting ready to go back to 1985. Marty at times gets the book but when Biff calls him a coward, Marty gets incensed which leads to him losing the book so he has to try and get it again. After a wacky trip to 1955, Marty McFly returns to his own time only to find himself going with his friend Doc Brown to the year 2015 to straighten out a family problem. When they return to 1985 however, they quickly discover that Biff Tannen has turned Hill Valley into a hell hole. Their only chance to restore their original time is to return to 1955 to set things right. The second part of the trilogy begins as Doc, Marty, and Jennifer take the time-traveling DeLorean into the year 2015 to straighten out the future of the McFly family. But Biff Tannen steals the time machine and gives his younger self a book containing 50 years of sports statistics, which the young Biff uses to amass an enormous gambling fortune and transform idyllic Hill Valley into a living hell. To restore the present, Doc and Marty must return to the events of their previous adventure in 1955 and retrieve the book. Marty McFly and Doc Brown make an exhilarating visit to the year 2015 seemingly to resolve a few problems with the future McFly family. But when the two return home, they soon discover someone has tampered with time to produce a nightmarish Hill Valley, 1985. Their only hope is to once again get back to 1955 and save the ",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt0120784",
    "movie_title": "Payback",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BN2YxYTUyMTItYmU4ZS00OTIzLWIwMWQtMDY3NzRiMmIyMWMxXkEyXkFqcGdeQXVyMTQxNzMzNDI@.jpg",
    "movie_storyLines": "After a successful heist, Porter is left for dead. Once he recovers, he seeks vengeance and wants his share of the money. Porter is bad, but his neighbours are worse. Street-wise and tough, an ex-marine, he is betrayed by a one-time partner, and shot in the back by his junkie wife. He survives and returns, looking to recover his share from the robbery of an Asian crime gang. The money has passed into the hands of \"the Outfit\", a slick gangster organisation that runs the city. He has to make his way through a world populated by heroin dealers, prostitutes, sado-masochists, gunmen and crooked cops, a place where torture is a way of life. His only friend is a former employer, a prostitute, and her loyalty is in question, given she now works for the Outfit. He makes good early progress, but then falls into the hands of Fairfax, the crime boss. Val Resnick and Porter, two small time bandits, hit a Chinese gang together and manage to get $140,000. But Val Resnick needs 130 grand alone to buy himself back into his syndication. So, Val turns on Porter together with Porter's wife Lynn, who kills him with two shots in the back. But Porter survives and half a year later, he is back, seeking his share of $70,000. When he finally finds Val, Porter quickly learns that he has to go much further up the ladder in order to get his money from the guys who have it: The syndication. Working alone can't be realized any more, so Porter teams up with his flame and previous boss Rosie, a very exclusive prostitute. Together, they now start playing the teams against each other. Porter is a super-bad guy who is so despicable that he would steal a pan-handler's money and take a waitress' tip. He is quickly shown to keep even worst company though as his friend and junkie wife join together to kill him after a robbery from an Oriental gang. Nonetheless, he recovers after being gunned in the back by his wife. He then sets out for revenge against his \"friend\", who used the money to buy his way into the \"Syndicate\". This means he also has to to take on the Syndicate bosses which include, in line, Carter, Justin Fairfax, and Bronson. Meanwhile, crooked cops also come after him trying to get their share of what they believe is a big load of money related to drugs, the Oriental gang seeks revenge against the robbers, and a crooked little middle man tries to get his own piece. Porter is a small time but tough criminal, who's primary gig, is robbery. Now his friend Val Resnick needs $130,000 to pay back a criminal group known as \"The Outfit\". He tells Porter about some Asian couriers who carry $300,000, Porter agrees to it on the condition that they split the take. When they hit them, they discover that they only have $140,000, and Resnick says that, that's what they always carry. He pulls out a gun and shoots Porter in the back and leaves him to die. However, Porter manages to make it to a doctor, and get treated, when he recovers, he sets out to get Resnick and his share $70,000. He begins by approaching an associate of Resnick's. ",
    "movie_genre": "Action"
},
{
    "movie_id": "tt2872732",
    "movie_title": "Lucy",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BODcxMzY3ODY1NF5BMl5BanBnXkFtZTgwNzg1NDY4MTE@.jpg",
    "movie_storyLines": "A woman, accidentally caught in a dark deal, turns the tables on her captors and transforms into a merciless warrior evolved beyond human logic. It was supposed to be a simple job. All Lucy had to do was deliver a mysterious briefcase to Mr. Jang. But immediately Lucy is caught up in a nightmarish deal where she is captured and turned into a drug mule for a new and powerful synthetic drug. When the bag she is carrying inside of her stomach leaks, Lucy's body undergoes unimaginable changes that begins to unlock her mind's full potential. With her new-found powers, Lucy turns into a merciless warrior intent on getting back at her captors. She receives invaluable help from Professor Norman, the leading authority on the human mind, and French police captain Pierre Del Rio. The American Lucy is studying in Taiwan and is dating Richard that she met at a nightclub. When Richard has a briefcase to deliver to the mysterious Korean Mr. Jang, he tricks Lucy and cuffs her to the briefcase. Lucy has no other option but to meet Mr. Jang, who is a dangerous drug lord that kills Richard. Lucy discovers that the briefcase contains the synthetic drug CPH4 and she is forced to work to Mr. Jang as drug mule with three other men and transport the drug to Europe hidden in their abdomens. However one of her captors kicks her in the abdomen and releases the CPH4 in her body. Soon Lucy enhances her brain capacity and develops her physical and mental capabilities. She uses her abilities to kill the criminals and flees. However her power does not stop increasing and is destroying Lucy that needs to use more CPH4 to stabilize her body. She contacts Professor Norman, who is an authority in brain capacity, and the scientist becomes her hope to save her. But Mr. Jang wants to retrieve his drug and is hunting Lucy down. Lucy is a smart, college student who finds herself in a horrific drug and human trafficking situation where her brain is permanently altered by an illegal new drug that gets accidentally ingested during her captivity. When she gets a kick to her abdomen, the drug starts to leak into her body, and she begins using more than 10% of her brain and finds that she has less than 24-48 hours to live. She finds the one neuro-scientist and professor who can help capture her super brain phenomenon for the world, before the villains kill her in the process. Unlucky Lucy, a twenty-four-year-old American student in Taipei, finds herself coerced into working as a drug mule for Taiwan's most dangerous man: the powerful Korean drug lord, Mr Jang. Having no other choice, Lucy is unwillingly subjected to a quick operation, where a synthetic, highly experimental drug is implanted inside her lower abdomen to transport it in Europe. However, when the potent blue chemical leaks into her bloodstream, the lethal dose will initiate a mind-boggling development of her cerebral activity, unlocking extraordinary skills, and unfathomable abilities that extend past the typical 10% of brain use. More and more, Lucy's superpowers grow stronger ",
    "movie_genre": "Action"
},
{
    "movie_id": "tt2908446",
    "movie_title": "The Divergent Series: Insurgent",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTgxOTYxMTg3OF5BMl5BanBnXkFtZTgwMDgyMzA2NDE@.jpg",
    "movie_storyLines": "Beatrice Prior must confront her inner demons and continue her fight against a powerful alliance which threatens to tear her society apart with the help from others on her side. As she searches for allies and answers in the wake of the uprising, Tris and Four are on the run. Being hunted by Jeanine Matthews, the leader of the Erudite faction, Tris and Four will race against time as they try to figure out what Abnegation sacrificed their lives to protect, and why the Erudite leaders will do anything to stop them. Haunted by her past choices but desperate to protect the ones she loves, Tris faces one impossible challenge after another as she unlocks the truth about the past and ultimately the future of her world. INSURGENT raises the stakes for Tris as she searches for allies and answers in the ruins of a futuristic Chicago. Tris (Woodley) and Four (James) are now fugitives on the run, hunted by Jeanine (Winslet), the leader of the power-hungry Erudite elite. Racing against time, they must find out what Tris's family sacrificed their lives to protect, and why the Erudite leaders will do anything to stop them. Haunted by her past choices but desperate to protect the ones she loves, Tris, with Four at her side, faces one impossible challenge after another as they unlock the truth about the past and ultimately the future of their world. Tris, Four, and her remaining allies are on the run from ruthless Jean Matthews, and her Erudite faction, where they take refuge at the Amity stronghold. While there, Tris learns that the Erudite are gaining power and decides that she must fight with her inner fears and decide what to do to protect her home. Insurgent This movie is a sci-fi, action and drama movie based on a book by Veronica Roth, about a girl who is running with her boyfriend and brother from the enemy, while unleashing new secrets about her family's past and her mysterious Divergence. Sixteen-year-old Tris Prior ( ) lives in a society divided into five factions. Each faction represents a different way of handling things. Erudite are the intelligent. Candor the honest. Abnegation the selfless. Amity the kind. Dauntless the brave. The Erudite have declared war against Abnegation, because they believe that they have important information about the Divergent, who are apparently dangerous for the faction-system. Haunted by her past, Tris must make choices that will change her. While running with her boyfriend Four ( )and her brother Caleb( ) from Erudite, who want to find her, because of her abnormal brain functioning. She and Four seek shelter in various faction headquarters with other Dauntless who have chosen to fight against Erudite's self-proclaimed, smug, superiority. Dauntless are plotting against Erudite, with other allies until Erudite begins to kill people if Tris doesn't sacrifice herself. Again, Tris must confront her inner demons and make a choice that may change everything. What she doesn't realize is that if she sacrificed herself the world they know may change forever. Five days after the",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt0310793",
    "movie_title": "Bowling for Columbine",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BOWY2OWM1ODEtNDU5OS00MjMwLTliYzItZWZlOTEyYmQ2Njg4XkEyXkFqcGdeQXVyMTQxNzMzNDI@.jpg",
    "movie_storyLines": "Filmmaker   explores the roots of America's predilection for gun violence. The United States of America is notorious for its astronomical number of people killed by firearms for a developed nation without a civil war. With his signature sense of angry humor, activist filmmaker   sets out to explore the roots of this bloodshed. In doing so, he learns that the conventional answers of easy availability of guns, violent national history, violent entertainment and even poverty are inadequate to explain this violence when other cultures share those same factors without the equivalent carnage. In order to arrive at a possible explanation,   takes on a deeper examination of America's culture of fear, bigotry and violence in a nation with widespread gun ownership. Furthermore, he seeks to investigate and confront the powerful elite political and corporate interests fanning this culture for their own unscrupulous gain. Filmmaker   sets out to explore the reason(s) behind the massacre of 12 students and a teacher at Columbine High School on April 20, 1999. He documents how two students,   and  , easily acquired four pieces of firearms, despite of having a history of arrests, juvenile detention, counseling sessions, and drug dependencies. He documents how the U.S. has ended up as a country with the highest number of gun-related killings on Earth. With interviews with people like  , former President of the National Rifle Association, who lives in a fortified mansion, Moore shows how easy it is to acquire guns and munitions - with examples of a bank giving a free gun just for opening a bank account, and of one particular municipality that makes gun-ownership mandatory. Moore then links the involvement of the U.S. with tyrants and terrorists such as   and   for it's own narrow gains - resulting in deaths of millions of civilians from 1953 through to 2001 - and it's refusal to review and change it's now notorious \"Foreign Policy\". Political documentary filmmaker   explores the circumstances that lead to the 1999 Columbine High School massacre and, more broadly, the proliferation of guns and the high homicide rate in America. In his trademark provocative fashion, Moore accosts Kmart corporate employees and pleads with them to stop selling bullets, investigates why Canada doesn't have the same excessive rate of gun violence and questions actor   on his support of the National Rifle Association.",
    "movie_genre": "Documentary"
},
{
    "movie_id": "tt13380510",
    "movie_title": "Game of Thrones",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BNTg1MjEyNWYtNzJkZi00ZTM5LThlNWMtMmNiNmE3N2QxNTllXkEyXkFqcGdeQXVyNTE1NjY5Mg@@.jpg",
    "movie_storyLines": "Game of Thrones Book One: A Song of Ice and Fire written by George R. R. Martin is an immensely popular fantasy series audiobook narrated by veteran British actor Roy Dotrice.",
    "movie_genre": "Drama"
},
{
    "movie_id": "tt7660850",
    "movie_title": "Succession",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BZDE0ODVlYjktNjJiMC00ODk4LWIwNTktMWRhZmZiOGFhYmUwXkEyXkFqcGdeQXVyMTkxNjUyNQ@@.jpg",
    "movie_storyLines": "The Roy family is known for controlling the biggest media and entertainment company in the world. However, their world changes when their father steps down from the company.",
    "movie_genre": "Drama"
},
{
    "movie_id": "tt10986410",
    "movie_title": "Ted Lasso",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMDVmODUzNmEtMGMxZC00NWUzLTkxMTAtMDM5OTQzMWE0ZDM3XkEyXkFqcGdeQXVyMDM2NDM2MQ@@.jpg",
    "movie_storyLines": "American college football coach Ted Lasso heads to London to manage AFC Richmond, a struggling English Premier League football team.",
    "movie_genre": "Sports"
},
{
    "movie_id": "tt4036926",
    "movie_title": "Stargate Universe: Distant Hope",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BYzE0NmQ3ZTMtODE4ZC00NTI2LTg4OTctMDYxYjlmY2Q1MTk5XkEyXkFqcGdeQXVyMzYzNzc1NjY@.jpg",
    "movie_storyLines": "It looks like we don't have any Plot Summaries for this title yet.  Be the first to contribute! Just click the \"Edit page\" button at the bottom of the page or learn more in the  .",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt15179648",
    "movie_title": "It Wants Blood 2",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BZDFhMzRlYjgtN2IxMC00MzJkLTljNmYtOTlhMjYxOTM4NjYzXkEyXkFqcGdeQXVyODg5ODI3MzQ@.jpg",
    "movie_storyLines": "Two giant monsters are forced to battle head to head on the political circuit as they run against each other for a seat in the Senate.",
    "movie_genre": "Comedy"
},
{
    "movie_id": "tt4693252",
    "movie_title": "13 Going on 30: Bloopers",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTk3MjAwNTAxN15BMl5BanBnXkFtZTcwMDQ5MTYyMQ@@.jpg",
    "movie_storyLines": "A short blooper reel from the filming of 13 Going on 30.",
    "movie_genre": "Comedy"
},
{
    "movie_id": "tt0102926",
    "movie_title": "The Silence of the Lambs",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BNjNhZTk0ZmEtNjJhMi00YzFlLWE1MmEtYzM1M2ZmMGMwMTU4XkEyXkFqcGdeQXVyNjU0OTQ0OTY@.jpg",
    "movie_storyLines": "A young F.B.I. cadet must receive the help of an incarcerated and manipulative cannibal killer to help catch another serial killer, a madman who skins his victims. F.B.I. trainee Clarice Starling (Jodie Foster) works hard to advance her career, while trying to hide or put behind her West Virginia roots, of which if some knew, would automatically classify her as being backward or white trash. After graduation, she aspires to work in the agency's Behavioral Science Unit under the leadership of Jack Crawford (Scott Glenn). While she is still a trainee, Crawford asks her to question Dr. Hannibal Lecter (Sir Anthony Hopkins), a psychiatrist imprisoned, thus far, for eight years in maximum security isolation for being a serial killer who cannibalized his victims. Clarice is able to figure out the assignment is to pick Lecter's brains to help them solve another serial murder case, that of someone coined by the media as \"Buffalo Bill\" (Ted Levine), who has so far killed five victims, all located in the eastern U.S., all young women, who are slightly overweight (especially around the hips), all who were drowned in natural bodies of water, and all who were stripped of large swaths of skin. She also figures that Crawford chose her, as a woman, to be able to trigger some emotional response from Lecter. After speaking to Lecter for the first time, she realizes that everything with him will be a psychological game, with her often having to read between the very cryptic lines he provides. She has to decide how much she will play along, as his request in return for talking to him is to expose herself emotionally to him. The case takes a more dire turn when a sixth victim is discovered, this one from who they are able to retrieve a key piece of evidence, if Lecter is being forthright as to its meaning. A potential seventh victim is high profile Catherine Martin (Brooke Smith), the daughter of Senator Ruth Martin (Diane Baker), which places greater scrutiny on the case as they search for a hopefully still alive Catherine. Who may factor into what happens is Dr. Frederick Chilton (Anthony Heald), the warden at the prison, an opportunist who sees the higher profile with Catherine, meaning a higher profile for himself if he can insert himself successfully into the proceedings. Perplexed by a string of grisly murders elaborately executed by the elusive mass-killer nicknamed \"Buffalo Bill\", the vulnerable and untried F.B.I. trainee, Clarice Starling, is assigned by the Special Agent, Jack Crawford, to assist in the manhunt. Hoping to attain a clearer perception of the psychopathic serial killer's modus operandi, the young investigator reluctantly accepts the help of another hideous monster: the brilliant psychiatrist and cannibalistic mass-murderer, Dr Hannibal Lecter. Now, with every visit to the manipulative doctor's heavily reinforced prison cell, Clarice delves just a little bit deeper into the dark mind of a homicidal maniac; however, how far is she willing to go to unearth pure evil? Young F.B.I. trainee Clarice",
    "movie_genre": "Psychological Thriller"
},
{
    "movie_id": "tt4154756",
    "movie_title": "Avengers: Infinity War",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMjMxNjY2MDU1OV5BMl5BanBnXkFtZTgwNzY1MTUwNTM@.jpg",
    "movie_storyLines": "The Avengers and their allies must be willing to sacrifice all in an attempt to defeat the powerful Thanos before his blitz of devastation and ruin puts an end to the universe. As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment, the fate of Earth and existence has never been more uncertain. Now that Earth has put its mark on the universe through the Avengers, all superheroes, including ones from other parts of the Galaxy, must join forces to stop the powerful Thanos from taking all the infinity stones and destroying the universe one planet at a time. The mad titan Thanos (Josh Brolin) begins his hunt for the most powerful objects in the universe, the Infinity Stones, in this movie. With the Space Stone, given by Loki (Tom Hiddleston), and the Power Stone, Thanos sends (Ebony Maw, Cull Obsidian to retrieve the Time Stone from Doctor Strange (Benedict Cumberbatch), sends Proxima Midnight, and Corvus Glaive) to retrieve the Mind Stone from Vision (Paul Bettany). Meanwhile, Tony Stark (Robert Downey, Jr.) meets up with Bruce Banner (Mark Ruffalo) and sorcerers Doctor Strange (Benedict Cumberbatch) and Wong (Benedict Wong). With help from Peter Parker/Spider-Man (Tom Holland), Stark and Strange join forces together and agree to stop Thanos. In space, Thor (Chris Hemsworth) also joins forces with the Guardians of the Galaxy, Star-Lord (Chris Pratt), Drax (Dave Bautista), Rocket (Bradley Cooper), Groot (Vin Diesel), Mantis (Pom Klementieff), and Gamora (Zoe Saldana), the daughter of Thanos who warns Thor of his power. Thor travels away to defeat Thanos with Rocket and Groot, while the other Guardians join forces with Stark, Strange, and Parker. In Wakanda, Steve Rogers (Chris Evans) and his team, Black Widow (Scarlett Johansson), Falcon (Anthony Mackie), Scarlet Witch (Elizabeth Olsen), War Machine (Don Cheadle), and Bruce Banner to protect Vision and the Mind Stone in his forehead. With protection given from King T'Challa/Black Panther (Chadwick Boseman), and his Wakandan army, Thanos will come for everyone to destroy half the universe. Two years after the Leipzig fight and immediately following the destruction of Asgard, the Avengers and the Guardians of the Galaxy learn that the Mad Titan Thanos is seeking to collect the Infinity Stones, which are said to be the most powerful artifacts in the universe. Facing an enemy too powerful to stop alone, the Avengers and the Guardians, alongside Doctor Strange, Black Panther, and Spider-Man must come together and stop Thanos from inflicting his power and destroying the universe. The mad titan Thanos has begun his quest to obtain all six Infinity Stones, which will give him the power to wipe out ha",
    "movie_genre": "Superhero"
},
{
    "movie_id": "tt0816711",
    "movie_title": "World War Z",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BNDQ4YzFmNzktMmM5ZC00MDZjLTk1OTktNDE2ODE4YjM2MjJjXkEyXkFqcGdeQXVyNTA4NzY1MzY@.jpg",
    "movie_storyLines": "Former United Nations employee Gerry Lane traverses the world in a race against time to stop a zombie pandemic that is toppling armies and governments and threatens to destroy humanity itself. Life for former United Nations investigator Gerry Lane and his family seems content. Suddenly, the world is plagued by a mysterious infection turning whole human populations into rampaging mindless zombies. After barely escaping the chaos, Lane is persuaded to go on a mission to investigate this disease. What follows is a perilous trek around the world where Lane must brave horrific dangers and long odds to find answers before human civilization falls. When former U.N. investigator Gerry Lane and his family get stuck in urban gridlock, he senses that it's no ordinary traffic jam. His suspicions are confirmed when, suddenly, the city erupts into chaos. A lethal virus, spread through a single bite, is turning healthy people into something vicious, unthinking and feral. As the pandemic threatens to consume humanity, Gerry leads a worldwide search to find the source of the infection and, with luck, a halt to it's spread. A virulent and unprecedented pandemic of global proportions which turns humans into rabid flesh-eating zombies takes the world by surprise. Under these circumstances, the retired United Nations special agent, Gerry Lane, must leave behind a peaceful family life, a wife and two daughters, to escort a team of scientists on a mission to find a cure, navigating through zombie-swarmed cities. However, as the deadly pathogen obliterates entire areas, incessantly giving birth to diseased masses of freshly-reanimated undead, the frail hope of finding a viable solution starts drifting away. Does humanity have enough time to wait for a miracle? Having retired as U.N. investigator, Gerry Lane devotes his time to wife Karin and their wining brat daughter Constance and Rachel in Philadelphia, until it becomes the next site of a globally spreading mystery epidemic turning bitten people into rabies-like zombies. His clueless former chief, deputy secretary general Thierry Umutoni, recalls him to the UN emergency team, thus offering the whole family a spot aboard the safe air carrier. Gerry joins though army veterans on reconnaissance to Korea, where a rogue CIA agent's suggestion proves worthless, then to Israel, where a Mossad 'contrarious tenth man' had the foresight to respond to a vague Indian pandemic threat by erecting a wall Jerusalem, only to see an undead flood overtake it. His last minute escape flight must deal drastically with an infected passenger before crashing in Cardiff, near a WHO research facility, where he combines and tests a daring out of the box 'camouflage' strategy inspired by weir observations. Retired U.N. investigator Gerry Lane (Brad Pitt) and his family are sitting in what appears to be a typical Philadelphia traffic jam when helicopters began to circle ominously overhead and an explosion throws the city into panic. In the blink of an eye, the streets are consumed by chaos. When ",
    "movie_genre": "Action-Horror"
},
{
    "movie_id": "tt0343818",
    "movie_title": "I, Robot",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BNmE1OWI2ZGItMDUyOS00MmU5LWE0MzUtYTQ0YzA1YTE5MGYxXkEyXkFqcGdeQXVyMDM5ODIyNw@@.jpg",
    "movie_storyLines": "In 2035, a technophobic cop investigates a crime that may have been perpetrated by a robot, which leads to a larger threat to humanity. In 2035, techno-phobic homicide detective Del Spooner of the Chicago PD heads the investigation of the apparent suicide of leading robotics scientist, Dr. Alfred Lanning. Unconvinced of the motive, Spooner's investigation into Lanning's death reveals a trail of secrets and agendas within the USR (United States Robotics) corporation and suspicions of murder. Little does he know that his investigation would lead to uncovering a larger threat to humanity. Set in a future Earth (2035 A.D.) where robots are common assistants and workers for their human owners, this is the story of \"robotophobic\" Chicago Police Detective Del Spooner's investigation into the murder of Dr. Alfred Lanning, who works at U.S. Robotics, in which a robot, Sonny , appears to be implicated, even though that would mean the robot had violated the Three Laws of Robotics, which is apparently impossible. It seems impossible because.. if robots can break those laws, there's nothing to stop them from taking over the world, as humans have grown to become completely dependent upon their robots. Or maybe... they already have? Aiding Spooner in his investigation is a psychologist, Dr. Susan Calvin, who specializes in the psyches of robots. This is the year 2035. Everybody in the world relies on a huge system of robots, which are programmed specifically to help humans and not harm them in any way. But one person does not think that robots are helpful. Chicago homicide detective Del Spooner. But one day, he received a call from the United States Robotics (USR) about a recent death of renowned robot scientist Dr. Alfred J. Laning. Spooner immediately blamed this incident on robots without justifiable reason or proof. Then, he begins his investigation on Lanning's death, only to discover Sonny, a \"unique\" robot. What Spooner does not realize, is that something is about to happen. Something that is beyond even Spooner's wildest dreams. It's the year 2035, and the society now has the help of robots. These robots follow three laws integrated into their system; 1) They cannot harm a human being or, through inaction, allow a human being to come to harm. 2)They must do whatever they're told by a human being as long as such orders don't conflict with law one. 3) They have to defend themselves as long as such defense doesn't conflict with laws one or two. One day, the writer of the three laws, Alfred Lanning, apparently jumps out of a window at U.S. Robotics. The majority of the Chicago Police Department believe he committed suicide, but Detective Del Spooner, who hates robots, thinks he was murdered, and the number one suspect is a robot who calls himself Sonny. However, if it was Sonny, then it means he would've had to have broken the three laws. With the help of Dr. Susan Calvin, Spooner must now discover the truth before it's too late. It's 2035 A.D., where robots are everyday objects and are programmed to live ",
    "movie_genre": "Science Fiction"
},
{
    "movie_id": "tt4044364",
    "movie_title": "Citizenfour",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTc0MTM0MTA5MF5BMl5BanBnXkFtZTgwNzEwODEwMzE@.jpg",
    "movie_storyLines": "A documentarian and a reporter travel to Hong Kong for the first of many meetings with  . In January 2013,   started receiving anonymous encrypted e-mails from \"CITIZENFOUR,\" who claimed to have evidence of illegal covert surveillance programs run by the NSA in collaboration with other intelligence agencies worldwide. Five months later, she and reporters   and   flew to Hong Kong for the first of many meetings with the man who turned out to be  . She brought her camera with her. The resulting film is history unfolding before our eyes. After   received encrypted emails from someone with information on the government's massive covert-surveillance programs, she and reporter   flew to Hong Kong to meet the sender, who turned out to be  .",
    "movie_genre": "Documentary"
},
{
    "movie_id": "tt1113829",
    "movie_title": "George Harrison: Living in the Material World",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BM2FkMzc0ZjUtMjU0Yi00OTg5LTg1NDgtNTNlOTI3MmYyNzQ5XkEyXkFqcGdeQXVyNTM0NTU5Mg@@.jpg",
    "movie_storyLines": "Filmmaker   examines the life of musician  , weaving together interviews, concert footage, home movies and photographs.  first became known to the world as \"The Quiet Beatle\" of the Fab Four, but there was far more to his life than simply being a part of  . This film explores the life and career of this seminal musician, philanthropist, film producer, and amateur race-car driver who grew to make his own mark on the world. Through his music, archival footage, and the memories of friends and family, Harrison's deep spirituality and humanity are explored in his singular life as he took on artistic challenges and important causes as only he could.",
    "movie_genre": "Documentary"
},
{
    "movie_id": "tt2802850",
    "movie_title": "Fargo",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BN2NiMGE5M2UtNWNlNC00N2Y4LTkwOWUtMDlkMzEwNTcyOTcyXkEyXkFqcGdeQXVyMTkxNjUyNQ@@.jpg",
    "movie_storyLines": "Various chronicles of deception, intrigue and murder in and around frozen Minnesota. Yet all of these tales mysteriously lead back one way or another to Fargo, North Dakota. The all new \"true crime\" case of Fargo's new chapter travels back to 1979 in Sioux Falls, South Dakota and Luverne, Minnesota, where a young State Police Officer Lou Solverson, recently back from Vietnam, investigates a case involving a local crime gang and a major Mob syndicate. Helping him piece things together is his father-in-law, Sheriff Hank Larsson. The investigation will lead them to a colorful cast of characters that includes Karl Weathers, the town lawyer of Luverne, Minnesota. A Korean War vet, Karl is a flowery drunk blessed with the gift of gab and the eloquence of a true con artist. Joe Bulo, the front man for the northern expansion of a Kansas City crime syndicate. The new face of corporate crime, Joe's bringing a Walmart mentality to small town America. His number two is Mike Milligan. Part enforcer, part detective, Mike is always smiling - but the joke is usually on you. Bulo and his crew have their sights set on the Gerhardt crime family in Fargo, currently led by matriarch Floyd Gerhardt. With her husband at death's door, Floyd takes over the family business, frustrating her eldest son, Dodd Gerhardt. An impatient hothead with a cruel streak to match his ambitions, Dodd can't wait for both his parents to die so he can take over and expand their business from kingdom to empire. Bear Gerhardt is the middle son, an intimidatingly large man who, although inarticulate, is the most decent of his clan. Rye Gerhardt, the youngest of the Gerhardt clan, views himself as a big shot, but in reality he's just a small dog who barks big.",
    "movie_genre": "Crime Drama"
},
{
    "movie_id": "tt16433946",
    "movie_title": "Ted Lasso: The Missing Christmas Mustache",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BODAzNTUwYjktOGMwOS00YjdhLWJmMDEtM2E3NmQyYzhkMmNmXkEyXkFqcGdeQXVyMTA5NzUzODM4.jpg",
    "movie_storyLines": "Follows the ensemble cast of Ted Lasso as they help Ted search for a lost item, but end up understanding the real meaning of the holiday season.",
    "movie_genre": "Comedy"
},
{
    "movie_id": "tt5753856",
    "movie_title": "Dark",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BOTk2NzUyOTctZDdlMS00MDJlLTgzNTEtNzQzYjFhNjA0YjBjXkEyXkFqcGdeQXVyMjg1NDcxNDE@.jpg",
    "movie_storyLines": "A family saga with a supernatural twist, set in a German town where the disappearance of two young children exposes the relationships among four families. The first German production from the world's leading Internet TV Network is set in a present-day German town where the disappearance of two young children exposes the double lives and fractured relationships among four families. In 10 hour-long episodes, the story takes on a surprising twist that ties back to the same town in 1986. When two children go missing in a small German town, its sinful past is exposed along with the double lives and fractured relationships that exist among four families as they search for the kids. The mystery-drama series introduces an intricate puzzle filled with twists that includes a web of curious characters, all of whom have a connection to the town's troubled history--whether they know it or not. The story includes supernatural elements that tie back to the same town in 1986.",
    "movie_genre": "Drama/Mystery"
},
{
    "movie_id": "tt0250494",
    "movie_title": "Legally Blonde",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BNTEyNjUwMTkxMV5BMl5BanBnXkFtZTcwNjk0NDk0NA@@.jpg",
    "movie_storyLines": "Elle Woods, a fashionable sorority queen, is dumped by her boyfriend. She decides to follow him to law school. While she is there, she figures out that there is more to her than just looks. Elle Woods ( ) has it all. She's the President of her sorority, a Hawaiian Tropic girl, Miss June in her campus calendar, and, above all, a natural blonde. She dates the cutest fraternity boy on campus and wants nothing more than to be Mrs. Warner Huntington III. But, there's just one thing stopping Warner ( ) from popping the question: Elle is too blonde. Growing up across the street from   might mean something in Los Angeles, California, but nothing to Warner's East-Coast blue blood family. So, when Warner packs up for Harvard Law and reunites with an old sweetheart from prep school, Elle rallies all her resources and gets into Harvard, determined to win him back. But law school is a far cry from the comforts of her poolside and the mall. Elle must wage the battle of her life, for her guy, for herself and for all the blondes who suffer endless indignities everyday.",
    "movie_genre": "Romantic Comedy"
},
{
    "movie_id": "tt2283362",
    "movie_title": "Jumanji: Welcome to the Jungle",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BODQ0NDhjYWItYTMxZi00NTk2LWIzNDEtOWZiYWYxZjc2MTgxXkEyXkFqcGdeQXVyMTQxNzMzNDI@.jpg",
    "movie_storyLines": "Four teenagers are sucked into a magical video game, and the only way they can escape is to work together to finish the game. In a brand-new Jumanji adventure, four high-school kids discover an old video-game console and are drawn into the game's jungle setting, literally becoming the adult avatars they chose. What they discover is that you don't just play Jumanji--you must survive it. To beat the game and return to the real world, they must go on the most dangerous adventure of their lives, discover what Alan Parrish left 20 years ago, and change the way they think about themselves --or they'll be stuck in the game forever, to be played by others without break. Jumanji, the magical board game and ancient portal to its fearsome and savage jungles, gets an upgrade, this time luring four teens into its realm when one of them stumbles upon an old-school video-game console. Inevitably, as the unwitting players transform into their chosen game avatars inside a mysterious new world crawling with formidable adversaries, they'll need to put their newly-acquired skills to good use to finally complete the game. The deep sound of the feral drums is incessant. Can the quirky quartet return to the physical world in one piece? When 4 high schoolers are sucked into the video game, jumanji, they soon find out that they each have special capabilities. They must use these capabilities to complete the challenges to escape jumanji, with a certain amount of lives and new bodies to handle, will these four teens band together to escape? Or will they be stuck in jumanji, forever! Four teens are transported into the video game Jumanji. They now have new bodies, complete with unique strengths and weaknesses. They also have a mission: retrieve a precious gem from an evil warlord and return it to the statue from which it came. If they can't do this, they'll never leave the game. In 1996 Brantford, New Hampshire, teenager Alex Vreeke is given the Jumanji board game by his father, who found it on a beach. Uninterested, he sets the game aside. That night, it transforms into a video-game cartridge that catches Alex's attention when the Jumanji drumbeats awaken him. When he begins playing it, he disappears into the game. 20 years later, four students at Brantford High are sentenced to detention: Spence Gilpin and his former friend Anthony \"Fridge\" Johnson for cheating, Bethany Walker for making a phone call during an English test, and Martha Kaply for refusing to participate in gym class and insulting her teacher. In the school basement, where they are serving their detention, Fridge discovers Alex's discarded video-game system, and he and Spencer decide to play. Although it has five playable characters, they are unable to select the first one, so they choose two others, and convince the girls to play as the remaining two. When Spencer presses \"Start\", they are transported into the game.",
    "movie_genre": "Adventure"
},
{
    "movie_id": "tt0081505",
    "movie_title": "The Shining",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BZWFlYmY2MGEtZjVkYS00YzU4LTg0YjQtYzY1ZGE3NTA5NGQxXkEyXkFqcGdeQXVyMTQxNzMzNDI@.jpg",
    "movie_storyLines": "A family heads to an isolated hotel for the winter where a sinister presence influences the father into violence, while his psychic son sees horrific forebodings from both past and future. Haunted by a persistent writer's block, the aspiring author and recovering alcoholic, Jack Torrance, drags his wife, Wendy, and his gifted son, Danny, up snow-capped Colorado's secluded Overlook Hotel after taking up a job as an off-season caretaker. As the cavernous hotel shuts down for the season, the manager gives Jack a grand tour, and the facility's chef, the ageing Mr Hallorann, has a fascinating chat with Danny about a rare psychic gift called \"The Shining\", making sure to warn him about the hotel's abandoned rooms, and, in particular, the off-limits Room 237. However, instead of overcoming the dismal creative rut, little by little, Jack starts losing his mind, trapped in an unforgiving environment of seemingly endless snowstorms, and a gargantuan silent prison riddled with strange occurrences and eerie visions. Now, the incessant voices inside Jack's head demand sacrifice. Is Jack capable of murder? Built in 1907, the posh, grand and secluded Overlook Hotel, located in the mountains of Colorado, closes for the winter months as it was never designed as a ski resort, that seclusion and isolation which has always been its attraction for its upscale guests and which makes it largely inaccessible in the snowy winter. Having recently moved from Vermont to Boulder with his wife Wendy and their adolescent son Danny, former schoolteacher Jack Torrance has just accepted the five month job as the Overlook's winter caretaker in wanting uninterrupted solitude to start his new career as a writer. In accepting the job, Jack was not deterred in knowing of the incident ten years ago when the then hotel GM Charles Grady, acting as that season's winter caretaker, developed a severe case of cabin fever and ended up gruesomely killing his wife and two daughters before killing himself. Beyond a recent undiagnosed collapse experienced by Danny which may be an issue if it happens again at the hotel, Wendy is looking forward to this five month getaway. While Danny indirectly states he doesn't want to go, Wendy is not concerned about his emotional well being in this new situation as he, out of circumstance, has often been on his own without other children around, which has long ago led to him creating an imaginary friend named Tony who lives in Danny's mouth. When the Torrances arrive at the Overlook on October 30th, its last day of operation before they take over for the winter, Danny learns that there is someone at the hotel who knows his secret abilities in association to Tony's true nature. After the regular staff leaves for the winter and as winter truly sets in, the isolation of the resort begins to show itself. The question becomes which of the often battling powers in this isolation will ultimately come out on top: Wendy's mortal fortitude, Danny's secret ability which he learns is called the shining, or the hotel's ass",
    "movie_genre": "Horror"
}]