[
    {
        "movie_id": "tt0120915",
        "movie_title": "Star Wars: Episode I - The Phantom Menace",
        "movie_poster": "https://m.media-amazon.com/images/M/MV5BYTRhNjcwNWQtMGJmMi00NmQyLWE2YzItODVmMTdjNWI0ZDA2XkEyXkFqcGdeQXVyNTAyODkwOQ@@.jpg",
        "movie_storyLines": "Two Jedi escape a hostile blockade to find allies and come across a young boy who may bring balance to the Force, but the long dormant Sith resurface to claim their original glory. The evil Trade Federation, led by Nute Gunray is planning to take over the peaceful world of Naboo. Jedi Knights Qui-Gon Jinn and Obi-Wan Kenobi are sent to confront the leaders. But not everything goes to plan. The two Jedi escape, and along with their new Gungan friend, Jar Jar Binks head to Naboo to warn Queen Amidala, but droids have already started to capture Naboo and the Queen is not safe there. Eventually, they land on Tatooine, where they become friends with a young boy known as Anakin Skywalker. Qui-Gon is curious about the boy, and sees a bright future for him. The group must now find a way of getting to Coruscant and to finally solve this trade dispute, but there is someone else hiding in the shadows. Are the Sith really extinct? Is the Queen really who she says she is? And what's so special about this young boy? When the Trade Federation organize a blockade around the planet Naboo, the Supreme Chancellor Valorum sends the Jedi Qui-Gon Jinn and Obi-Wan Kenobi to negotiate the end of the blockade. However the evil Viceroy Nute Gunray is ordered to kill the Jedi and invade Naboo. However the Jedi escape and Qui-Gon saves the life of the clumsy Gungan Jar Jar Binks. The outcast native takes the Jedi to his submerged city and the Gungan leader gives transportation to them. The Jedi head to the capital to warn Queen Amidala about the invasion. However she has been captured by the Federation droids but the Jedi rescue the queen and her court and they flee in a spacecraft that is damaged when they cross the blockade. They land on a desert planet and Qui-Gon Jinn goes to the town with Jar Jar, the droid R2-D2 and the queen's assistant Padmé to seek the necessary part for the spacecraft. When they find the component, they do not have money to buy it. But the slave boy Anakin Skywalker offers to dispute a race with his pod to raise the necessary money. Qui-Gon feels the Force in the boy and accepts his offer. Will the boy win the race? What will happen to Naboo? Will Queen Amidala be capable to convince the politicians to release her planet from the Trade Federation? While the ruthless Trade Federation ravage the peaceful planet of Naboo, Jedi Master Qui Gon Jinn and his apprentice Obi Wan Kenobi are sent to rescue and protect the young Queen Amidala, who is determined to convince the Senate to help her restore peace to her home. Escaping to the planet Tatooine, the Jedi come across an eager slave boy named Anakin Skywalker who dreams of becoming a Jedi. What they don't know however is that they are being used in a sinister plot by the mysterious Sith, hiding deep in the shadows. When the evil Trade Federation plots to take over the peaceful planet of Naboo, Jedi warrior Qui-Gon Jinn and his apprentice Obi-Wan Kenobi embark on an amazing adventure to save the planet. With them on their journey is the young Queen Ami",
        "movie_genre": "Science Fiction"
    },
    {
        "movie_id": "tt0086190",
        "movie_title": "Star Wars: Episode VI - Return of the Jedi",
        "movie_poster": "https://m.media-amazon.com/images/M/MV5BOWZlMjFiYzgtMTUzNC00Y2IzLTk1NTMtZmNhMTczNTk0ODk1XkEyXkFqcGdeQXVyNTAyODkwOQ@@.jpg",
        "movie_storyLines": "After a daring mission to rescue Han Solo from Jabba the Hutt, the Rebels dispatch to Endor to destroy the second Death Star. Meanwhile, Luke struggles to help Darth Vader back from the dark side without falling into the Emperor's trap. Luke Skywalker battles Jabba the Hutt and Darth Vader to save his comrades in the Rebel Alliance and triumph over the Galactic Empire. Han Solo and Princess Leia reaffirm their love, and team with Chewbacca, Lando Calrissian, the Ewoks, and droids C-3PO and R2-D2 to aid in the disruption of the Dark Side, and the defeat of the evil emperor. Emperor Palpatine, Darth Vader, and the Empire are building a new Death Star. Meanwhile, Han Solo has been imprisoned, and Luke Skywalker has sent R2-D2 and C-3PO to try and free him. Princess Leia, disguised as a bounty hunter, and Chewbacca go along as well. The final battle takes place on the Forest Moon of Endor, with its natural inhabitants, the Ewoks, lending a hand to the rebels. As the evil Emperor Palpatine oversees the construction of the new Death Star by Darth Vader and the Galactic Empire, smuggler Han Solo is rescued from the clutches of the vile gangster Jabba the Hutt by his friends, Luke Skywalker, Princess Leia, Lando Calrissian, and Chewbacca. Leaving Luke Skywalker Jedi training with Master Yoda, Solo returns to the Rebel fleet to prepare to complete his battle with the Empire. During the ensuing fighting, the newly returned Luke Skywalker is captured by Darth Vader. Light-sabers sparkle, the Millennium Falcon flashes through hyperspace, and creatures from all over the galaxy defy the Galactic Empire, in this stunning third chapter of the \"Star Wars\" saga. As the Rebels prepare to attack Emperor Palpatine's awesome new Death Star, Han Solo remains imprisoned by the loathsome outlaw Jabba the Hutt, who has also captured Princess Leia. Luke Skywalker rescues his friends, but he will not be a true Jedi Knight until he confronts Darth Vader again, who has sworn to win him over to the Dark Side of the Force. With old favorites like Chewbacca, Yoda, R2-D2, C-3PO, and Lando Calrissian, plus the small, but stalwart Ewoks. The Empire is more than halfway through construction of a new Death Star, almost twice as big, but more than twice as powerful. When completed, it will spell certain doom for Luke Skywalker and the rebels. Han Solo is a prisoner of crime lord Jabba the Hutt, and Princess Leia soon finds herself in the gangster's hands. Luke Skywalker, aided by C-3PO and R2-D2, makes his way into Jabba's palace, hoping to secure his friends' freedom. But Jabba has no intention of doing so, and tries to kill them all. After escaping from Jabba and the sands of Tatooine, they regroup with the rebel fleet, which is massing for an attack against the new satellite battle station at Endor. Lando Calrissian is pressed into action to lead the rebel fighter attack, while Han is put in charge of a group of soldiers to take out the shield generator protecting the Death Star. However, Luke Skywalker surrenders to Darth Vader's",
        "movie_genre": "Science Fiction"
    },
    {
        "movie_id": "tt0076759",
        "movie_title": "Star Wars: Episode IV - A New Hope",
        "movie_poster": "https://m.media-amazon.com/images/M/MV5BOTA5NjhiOTAtZWM0ZC00MWNhLThiMzEtZDFkOTk2OTU1ZDJkXkEyXkFqcGdeQXVyMTA4NDI1NTQx.jpg",
        "movie_storyLines": "Luke Skywalker joins forces with a Jedi Knight, a cocky pilot, a Wookiee and two droids to save the galaxy from the Empire's world-destroying battle station, while also attempting to rescue Princess Leia from the mysterious Darth Vader. The Imperial Forces, under orders from cruel Darth Vader, hold Princess Leia hostage in their efforts to quell the rebellion against the Galactic Empire. Luke Skywalker and Han Solo, captain of the Millennium Falcon, work together with the companionable droid duo R2-D2 and C-3PO to rescue the beautiful princess, help the Rebel Alliance and restore freedom and justice to the Galaxy. Part IV in George Lucas' epic, this movie opens with a rebel ship being boarded by the tyrannical Darth Vader. The plot then follows the life of a simple farm boy, Luke Skywalker, as he and his newly met allies (Han Solo, Chewbacca, Obi-wan Kenobi, C-3PO, R2-D2) attempt to rescue a rebel leader, Princess Leia, from the clutches of the Empire. The conclusion is culminated as the rebels, including Skywalker and flying ace Wedge Antilles make an attack on the Empire's most powerful and ominous weapon, the Death Star. Luke Skywalker stays with his aunt and uncle on a farm on Tatooine. He is desperate to get off this planet and get to the Academy like his friends, but his uncle needs him for the next harvest. Meanwhile, an evil emperor has taken over the galaxy, and has constructed a formidable \"Death Star\" capable of destroying whole planets. Princess Leia, a leader in the resistance movement, acquires plans of the Death Star, places them in R2-D2, a droid, and sends him off to find Obi-wan Kenobi. Before he finds him, R2-D2 ends up on the Skywalkers' farm with his friend C-3PO. R2-D2 then wanders into the desert, and when Luke follows, they eventually come across Obi-wan. Will Luke, Obi-wan, and the two droids be able to destroy the Death Star, or will the Emperor rule forever? Princess Leia is held hostage by the evil forces of the Galactic Empire in their effort to take over the galaxy. Venturesome Luke Skywalker and dashing Captain Han Solo team together with the lovable robotic duo, R2-D2 and C-3PO, to rescue the beautiful Princess Leia and restore justice in the galaxy. In a distant galaxy eons before the creation of the planet known as Earth, vast civilizations have evolved, and ruling the galaxy is an interstellar Empire created from the ruins of an Old Republic that held sway for generations. It is a time of civil war, as solar systems have broken away from the Empire and are waging a war of rebellion. During a recent battle, technical schematics for a gigantic space station, code named the Death Star, have been unearthed by rebel spies, and a young woman who is a dissident member of the Imperial Senate, under the cover of a diplomatic mission to the planet Alderaan, is trying to smuggle these plans to the rebellion. But her spacecraft is attacked by a vast warship of the Empire and seized. The dissident Senator is captured, but the plans for the Death Star are nowhere to be found",
        "movie_genre": "Science Fiction"
    },
    {
        "movie_id": "tt1821658",
        "movie_title": "The Nut Job",
        "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTQ1NjAxMDUzN15BMl5BanBnXkFtZTgwOTE5NDM3MDE@.jpg",
        "movie_storyLines": "An incorrigibly self-serving exiled squirrel finds himself helping his former park brethren survive by raiding a nut store, a location that also happens to be a front for a human gang's bank robbery. In a city park, Surly the Squirrel has finally gone too far with his latest caper . Now exiled, Surly and his rat buddy Buddy's collective nightmare on the streets ends when they discover a nut store to raid. With no other options, she arranges a deal to help in Surly's heist for the colony, even while Surly fully intends to betray it. However, there is more going on with the nut store being a front for bank robbers while Raccoon has his own agenda to ensure his own power. In the mayhem to come, Surly finds himself challenged in ways he never expected and discovering the real prize to treasure in this adventure. Surly is a squirrel who believes that the world is every man for himself, when his latest crime gets him kicked out of the park community, but what they don't know is that the joint is actually a hideout for criminals who plan to rob the bank next door, also unaware that raccoon, the park leader plans to destroy the nut heist to reclaim his power: with obstacles, surly must claim the nuts, stop the bank robbery, foil raccoon's plans and finally learn what life is really about. In the fictional town of Oakton City, a purple squirrel named Surly (Will Arnett) and his mute rat partner Buddy reside in Liberty Park where their thieving reputation has made them outcasts. A group of urban animals led by Raccoon (Liam Neeson) and his cardinal assistant are running low on food for winter. Red squirrel Andie (Katherine Heigl) and glory hogging gray squirrel Grayson (Brendan Fraser) compete with Surly and Buddy to scavenge from a peanut cart manned by Lucky (Scott Yaphe) and Fingers (James Rankin) who are casing a bank. The squirrels' efforts inadvertently end with the cart's propane tank exploding in the park after its cord was bitten by Fingers' pug Precious (Maya Rudolph). The runaway cart ends up destroying and burning the tree, where the animals store their food. Surly is banished and Buddy follows him..",
        "movie_genre": "Animation, Comedy"
    },
    {
        "movie_id": "tt0107290",
        "movie_title": "Jurassic Park",
        "movie_poster": "https://m.media-amazon.com/images/M/MV5BMjM2MDgxMDg0Nl5BMl5BanBnXkFtZTgwNTM2OTM5NDE@.jpg",
        "movie_storyLines": "A pragmatic paleontologist touring an almost complete theme park on an island in Central America is tasked with protecting a couple of kids after a power failure causes the park's cloned dinosaurs to run loose. Huge advancements in scientific technology have enabled a mogul to create an island full of living dinosaurs. John Hammond has invited four individuals, along with his two grandchildren, to join him at Jurassic Park. But will everything go according to plan? A park employee attempts to steal dinosaur embryos, critical security systems are shut down and it now becomes a race for survival with dinosaurs roaming freely over the island. On Isla Nublar, a new park has just been built with genetically engineered dinosaurs. Tragedy strikes when one of the workers is killed by a velociraptor. The founder of the park, John Hammond, (Sir Richard Attenborough) requests Paleontologist Dr. Alan Grant (Sam Neill) and his assistant, Dr. Ellie Sattler (Laura Dern) to come to the park and ensure that it is safe. Also joining them are Hammond's lawyer Donald Gennaro (Martin Ferrero) and chaotician Dr. Ian Malcolm (Jeff Goldblum). When they reach the island, they are amazed to discover that Hammond has created living dinosaurs. However, at the same time, they all have their doubts. Later, Hammond's grandchildren Lex and Tim (Ariana Richards and Joseph Mazzello) join the group in a tour of the park. Sattler leaves the tour to take care of an ill triceratops. Soon the power in the park is shut down by computer systems geek Dennis Nedry (Wayne Knight), who wishes to steal embryos from the park to sell to a secret buyer. In the process, many dinosaurs escape their paddocks, including the deadly Tyrannosaurus Rex, who, during a thunderstorm, escapes his paddock and attacks the children, and eats Gennaro. Malcolm is injured and Grant and the children are then lost in the park. Meanwhile, Hammond, Sattler, and the rest of the operations team learn that Nedry (who in the meantime has been killed) has locked up the computer system to cover his tracks. They attempt to get power back in the park in order to escape the island. After shutting down the system, then restoring it, the group realizes that velociraptors are also on the loose, and are now on the hunt for the visitors. Paleontologists Alan Grant and Ellie Sattler and mathematician Ian Malcolm are among a select group chosen to tour an island theme park populated by dinosaurs created from prehistoric DNA. While the park's mastermind, billionaire John Hammond, assures everyone that the facility is safe, they find out otherwise when various ferocious predators break free and go on the hunt. John Hammond--the visionary billionaire entrepreneur and founder of the bio-engineering company InGen---calls in three experts to witness the wonders of the first-ever dinosaur preserve and put the investors' minds at ease. But there, on the isolated island of Isla Nublar, the hand-picked visitors' wide-eyed excitement will soon turn into pure horror when a devastating malfunc",
        "movie_genre": "Adventure"
    },
    {
        "movie_id": "tt11067072",
        "movie_title": "Star Wars: The Last Jedi - Movie review (Spoiler section)",
        "movie_poster": "https://m.media-amazon.com/images/M/MV5BYjk3Y2NiNDMtZWM4Zi00ODllLWE5MTAtZWZjNjRmODczYjk2XkEyXkFqcGdeQXVyODE1OTI0Mjg@.jpg",
        "movie_storyLines": "It looks like we don't have any Plot Summaries for this title yet.  Be the first to contribute! Just click the \"Edit page\" button at the bottom of the page or learn more in the  .",
        "movie_genre": ""
    },
    {
        "movie_id": "tt1895587",
        "movie_title": "Spotlight",
        "movie_poster": "https://m.media-amazon.com/images/M/MV5BMjIyOTM5OTIzNV5BMl5BanBnXkFtZTgwMDkzODE2NjE@.jpg",
        "movie_storyLines": "The true story of how the Boston Globe uncovered the massive scandal of child molestation and cover-up within the local Catholic Archdiocese, shaking the entire Catholic Church to its core. When the Boston Globe's tenacious \"Spotlight\" team of reporters delves into allegations of abuse in the Catholic Church, their year-long investigation uncovers a decades-long cover-up at the highest levels of Boston's religious, legal, and government establishment, touching off a wave of revelations around the world. In existence since the 1970s, Spotlight is the investigative reporting unit of the Boston Globe. They can spend months or years on a single story, which they choose amongst themselves. As such, they are somewhat autonomous from the rest of the newspaper, only needing to report to their superior. As a rule, they are not to discuss their work with anyone else, whether it be other staff, friends and or family. In 2001, the four person team consisted of its editor   - Robby to his friends - and his team of three investigative journalists,  ,   and Matt Carroll. Robby reports to the assistant managing editor,  . Upon his arrival from his most recent position in Florida, Marty Baron, the newly appointed editor-in-chief. Mr. Baron requests Spotlight to place their current project on hold and dig deeper into a recent story written by fellow Globe reporter and columnist Eileen McNamara, regarding allegations against a Catholic priest of sexual abuse of a minor and what appears to be the subsequent cover-up by the head of the Archdiocese of Boston, Cardinal Bernard Law. They are at first hesitant to work on the story, seeing Baron as an outsider to Boston, he who doesn't understand what is important to locals. Baron's outsider status includes not being born and raised there, and not being Catholic (he being the Globe's first Jewish editor-in-chief). Spotlights first task is to see if they can get some court documents on the case unsealed, which means they will need a court order. The Church and its parishioners could falsely interpret this as The Globe suing the Catholic church. This could have major, negative consequences for The Globe due to the fact that a majority of their subscribers are Catholic. Robby and his team begin by speaking to lawyers who have or are working on alleged sexual abuse cases perpetrated by Catholic priests in and immediately surrounding Boston (those lawyers said including Eric MacLeish and  ), known victims (such as  , the head of the Survivors Network of those Abused by Priests (SNAP)) and insiders in the Catholic church. Through this investigation, they get wind that the problem is not contained to a couple of priests and few victims, in essence changing the focus from the priest(s) to the systemic problem of the Archdiocese not only covering up the abuse but in reality doing nothing to stop it and thus condoning it. Their goal is not only the end product of an important story, but making sure that the other major local newspapers, such as the Boston Herald, do not beat them ",
        "movie_genre": "Drama"
    },
    {
        "movie_id": "tt0327084",
        "movie_title": "Over the Hedge",
        "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTQwMTQxNTcwOF5BMl5BanBnXkFtZTcwMzQ1NzUzMQ@@.jpg",
        "movie_storyLines": "A scheming raccoon fools a mismatched family of forest creatures into helping him repay a debt of food, by invading the new suburban sprawl that popped up while they were hibernating...and learns a lesson about family himself. RJ, a raccoon who needs food, accidentally takes food from a hungry bear named Vincent and he wants his food to be found in exactly the same place in a week. He finally finds that an animal family, with a tortoise named Verne as their leader, could help him restore the food from the suburbia, the gateway to the good life. But little does RJ know, there is a woman who has recently hired an exterminator to try to hunt them down. Traveling raccoon con artist, RJ, arrives in a woods outside a human city in the Midwest, excited about the wonders that living near humans can bring hungry animals. What he finds, however, is an Amish-like community that is deathly afraid of humans, after their leader, Vern the tortoise (Shandling), has an encounter with human boys that terrifies him. Encouraged by RJ, however, the animals slowly venture over the hedge that separates them from the brand new suburban development that appeared over the winter while they were sleeping, and what RJ shows them is a whole new world where humans leave tin cans full of fish and other food in big canisters, ripe for the taking. As they get closer and closer to humans, however, their comfortable lives in the woods appears to be threatened... Upon waking up after hibernation, a group of forest animals discover that a tall hedge has appeared out of nowhere, half their forest is gone, they have little to no food left. While Verne, a nervous turtle who acts as leader, suggests they simply adapt, RJ the raccoon shows up and gives them another option: go over the hedge and get food from the humans! The other forest animals quickly give into RJ, sneaking into the human world to get all the food they can grab. What they don't know is that RJ is actually in debt to a hungry bear, who has given him one week to replenish his food supply, or RJ takes its place! RJ is a raccoon, specialist on finding and stealing food, as every raccoon in the world. During a night, RJ tries to steal all the food reserves of Vincent, a big bear, but the raccoon's ambition makes that all the food loot get lost. Vincent warns RJ that he'll should put back all his food when full moon comes, otherwise he will regret having stolen the food. Meanwhile, a group of animals headed by a cautious turtle, Verne, is worried because spring has come and there's not enough food for everyone. Verne tells that they will be fine eating plants and some bark. Later, they find that their wood has a frontier, formed by a giant bush. They're scared of crossing to the other side, where the suburbs exist. But RJ comes to the scene, telling that there's no danger in the suburbs, and that they will find all the food they want there. Nevertheless, Verne distrusts RJ, because he thinks that there's something suspicious about him, trying to convince the group that natur",
        "movie_genre": "Animation, Comedy"
    },
    {
        "movie_id": "tt0137523",
        "movie_title": "Fight Club",
        "movie_poster": "https://m.media-amazon.com/images/M/MV5BNDIzNDU0YzEtYzE5Ni00ZjlkLTk5ZjgtNjM3NWE4YzA3Nzk3XkEyXkFqcGdeQXVyMjUzOTY1NTc@.jpg",
        "movie_storyLines": "An insomniac office worker and a devil-may-care soap maker form an underground fight club that evolves into much more. A nameless first person narrator ( ) attends support groups in attempt to subdue his emotional state and relieve his insomniac state. When he meets Marla ( ), another fake attendee of support groups, his life seems to become a little more bearable. However when he associates himself with Tyler ( ) he is dragged into an underground fight club and soap making scheme. Together the two men spiral out of control and engage in competitive rivalry for love and power. A young man leads a pretty humdrum life assessing car crashes to determine if his automobile company should issue recalls to fix problems. He also suffers from insomnia and takes to attending group therapy sessions for people who have survived various diseases. There he meets Marla who like him attends these sessions though she is neither a victim nor a survivor. His life changes when he meets Tyler Durden on a flight home. Tyler seems to be everything that he's not and together they create a men-only group for bare-knuckle fighting. It soon becomes all the rage with fight clubs springing up across the country and the group itself becoming an anti-capitalist domestic terrorist organization. Tyler and Marla develop a relationship leaving him often on the outside of what is going on. He soon finds that the group is out of control and after a major self-revelation decides there is only one way out. An insomniac unnamed narrator needs a fantasy to escape from his deadly boring life, he tries joining a cancer support group however the only thing they do in the group is cry into each others chest, but then he is on a plane on his way back from what a viewer would assume is a business trip our unnamed narrator encounters Tyler Durden, a soap selling bad-ass who happens to run a secret fight club in the diner parking lot with his friend who follows 8 simple rules set out by Tyler, our unnamed narrator of course is taken into this scheme ran by Tyler. Posing as a pitiful sufferer during fruitless late-night sessions in highly addictive support groups for terminal illnesses, an unhappy insomniac struggles to find meaning in his mundane and dysfunctional existence. Then, a fateful encounter with the anarchist philosopher and travelling soap salesman, Tyler Durden, changes his life, as--for the first time in a long while--the bored white-collar worker reconnects with his inner self. Much to his surprise, the formerly depressed loner finds himself deriving pleasure out of pain through bare-knuckle brawls in the Fight Club: an underground society of men who yearn to free themselves from the fetters of a cruel modern life. Now, he is ready to wage war. Are violence and freedom the two sides of the same coin? Sick of his dead-end corporate career and disgusted with the empty consumer culture, a young man (Norton) and his devious friend (Pitt) create a new club where young men come to relieve their frustrations by beating each other to a p",
        "movie_genre": "Drama"
    },
    {
        "movie_id": "tt1436562",
        "movie_title": "Rio",
        "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTU2MDY3MzAzMl5BMl5BanBnXkFtZTcwMTg0NjM5NA@@.jpg",
        "movie_storyLines": "When Blu, a domesticated macaw from small-town Minnesota, meets the fiercely independent Jewel, he takes off on an adventure to Rio de Janeiro with the bird of his dreams. In Rio de Janeiro, baby macaw, Blu, is captured by dealers and smuggled to the USA. While driving through Moose Lake, Minnesota, the truck that is transporting Blu accidentally drops Blu's box on the road. A girl, Linda, finds the bird and raises him with love. Fifteen years later, Blu is a domesticated and intelligent bird that does not fly and lives a comfortable life with bookshop owner Linda. Out of the blue, clumsy Brazilian ornithologist, Tulio, visits Linda and explains that Blu is the last male of his species, and he has a female called Jewel in Rio de Janeiro. He invites Linda to bring Blu to Rio so that he and Jewel can save their species. Linda travels with Blu and Tulio to Rio de Janeiro and they leave Blu and Jewel in a large cage in the institute where Tulio works. While they are having dinner, smugglers break into the institute and steal Blu and Jewel to sell them. Linda and Tulio look everywhere for Blu, who is chained to Jewel and hidden in a slum. Meanwhile, Jewel and Blu escape from their captors and befriend a group of birds that help them to get rid of the chains. It is Carnival and the smugglers and mean cockatoo, Nigel, do not intend to give up Blu and Jewel, and chase the birds through the crowded streets. When Blu, a baby blue macaw that lives in Brazil, was captured by dealers and was smuggled to USA, a little girl named Linda decided to take care of him and it continues until they were adults. Unfortunately, because Blu was with Linda since he was little, he never learned to fly. And when an ornithologist named Tulio finds Blu and tells Linda that he is the last male of his kind, Tulio decided to bring Blu back to Brazil to breed with a female macaw named Jewel. But in the night Blu was captured again along with Jewel and must find his way back to Linda while trying to overcome his fear to learn how to fly with Jewel and a toucan, Rafael. By a tragic twist of fate, the bright-coloured blue macaw parrot, Blu, never had the chance to learn how to fly. Far away from sunny Brazil, Blu now lives in snow-covered Minnesota as the pet-friend of his human companion, Linda; however, as the last of his endangered species, the flightless bird will soon find himself in Rio de Janeiro to meet the last female of his kind--the feisty, Jewel. But, when calamity strikes again, and the feathery couple gets kidnapped, Blu must summon up the courage to finally believe in himself, if he wants to save his charming dream-girl. The question is, can he make it in time?",
        "movie_genre": "Animation/Adventure"
    },
    {
        "movie_id": "tt1606378",
        "movie_title": "A Good Day to Die Hard",
        "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTcwNzgyNzUzOV5BMl5BanBnXkFtZTcwMzAwOTA5OA@@.jpg",
        "movie_storyLines": "John McClane travels to Russia to help out his seemingly wayward son, Jack, only to discover that Jack is a CIA operative working undercover, causing the father and son to team up against underworld forces. Iconoclastic, take-no-prisoners cop John McClane, for the first time, finds himself on foreign soil after traveling to Moscow to help his wayward son Jack - unaware that Jack is really a highly-trained CIA operative out to stop a nuclear weapons heist. With the Russian underworld in pursuit, and battling a countdown to war, the two McClanes discover that their opposing methods make them unstoppable heroes. John McClane learns that his son Jack, whom he hasn't spoken to in years, is in Russia and was arrested for killing someone. When the Russian prosecutor talks to Jack he claims to have information that could help convict a man named Komarov who is going to be tried. McClane arrives and proceeds to the Russian courthouse where Komarov's going to be tried. When he arrives there's an explosion that levels the courthouse. Jack takes Komarov and they escape, McClane shows up and Jack is not happy to see him. The men who bomb the courthouse chase Jack. McClane follows and helps Jack. Jack then picks him up then they go somewhere, where McClane discovers that Jack is a spy and he was suppose to get Komarov because it seems he has evidence against a corrupt Russian official who was behind the bombing. When he agrees to give them the evidence in exchange for his freedom and daughter's, the men find them. So McClane and Jack have to get the evidence and get out of Russia. When they go to meet the man's daughter, McClane senses something is not right. New York City cop John McClane arrives in Moscow to track down his estranged son, Jack. McClane thinks his son is a criminal, so it comes as a shock when he learns that Jack is actually working undercover to protect Komarov, a Russian government whistleblower. With their own lives on the line, McClane and Jack must overcome their differences in order to get Komarov to safety and thwart a potentially disastrous crime in the Chernobyl region. In Moscow, Viktor Chagarin, a high-ranking, but corrupt, Russian official plans to incriminate former billionaire and government whistle-blower Yuri Komarov in an imminent rigged trial unless Komarov hands over a secret file believed to contain evidence incriminating Chagarin. Separately, Jack McClane, who has been arrested after an assassination attempt, negotiates for a shorter sentence by offering to testify against Komarov. Meanwhile, Jack's father, NYPD Detective John McClane, who has not been in touch with his son for several years, has learned his son is in trouble and, taken to the airport by his daughter Lucy McClane, flies to Russia to help. As John arrives and approaches the courthouse where Komarov is on trial, a bomb explosion, orchestrated by Chagarin's henchman Alik, occurs in the courthouse and Jack breaks free with Komarov. Seeing his son, John confronts him, but their dispute is cut short as Alik and",
        "movie_genre": "Action"
    },
    {
        "movie_id": "tt1853728",
        "movie_title": "Django Unchained",
        "movie_poster": "https://m.media-amazon.com/images/M/MV5BMjIyNTQ5NjQ1OV5BMl5BanBnXkFtZTcwODg1MDU4OA@@.jpg",
        "movie_storyLines": "With the help of a German bounty-hunter, a freed slave sets out to rescue his wife from a brutal plantation-owner in Mississippi. In 1858, a bounty-hunter named King Schultz seeks out a slave named Django and buys him because he needs him to find some men he is looking for. After finding them, Django wants to find his wife, Broomhilda, who along with him were sold separately by his former owner for trying to escape. Schultz offers to help him if he chooses to stay with him and be his partner. Eventually they learn that she was sold to a plantation in Mississippi. Knowing they can't just go in and say they want her, they come up with a plan so that the owner will welcome them into his home and they can find a way. In 1858, in Texas, the former German dentist Dr. King Schultz meets the slave Django in a lonely road while being transported by the slavers Speck Brothers. He asks if Django knows the Brittle Brothers and with the affirmative, he buys Django for him. Then Dr. Schultz tells that he is a bounty-hunter chasing John, Ellis and Roger Brittle and proposes a deal to Django: if he helps him, he would give his freedom, a horse and US$ 75.00 for him. Django accepts the deal and Dr. Schultz trains him to be his deputy. They kill the brothers in Daughtray and Django tells that he would use the money to buy the freedom of his wife Broomhilda, who is a slave that speaks German. Dr. Schultz proposes another deal to Django: if he teams-up with him during the winter, he would give one-third of the rewards and help him to rescue Broomhilda. Django accepts his new deal and they become friends. After the winter, Dr. Schultz goes to Gatlinburgh and learns that Broomhilda was sold to the ruthless Calvin Candie von Shaft, who lives in the Candyland Farm, in Mississippi. Dr. Schultz plots a scheme with Django to lure Calvin and rescue Broomhilda from him. But his cruel minion Stephen is not easily fooled. In the late 1850's, former dentist turned bounty-hunter Dr. King Schultz buys the freedom of a man named Django from a slave trader duo in a quest to find and kill some men he wants dead. Afterwards, Django sets out with help from Schultz to find and rescue his wife Broomhilda who like him was sold into slavery by an anonymous owner. Their journey takes them to a plantation called Candieland, owned by a ruthless tycoon. Also, they come to some suspicions of the head slave named Stephen. Two years before the Civil War pits brother-against-brother, German-born bounty-hunter Dr. King Schultz (Academy Award-winner Christoph Waltz) arrives in America determined to capture the outlaw Brittle brothers dead or alive. In the midst of his search, Dr. Schultz crosses paths with Django (Academy Award-winner Jamie Foxx), a freed slave and skilled tracker who seeks to rescue his beloved wife Broomhilda (Kerry Washington) from ruthless plantation-owner Calvin Candie (Academy Award-nominee Leonardo DiCaprio). Once Django has aided Dr. Schultz in coral ling the Brittle brothers, the two team up to capture some of the most wa",
        "movie_genre": "Western"
    },
    {
        "movie_id": "tt0482571",
        "movie_title": "The Prestige",
        "movie_poster": "https://m.media-amazon.com/images/M/MV5BMjA4NDI0MTIxNF5BMl5BanBnXkFtZTYwNTM0MzY2.jpg",
        "movie_storyLines": "After a tragic accident, two stage magicians in 1890s London engage in a battle to create the ultimate illusion while sacrificing everything they have to outwit each other. In the end of the nineteenth century, in London, Robert Angier, his beloved wife Julia McCullough, and Alfred Borden are friends and assistants of a magician. When Julia accidentally dies during a performance, Robert blames Alfred for her death, and they become enemies. Both become famous and rival magicians, sabotaging the performance of the other on the stage. When Alfred performs a successful trick, Robert becomes obsessed trying to disclose the secret of his competitor with tragic consequences. Set in London in the 1800s, two rival magicians read each others diary containing the secrets of their magic tricks and personal life. As we go back in time when the diaries were written, both magicians become obsessed with their rival's best trick. The tricks, as shown to the audience, look the same, but neither magician can figure out how his opponent does it. Two magicians, who used to be partners, battle over years in order to create a flawless method for the ultimate disappearing trick, \"the Transported Man\", turns into an informal war between them, and soon, they will do anything to be able to preform the trick sooner and better than the other; which as time passes makes their friends and loved ones get away from them, and little-by-little destroys their lives until they eventually succeed to preform the trick, each by a very different way. In nineteenth century London, illusionist Alfred Borden is on trial for the murder of fellow illusionist, Robert Angier. Borden's indictment is largely possible because of the eyewitness account of John Cutter, who saw Borden backstage in the area where Angier was killed. At the end of one of his shows, Angier fell through a trap door in the stage floor into a clear water-filled tank below, that tank which was a prop for one of Angier's tricks performed earlier in the show. Angier ended up drowning, as the tank was locked after he fell into it. Borden, Angier, and Cutter have a shared largely turbulent history, which also provides motive. Early in their magic careers, both Borden and Angier worked under \"Milton the Magician\", while Angier's wife Julia worked as his on-stage assistant, and Cutter as his ingénieur, staging the tricks and providing the apparatus required, work that he still does for others. Based on a specific incident during this stage of their relationship led to both Borden and Angier striking out, creating their own shows, and them having a feud, which was not only in the professional realm, but a personal one, where each man wanted to ruin the other. While Borden is arguably more accomplished in the technical aspects of the illusions, Angier is the more accomplished showman. In the professional realm, they tried to outdo each other, especially in the illusions considered either the most dangerous and/or mysterious, those two being catching-the-bullet trick, and more so, ",
        "movie_genre": "Drama"
    },
    {
        "movie_id": "tt0120784",
        "movie_title": "Payback",
        "movie_poster": "https://m.media-amazon.com/images/M/MV5BN2YxYTUyMTItYmU4ZS00OTIzLWIwMWQtMDY3NzRiMmIyMWMxXkEyXkFqcGdeQXVyMTQxNzMzNDI@.jpg",
        "movie_storyLines": "After a successful heist, Porter is left for dead. Once he recovers, he seeks vengeance and wants his share of the money. Porter is bad, but his neighbours are worse. Street-wise and tough, an ex-marine, he is betrayed by a one-time partner, and shot in the back by his junkie wife. He survives and returns, looking to recover his share from the robbery of an Asian crime gang. The money has passed into the hands of \"the Outfit\", a slick gangster organisation that runs the city. He has to make his way through a world populated by heroin dealers, prostitutes, sado-masochists, gunmen and crooked cops, a place where torture is a way of life. His only friend is a former employer, a prostitute, and her loyalty is in question, given she now works for the Outfit. He makes good early progress, but then falls into the hands of Fairfax, the crime boss. Val Resnick and Porter, two small time bandits, hit a Chinese gang together and manage to get $140,000. But Val Resnick needs 130 grand alone to buy himself back into his syndication. So, Val turns on Porter together with Porter's wife Lynn, who kills him with two shots in the back. But Porter survives and half a year later, he is back, seeking his share of $70,000. When he finally finds Val, Porter quickly learns that he has to go much further up the ladder in order to get his money from the guys who have it: The syndication. Working alone can't be realized any more, so Porter teams up with his flame and previous boss Rosie, a very exclusive prostitute. Together, they now start playing the teams against each other. Porter is a super-bad guy who is so despicable that he would steal a pan-handler's money and take a waitress' tip. He is quickly shown to keep even worst company though as his friend and junkie wife join together to kill him after a robbery from an Oriental gang. Nonetheless, he recovers after being gunned in the back by his wife. He then sets out for revenge against his \"friend\", who used the money to buy his way into the \"Syndicate\". This means he also has to to take on the Syndicate bosses which include, in line, Carter, Justin Fairfax, and Bronson. Meanwhile, crooked cops also come after him trying to get their share of what they believe is a big load of money related to drugs, the Oriental gang seeks revenge against the robbers, and a crooked little middle man tries to get his own piece. Porter is a small time but tough criminal, who's primary gig, is robbery. Now his friend Val Resnick needs $130,000 to pay back a criminal group known as \"The Outfit\". He tells Porter about some Asian couriers who carry $300,000, Porter agrees to it on the condition that they split the take. When they hit them, they discover that they only have $140,000, and Resnick says that, that's what they always carry. He pulls out a gun and shoots Porter in the back and leaves him to die. However, Porter manages to make it to a doctor, and get treated, when he recovers, he sets out to get Resnick and his share $70,000. He begins by approaching an associate of Resnick's. ",
        "movie_genre": "Action"
    },
    {
        "movie_id": "tt2872732",
        "movie_title": "Lucy",
        "movie_poster": "https://m.media-amazon.com/images/M/MV5BODcxMzY3ODY1NF5BMl5BanBnXkFtZTgwNzg1NDY4MTE@.jpg",
        "movie_storyLines": "A woman, accidentally caught in a dark deal, turns the tables on her captors and transforms into a merciless warrior evolved beyond human logic. It was supposed to be a simple job. All Lucy had to do was deliver a mysterious briefcase to Mr. Jang. But immediately Lucy is caught up in a nightmarish deal where she is captured and turned into a drug mule for a new and powerful synthetic drug. When the bag she is carrying inside of her stomach leaks, Lucy's body undergoes unimaginable changes that begins to unlock her mind's full potential. With her new-found powers, Lucy turns into a merciless warrior intent on getting back at her captors. She receives invaluable help from Professor Norman, the leading authority on the human mind, and French police captain Pierre Del Rio. The American Lucy is studying in Taiwan and is dating Richard that she met at a nightclub. When Richard has a briefcase to deliver to the mysterious Korean Mr. Jang, he tricks Lucy and cuffs her to the briefcase. Lucy has no other option but to meet Mr. Jang, who is a dangerous drug lord that kills Richard. Lucy discovers that the briefcase contains the synthetic drug CPH4 and she is forced to work to Mr. Jang as drug mule with three other men and transport the drug to Europe hidden in their abdomens. However one of her captors kicks her in the abdomen and releases the CPH4 in her body. Soon Lucy enhances her brain capacity and develops her physical and mental capabilities. She uses her abilities to kill the criminals and flees. However her power does not stop increasing and is destroying Lucy that needs to use more CPH4 to stabilize her body. She contacts Professor Norman, who is an authority in brain capacity, and the scientist becomes her hope to save her. But Mr. Jang wants to retrieve his drug and is hunting Lucy down. Lucy is a smart, college student who finds herself in a horrific drug and human trafficking situation where her brain is permanently altered by an illegal new drug that gets accidentally ingested during her captivity. When she gets a kick to her abdomen, the drug starts to leak into her body, and she begins using more than 10% of her brain and finds that she has less than 24-48 hours to live. She finds the one neuro-scientist and professor who can help capture her super brain phenomenon for the world, before the villains kill her in the process. Unlucky Lucy, a twenty-four-year-old American student in Taipei, finds herself coerced into working as a drug mule for Taiwan's most dangerous man: the powerful Korean drug lord, Mr Jang. Having no other choice, Lucy is unwillingly subjected to a quick operation, where a synthetic, highly experimental drug is implanted inside her lower abdomen to transport it in Europe. However, when the potent blue chemical leaks into her bloodstream, the lethal dose will initiate a mind-boggling development of her cerebral activity, unlocking extraordinary skills, and unfathomable abilities that extend past the typical 10% of brain use. More and more, Lucy's superpowers grow stronger ",
        "movie_genre": "Action"
    },
    {
        "movie_id": "tt2908446",
        "movie_title": "The Divergent Series: Insurgent",
        "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTgxOTYxMTg3OF5BMl5BanBnXkFtZTgwMDgyMzA2NDE@.jpg",
        "movie_storyLines": "Beatrice Prior must confront her inner demons and continue her fight against a powerful alliance which threatens to tear her society apart with the help from others on her side. As she searches for allies and answers in the wake of the uprising, Tris and Four are on the run. Being hunted by Jeanine Matthews, the leader of the Erudite faction, Tris and Four will race against time as they try to figure out what Abnegation sacrificed their lives to protect, and why the Erudite leaders will do anything to stop them. Haunted by her past choices but desperate to protect the ones she loves, Tris faces one impossible challenge after another as she unlocks the truth about the past and ultimately the future of her world. INSURGENT raises the stakes for Tris as she searches for allies and answers in the ruins of a futuristic Chicago. Tris (Woodley) and Four (James) are now fugitives on the run, hunted by Jeanine (Winslet), the leader of the power-hungry Erudite elite. Racing against time, they must find out what Tris's family sacrificed their lives to protect, and why the Erudite leaders will do anything to stop them. Haunted by her past choices but desperate to protect the ones she loves, Tris, with Four at her side, faces one impossible challenge after another as they unlock the truth about the past and ultimately the future of their world. Tris, Four, and her remaining allies are on the run from ruthless Jean Matthews, and her Erudite faction, where they take refuge at the Amity stronghold. While there, Tris learns that the Erudite are gaining power and decides that she must fight with her inner fears and decide what to do to protect her home. Insurgent This movie is a sci-fi, action and drama movie based on a book by Veronica Roth, about a girl who is running with her boyfriend and brother from the enemy, while unleashing new secrets about her family's past and her mysterious Divergence. Sixteen-year-old Tris Prior ( ) lives in a society divided into five factions. Each faction represents a different way of handling things. Erudite are the intelligent. Candor the honest. Abnegation the selfless. Amity the kind. Dauntless the brave. The Erudite have declared war against Abnegation, because they believe that they have important information about the Divergent, who are apparently dangerous for the faction-system. Haunted by her past, Tris must make choices that will change her. While running with her boyfriend Four ( )and her brother Caleb( ) from Erudite, who want to find her, because of her abnormal brain functioning. She and Four seek shelter in various faction headquarters with other Dauntless who have chosen to fight against Erudite's self-proclaimed, smug, superiority. Dauntless are plotting against Erudite, with other allies until Erudite begins to kill people if Tris doesn't sacrifice herself. Again, Tris must confront her inner demons and make a choice that may change everything. What she doesn't realize is that if she sacrificed herself the world they know may change forever. Five days after the",
        "movie_genre": "Science Fiction"
    },
    {
        "movie_id": "tt0816711",
        "movie_title": "World War Z",
        "movie_poster": "https://m.media-amazon.com/images/M/MV5BNDQ4YzFmNzktMmM5ZC00MDZjLTk1OTktNDE2ODE4YjM2MjJjXkEyXkFqcGdeQXVyNTA4NzY1MzY@.jpg",
        "movie_storyLines": "Former United Nations employee Gerry Lane traverses the world in a race against time to stop a zombie pandemic that is toppling armies and governments and threatens to destroy humanity itself. Life for former United Nations investigator Gerry Lane and his family seems content. Suddenly, the world is plagued by a mysterious infection turning whole human populations into rampaging mindless zombies. After barely escaping the chaos, Lane is persuaded to go on a mission to investigate this disease. What follows is a perilous trek around the world where Lane must brave horrific dangers and long odds to find answers before human civilization falls. When former U.N. investigator Gerry Lane and his family get stuck in urban gridlock, he senses that it's no ordinary traffic jam. His suspicions are confirmed when, suddenly, the city erupts into chaos. A lethal virus, spread through a single bite, is turning healthy people into something vicious, unthinking and feral. As the pandemic threatens to consume humanity, Gerry leads a worldwide search to find the source of the infection and, with luck, a halt to it's spread. A virulent and unprecedented pandemic of global proportions which turns humans into rabid flesh-eating zombies takes the world by surprise. Under these circumstances, the retired United Nations special agent, Gerry Lane, must leave behind a peaceful family life, a wife and two daughters, to escort a team of scientists on a mission to find a cure, navigating through zombie-swarmed cities. However, as the deadly pathogen obliterates entire areas, incessantly giving birth to diseased masses of freshly-reanimated undead, the frail hope of finding a viable solution starts drifting away. Does humanity have enough time to wait for a miracle? Having retired as U.N. investigator, Gerry Lane devotes his time to wife Karin and their wining brat daughter Constance and Rachel in Philadelphia, until it becomes the next site of a globally spreading mystery epidemic turning bitten people into rabies-like zombies. His clueless former chief, deputy secretary general Thierry Umutoni, recalls him to the UN emergency team, thus offering the whole family a spot aboard the safe air carrier. Gerry joins though army veterans on reconnaissance to Korea, where a rogue CIA agent's suggestion proves worthless, then to Israel, where a Mossad 'contrarious tenth man' had the foresight to respond to a vague Indian pandemic threat by erecting a wall Jerusalem, only to see an undead flood overtake it. His last minute escape flight must deal drastically with an infected passenger before crashing in Cardiff, near a WHO research facility, where he combines and tests a daring out of the box 'camouflage' strategy inspired by weir observations. Retired U.N. investigator Gerry Lane (Brad Pitt) and his family are sitting in what appears to be a typical Philadelphia traffic jam when helicopters began to circle ominously overhead and an explosion throws the city into panic. In the blink of an eye, the streets are consumed by chaos. When ",
        "movie_genre": "Action-Horror"
    },
    {
        "movie_id": "tt2283362",
        "movie_title": "Jumanji: Welcome to the Jungle",
        "movie_poster": "https://m.media-amazon.com/images/M/MV5BODQ0NDhjYWItYTMxZi00NTk2LWIzNDEtOWZiYWYxZjc2MTgxXkEyXkFqcGdeQXVyMTQxNzMzNDI@.jpg",
        "movie_storyLines": "Four teenagers are sucked into a magical video game, and the only way they can escape is to work together to finish the game. In a brand-new Jumanji adventure, four high-school kids discover an old video-game console and are drawn into the game's jungle setting, literally becoming the adult avatars they chose. What they discover is that you don't just play Jumanji--you must survive it. To beat the game and return to the real world, they must go on the most dangerous adventure of their lives, discover what Alan Parrish left 20 years ago, and change the way they think about themselves --or they'll be stuck in the game forever, to be played by others without break. Jumanji, the magical board game and ancient portal to its fearsome and savage jungles, gets an upgrade, this time luring four teens into its realm when one of them stumbles upon an old-school video-game console. Inevitably, as the unwitting players transform into their chosen game avatars inside a mysterious new world crawling with formidable adversaries, they'll need to put their newly-acquired skills to good use to finally complete the game. The deep sound of the feral drums is incessant. Can the quirky quartet return to the physical world in one piece? When 4 high schoolers are sucked into the video game, jumanji, they soon find out that they each have special capabilities. They must use these capabilities to complete the challenges to escape jumanji, with a certain amount of lives and new bodies to handle, will these four teens band together to escape? Or will they be stuck in jumanji, forever! Four teens are transported into the video game Jumanji. They now have new bodies, complete with unique strengths and weaknesses. They also have a mission: retrieve a precious gem from an evil warlord and return it to the statue from which it came. If they can't do this, they'll never leave the game. In 1996 Brantford, New Hampshire, teenager Alex Vreeke is given the Jumanji board game by his father, who found it on a beach. Uninterested, he sets the game aside. That night, it transforms into a video-game cartridge that catches Alex's attention when the Jumanji drumbeats awaken him. When he begins playing it, he disappears into the game. 20 years later, four students at Brantford High are sentenced to detention: Spence Gilpin and his former friend Anthony \"Fridge\" Johnson for cheating, Bethany Walker for making a phone call during an English test, and Martha Kaply for refusing to participate in gym class and insulting her teacher. In the school basement, where they are serving their detention, Fridge discovers Alex's discarded video-game system, and he and Spencer decide to play. Although it has five playable characters, they are unable to select the first one, so they choose two others, and convince the girls to play as the remaining two. When Spencer presses \"Start\", they are transported into the game.",
        "movie_genre": "Adventure"
    }
]