[{"movie_id": "tt2872732", "movie_title": "Lucy", "movie_poster": "https://m.media-amazon.com/images/M/MV5BODcxMzY3ODY1NF5BMl5BanBnXkFtZTgwNzg1NDY4MTE@.jpg", "movie_storyLines": "A woman, accidentally caught in a dark deal, turns the tables on her captors and transforms into a merciless warrior evolved beyond human logic. It was supposed to be a simple job. All Lucy had to do was deliver a mysterious briefcase to Mr. Jang. But immediately Lucy is caught up in a nightmarish deal where she is captured and turned into a drug mule for a new and powerful synthetic drug. When the bag she is carrying inside of her stomach leaks, Lucy's body undergoes unimaginable changes that begins to unlock her mind's full potential. With her new-found powers, Lucy turns into a merciless warrior intent on getting back at her captors. She receives invaluable help from Professor Norman, the leading authority on the human mind, and French police captain Pierre Del Rio. The American Lucy is studying in Taiwan and is dating Richard that she met at a nightclub. When Richard has a briefcase to deliver to the mysterious Korean Mr. Jang, he tricks Lucy and cuffs her to the briefcase. Lucy has no other option but to meet Mr. Jang, who is a dangerous drug lord that kills Richard. Lucy discovers that the briefcase contains the synthetic drug CPH4 and she is forced to work to Mr. Jang as drug mule with three other men and transport the drug to Europe hidden in their abdomens. However one of her captors kicks her in the abdomen and releases the CPH4 in her body. Soon Lucy enhances her brain capacity and develops her physical and mental capabilities. She uses her abilities to kill the criminals and flees. However her power does not stop increasing and is destroying Lucy that needs to use more CPH4 to stabilize her body. She contacts Professor Norman, who is an authority in brain capacity, and the scientist becomes her hope to save her. But Mr. Jang wants to retrieve his drug and is hunting Lucy down. Lucy is a smart, college student who finds herself in a horrific drug and human trafficking situation where her brain is permanently altered by an illegal new drug that gets accidentally ingested during her captivity. When she gets a kick to her abdomen, the drug starts to leak into her body, and she begins using more than 10% of her brain and finds that she has less than 24-48 hours to live. She finds the one neuro-scientist and professor who can help capture her super brain phenomenon for the world, before the villains kill her in the process. Unlucky Lucy, a twenty-four-year-old American student in Taipei, finds herself coerced into working as a drug mule for Taiwan's most dangerous man: the powerful Korean drug lord, Mr Jang. Having no other choice, Lucy is unwillingly subjected to a quick operation, where a synthetic, highly experimental drug is implanted inside her lower abdomen to transport it in Europe. However, when the potent blue chemical leaks into her bloodstream, the lethal dose will initiate a mind-boggling development of her cerebral activity, unlocking extraordinary skills, and unfathomable abilities that extend past the typical 10% of brain use. More and more, Lucy's superpowers grow stronger ", "movie_genre": "Action"}, {"movie_id": "tt2908446", "movie_title": "The Divergent Series: Insurgent", "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTgxOTYxMTg3OF5BMl5BanBnXkFtZTgwMDgyMzA2NDE@.jpg", "movie_storyLines": "Beatrice Prior must confront her inner demons and continue her fight against a powerful alliance which threatens to tear her society apart with the help from others on her side. As she searches for allies and answers in the wake of the uprising, Tris and Four are on the run. Being hunted by Jeanine Matthews, the leader of the Erudite faction, Tris and Four will race against time as they try to figure out what Abnegation sacrificed their lives to protect, and why the Erudite leaders will do anything to stop them. Haunted by her past choices but desperate to protect the ones she loves, Tris faces one impossible challenge after another as she unlocks the truth about the past and ultimately the future of her world. INSURGENT raises the stakes for Tris as she searches for allies and answers in the ruins of a futuristic Chicago. Tris (Woodley) and Four (James) are now fugitives on the run, hunted by Jeanine (Winslet), the leader of the power-hungry Erudite elite. Racing against time, they must find out what Tris's family sacrificed their lives to protect, and why the Erudite leaders will do anything to stop them. Haunted by her past choices but desperate to protect the ones she loves, Tris, with Four at her side, faces one impossible challenge after another as they unlock the truth about the past and ultimately the future of their world. Tris, Four, and her remaining allies are on the run from ruthless Jean Matthews, and her Erudite faction, where they take refuge at the Amity stronghold. While there, Tris learns that the Erudite are gaining power and decides that she must fight with her inner fears and decide what to do to protect her home. Insurgent This movie is a sci-fi, action and drama movie based on a book by Veronica Roth, about a girl who is running with her boyfriend and brother from the enemy, while unleashing new secrets about her family's past and her mysterious Divergence. Sixteen-year-old Tris Prior ( ) lives in a society divided into five factions. Each faction represents a different way of handling things. Erudite are the intelligent. Candor the honest. Abnegation the selfless. Amity the kind. Dauntless the brave. The Erudite have declared war against Abnegation, because they believe that they have important information about the Divergent, who are apparently dangerous for the faction-system. Haunted by her past, Tris must make choices that will change her. While running with her boyfriend Four ( )and her brother Caleb( ) from Erudite, who want to find her, because of her abnormal brain functioning. She and Four seek shelter in various faction headquarters with other Dauntless who have chosen to fight against Erudite's self-proclaimed, smug, superiority. Dauntless are plotting against Erudite, with other allies until Erudite begins to kill people if Tris doesn't sacrifice herself. Again, Tris must confront her inner demons and make a choice that may change everything. What she doesn't realize is that if she sacrificed herself the world they know may change forever. Five days after the", "movie_genre": "Science Fiction"}, {"movie_id": "tt0816711", "movie_title": "World War Z", "movie_poster": "https://m.media-amazon.com/images/M/MV5BNDQ4YzFmNzktMmM5ZC00MDZjLTk1OTktNDE2ODE4YjM2MjJjXkEyXkFqcGdeQXVyNTA4NzY1MzY@.jpg", "movie_storyLines": "Former United Nations employee Gerry Lane traverses the world in a race against time to stop a zombie pandemic that is toppling armies and governments and threatens to destroy humanity itself. Life for former United Nations investigator Gerry Lane and his family seems content. Suddenly, the world is plagued by a mysterious infection turning whole human populations into rampaging mindless zombies. After barely escaping the chaos, Lane is persuaded to go on a mission to investigate this disease. What follows is a perilous trek around the world where Lane must brave horrific dangers and long odds to find answers before human civilization falls. When former U.N. investigator Gerry Lane and his family get stuck in urban gridlock, he senses that it's no ordinary traffic jam. His suspicions are confirmed when, suddenly, the city erupts into chaos. A lethal virus, spread through a single bite, is turning healthy people into something vicious, unthinking and feral. As the pandemic threatens to consume humanity, Gerry leads a worldwide search to find the source of the infection and, with luck, a halt to it's spread. A virulent and unprecedented pandemic of global proportions which turns humans into rabid flesh-eating zombies takes the world by surprise. Under these circumstances, the retired United Nations special agent, Gerry Lane, must leave behind a peaceful family life, a wife and two daughters, to escort a team of scientists on a mission to find a cure, navigating through zombie-swarmed cities. However, as the deadly pathogen obliterates entire areas, incessantly giving birth to diseased masses of freshly-reanimated undead, the frail hope of finding a viable solution starts drifting away. Does humanity have enough time to wait for a miracle? Having retired as U.N. investigator, Gerry Lane devotes his time to wife Karin and their wining brat daughter Constance and Rachel in Philadelphia, until it becomes the next site of a globally spreading mystery epidemic turning bitten people into rabies-like zombies. His clueless former chief, deputy secretary general Thierry Umutoni, recalls him to the UN emergency team, thus offering the whole family a spot aboard the safe air carrier. Gerry joins though army veterans on reconnaissance to Korea, where a rogue CIA agent's suggestion proves worthless, then to Israel, where a Mossad 'contrarious tenth man' had the foresight to respond to a vague Indian pandemic threat by erecting a wall Jerusalem, only to see an undead flood overtake it. His last minute escape flight must deal drastically with an infected passenger before crashing in Cardiff, near a WHO research facility, where he combines and tests a daring out of the box 'camouflage' strategy inspired by weir observations. Retired U.N. investigator Gerry Lane (Brad Pitt) and his family are sitting in what appears to be a typical Philadelphia traffic jam when helicopters began to circle ominously overhead and an explosion throws the city into panic. In the blink of an eye, the streets are consumed by chaos. When ", "movie_genre": "Action-Horror"}, {"movie_id": "tt2283362", "movie_title": "Jumanji: Welcome to the Jungle", "movie_poster": "https://m.media-amazon.com/images/M/MV5BODQ0NDhjYWItYTMxZi00NTk2LWIzNDEtOWZiYWYxZjc2MTgxXkEyXkFqcGdeQXVyMTQxNzMzNDI@.jpg", "movie_storyLines": "Four teenagers are sucked into a magical video game, and the only way they can escape is to work together to finish the game. In a brand-new Jumanji adventure, four high-school kids discover an old video-game console and are drawn into the game's jungle setting, literally becoming the adult avatars they chose. What they discover is that you don't just play Jumanji--you must survive it. To beat the game and return to the real world, they must go on the most dangerous adventure of their lives, discover what Alan Parrish left 20 years ago, and change the way they think about themselves --or they'll be stuck in the game forever, to be played by others without break. Jumanji, the magical board game and ancient portal to its fearsome and savage jungles, gets an upgrade, this time luring four teens into its realm when one of them stumbles upon an old-school video-game console. Inevitably, as the unwitting players transform into their chosen game avatars inside a mysterious new world crawling with formidable adversaries, they'll need to put their newly-acquired skills to good use to finally complete the game. The deep sound of the feral drums is incessant. Can the quirky quartet return to the physical world in one piece? When 4 high schoolers are sucked into the video game, jumanji, they soon find out that they each have special capabilities. They must use these capabilities to complete the challenges to escape jumanji, with a certain amount of lives and new bodies to handle, will these four teens band together to escape? Or will they be stuck in jumanji, forever! Four teens are transported into the video game Jumanji. They now have new bodies, complete with unique strengths and weaknesses. They also have a mission: retrieve a precious gem from an evil warlord and return it to the statue from which it came. If they can't do this, they'll never leave the game. In 1996 Brantford, New Hampshire, teenager Alex Vreeke is given the Jumanji board game by his father, who found it on a beach. Uninterested, he sets the game aside. That night, it transforms into a video-game cartridge that catches Alex's attention when the Jumanji drumbeats awaken him. When he begins playing it, he disappears into the game. 20 years later, four students at Brantford High are sentenced to detention: Spence Gilpin and his former friend Anthony \"Fridge\" Johnson for cheating, Bethany Walker for making a phone call during an English test, and Martha Kaply for refusing to participate in gym class and insulting her teacher. In the school basement, where they are serving their detention, Fridge discovers Alex's discarded video-game system, and he and Spencer decide to play. Although it has five playable characters, they are unable to select the first one, so they choose two others, and convince the girls to play as the remaining two. When Spencer presses \"Start\", they are transported into the game.", "movie_genre": "Adventure"}]
