[{
    "movie_id": "tt4587656",
    "movie_title": "The Star",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTU4MDQ4NTM2N15BMl5BanBnXkFtZTgwNDM1NTIzMzI@.jpg",
    "movie_storyLines": "A small but brave donkey and his animal friends become the unsung heroes of the first Christmas. In Sony Pictures Animation's THE STAR, a small but brave donkey named Bo yearns for a life beyond his daily grind at the village mill. One day he finds the courage to break free, and finally goes on the adventure of his dreams. On his journey, he teams up with Ruth, a lovable sheep who has lost her flock and Dave, a dove with lofty aspirations. Along with three wisecracking camels and some eccentric stable animals, Bo and his new friends follow the Star and become accidental heroes in the greatest story ever told - the first Christmas. From the Creators of Miracles from Heaven and Cloudy with a Chance of Meatballs comes the story about a donkey named Bo who wants life beyond his village. He meets a sheep named Ruth and a dove named Dave and they follow the Star to discover the first Christmas which is the birth of Jesus. In \"9 months B.C.\", Mary is visited by an angel telling her she will bear the Messiah. A pygmy named Abby overhears and tells the other animals as a star begins glowing brightly in the night. Six months later, a young donkey is tired of milling wheat and wishes to join a traveling caravan so that he may feel important. An older donkey helps him escape the miller who owns them and he ends up with an injured ankle at the house of Joseph and Mary who just celebrated their wedding. Mary takes the donkey in and names him Boaz, or Bo, and reveals to Joseph that she is pregnant, with Joseph accepting Mary's situation after praying to God. During this time, Bo and his dove friend Dave, plot to escape despite Mary's kindness, but end up staying three more months..",
    "movie_genre": "Religious Drama"
},
{
    "movie_id": "tt0492389",
    "movie_title": "Furry Vengeance",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMjM5Mzg5NjA0Nl5BMl5BanBnXkFtZTcwMjg3MDEyMw@@.jpg",
    "movie_storyLines": "In the Oregon wilderness, a real-estate developer's new housing subdivision faces a unique group of protestors: local woodland creatures who don't want their homes disturbed. Hoping to make enough money through an overseas employer to live comfortably, Real Estate Developer Dan Sanders manages to convince his son, Tyler, and wife, Tammy, to re-locate in a remote corner of Oregon. Tyler does seem content after he meets with lovely Amber, but Tammy is concerned about her husband when he near-hysterically claims that local creatures, including beavers, ravens, bears, fox, etc. have joined forces to sabotage his project. Dan Sanders is land developer whose boss treats him like dirt. He made Dan move his family to Oregon to oversee a project. His son resents him for making him move there. But when his son meets a girl named Amber, he sees a ray of sunshine but she doesn't approve of what his father is doing. When Dan does something to one of the forest animals, the animals led by a raccoon decide to get back at him. And when Dan tells everyone what's happening to him they don't believe him. But his son does some research and learns that this is not first time this has happened to someone who encroaches on their territory. But Dan decides to ignore it.",
    "movie_genre": "Adventure"
}
,
{
    "movie_id": "tt0093773",
    "movie_title": "Predator",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BY2QwYmFmZTEtNzY2Mi00ZWMyLWEwY2YtMGIyNGZjMWExOWEyXkEyXkFqcGdeQXVyNjUwNzk3NDc@.jpg",
    "movie_storyLines": "A team of commandos on a mission in a Central American jungle find themselves hunted by an extraterrestrial warrior. A team of special force ops, led by a tough but fair soldier, Major \"Dutch\" Schaefer, are ordered to assist CIA man, Colonel Al Dillon, on a rescue mission for potential survivors of a Helicopter downed over remote South American jungle. Not long after they land, Dutch and his team discover that they have been sent in under false pretenses. This deception turns out to be the least of their worries though, when they find themselves being methodically hunted by something not of this world. Assigned to locate a Central American cabinet minister and eliminate the region's scattered guerrillas, battle-hardened Major Alan \"Dutch\" Schaefer leads his hand-picked squad of elite commandos into the jungle. However, they are unaware that an unidentified interstellar spacecraft has landed near them. Now, an otherwise routine rescue mission turns into a bloodbath, as ritualistically mutilated bodies found at the scene give away only one thing: someone, or perhaps something, is hunting them for sport. When Dutch attempts to confront the extraterrestrial tracker with his combat experience, he discovers their primitive weapons are no match for the creature's state-of-the-art weaponry. Does the outgunned and outmatched squad stand a chance against the ultimate hunter, the Predator? Dutch and his group of commandos are assigned to rescue downed airmen from guerillas in a Central American jungle. The mission goes well but as they return they find that something is hunting them. Nearly invisible, it blends in with the forest, taking trophies from the bodies of its victims as it goes along. Occasionally seeing through its eyes, the audience sees it is an intelligent alien hunter, hunting them for sport, killing them off one at a time. Dutch and a team of commandos have been sent into a Central American jungle to track down some missing airmen that were kidnapped by terrorists. By the time they get to the camp, the airmen have been butchered in a very violent fashion and the commandos retaliate on the terrorists' camp. After that's over, they wait for a helicopter to pick them up, but something strange begins to happen in the woods. It isn't long before the commandos start getting killed off and Dutch and a girl from the camp, Anna, are the only people left and fighting for their lives. But what they discover is too shocking for them to imagine. What's been killing them is the Predator, an alien that hunts rare species and make his trophies out of their skulls. And human beings are the new species he has discovered.",
    "movie_genre": "Action-Adventure"
},

{
    "movie_id": "tt0327084",
    "movie_title": "Over the Hedge",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTQwMTQxNTcwOF5BMl5BanBnXkFtZTcwMzQ1NzUzMQ@@.jpg",
    "movie_storyLines": "A scheming raccoon fools a mismatched family of forest creatures into helping him repay a debt of food, by invading the new suburban sprawl that popped up while they were hibernating...and learns a lesson about family himself. RJ, a raccoon who needs food, accidentally takes food from a hungry bear named Vincent and he wants his food to be found in exactly the same place in a week. He finally finds that an animal family, with a tortoise named Verne as their leader, could help him restore the food from the suburbia, the gateway to the good life. But little does RJ know, there is a woman who has recently hired an exterminator to try to hunt them down. Traveling raccoon con artist, RJ, arrives in a woods outside a human city in the Midwest, excited about the wonders that living near humans can bring hungry animals. What he finds, however, is an Amish-like community that is deathly afraid of humans, after their leader, Vern the tortoise (Shandling), has an encounter with human boys that terrifies him. Encouraged by RJ, however, the animals slowly venture over the hedge that separates them from the brand new suburban development that appeared over the winter while they were sleeping, and what RJ shows them is a whole new world where humans leave tin cans full of fish and other food in big canisters, ripe for the taking. As they get closer and closer to humans, however, their comfortable lives in the woods appears to be threatened... Upon waking up after hibernation, a group of forest animals discover that a tall hedge has appeared out of nowhere, half their forest is gone, they have little to no food left. While Verne, a nervous turtle who acts as leader, suggests they simply adapt, RJ the raccoon shows up and gives them another option: go over the hedge and get food from the humans! The other forest animals quickly give into RJ, sneaking into the human world to get all the food they can grab. What they don't know is that RJ is actually in debt to a hungry bear, who has given him one week to replenish his food supply, or RJ takes its place! RJ is a raccoon, specialist on finding and stealing food, as every raccoon in the world. During a night, RJ tries to steal all the food reserves of Vincent, a big bear, but the raccoon's ambition makes that all the food loot get lost. Vincent warns RJ that he'll should put back all his food when full moon comes, otherwise he will regret having stolen the food. Meanwhile, a group of animals headed by a cautious turtle, Verne, is worried because spring has come and there's not enough food for everyone. Verne tells that they will be fine eating plants and some bark. Later, they find that their wood has a frontier, formed by a giant bush. They're scared of crossing to the other side, where the suburbs exist. But RJ comes to the scene, telling that there's no danger in the suburbs, and that they will find all the food they want there. Nevertheless, Verne distrusts RJ, because he thinks that there's something suspicious about him, trying to convince the group that natur",
    "movie_genre": "Animation, Comedy"
}
,
{
    "movie_id": "tt8706598",
    "movie_title": "The Hitman's Bodyguard: The Hitman vs. The Bodyguard",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BYWUwNjA0Y2UtYWM4Zi00ZWE5LTkyYzUtYzZlOGQxOTViZGEwXkEyXkFqcGdeQXVyMTY1MTcxMzc@.jpg",
    "movie_storyLines": "Ryan Reynolds and Samuel L. Jackson star as an elite bodyguard and renowned hit man who is forced to work together. In order to succeed, they don't just have to avoid getting killed, they have to avoid killing each other.",
    "movie_genre": "Action-Comedy"
},
{
    "movie_id": "tt11067072",
    "movie_title": "Star Wars: The Last Jedi - Movie review (Spoiler section)",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BYjk3Y2NiNDMtZWM4Zi00ODllLWE5MTAtZWZjNjRmODczYjk2XkEyXkFqcGdeQXVyODE1OTI0Mjg@.jpg",
    "movie_storyLines": "It looks like we don't have any Plot Summaries for this title yet.  Be the first to contribute! Just click the \"Edit page\" button at the bottom of the page or learn more in the  .",
    "movie_genre": ""
},
{
    "movie_id": "tt1821658",
    "movie_title": "The Nut Job",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTQ1NjAxMDUzN15BMl5BanBnXkFtZTgwOTE5NDM3MDE@.jpg",
    "movie_storyLines": "An incorrigibly self-serving exiled squirrel finds himself helping his former park brethren survive by raiding a nut store, a location that also happens to be a front for a human gang's bank robbery. In a city park, Surly the Squirrel has finally gone too far with his latest caper . Now exiled, Surly and his rat buddy Buddy's collective nightmare on the streets ends when they discover a nut store to raid. With no other options, she arranges a deal to help in Surly's heist for the colony, even while Surly fully intends to betray it. However, there is more going on with the nut store being a front for bank robbers while Raccoon has his own agenda to ensure his own power. In the mayhem to come, Surly finds himself challenged in ways he never expected and discovering the real prize to treasure in this adventure. Surly is a squirrel who believes that the world is every man for himself, when his latest crime gets him kicked out of the park community, but what they don't know is that the joint is actually a hideout for criminals who plan to rob the bank next door, also unaware that raccoon, the park leader plans to destroy the nut heist to reclaim his power: with obstacles, surly must claim the nuts, stop the bank robbery, foil raccoon's plans and finally learn what life is really about. In the fictional town of Oakton City, a purple squirrel named Surly (Will Arnett) and his mute rat partner Buddy reside in Liberty Park where their thieving reputation has made them outcasts. A group of urban animals led by Raccoon (Liam Neeson) and his cardinal assistant are running low on food for winter. Red squirrel Andie (Katherine Heigl) and glory hogging gray squirrel Grayson (Brendan Fraser) compete with Surly and Buddy to scavenge from a peanut cart manned by Lucky (Scott Yaphe) and Fingers (James Rankin) who are casing a bank. The squirrels' efforts inadvertently end with the cart's propane tank exploding in the park after its cord was bitten by Fingers' pug Precious (Maya Rudolph). The runaway cart ends up destroying and burning the tree, where the animals store their food. Surly is banished and Buddy follows him..",
    "movie_genre": "Animation, Comedy"
},
{
    "movie_id": "tt0102975",
    "movie_title": "Star Trek VI: The Undiscovered Country",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BYzJiZDdmODQtMDM0Yi00ZTcwLWJjMjItM2QxOWJjZDdmYmQ5XkEyXkFqcGdeQXVyMjUzOTY1NTc@.jpg",
    "movie_storyLines": "On the eve of retirement, Kirk and McCoy are charged with assassinating the Klingon High Chancellor and imprisoned. The Enterprise crew must help them escape to thwart a conspiracy aimed at sabotaging the last best hope for peace. After an explosion on their moon, the Klingons have an estimated 50 years before their ozone layer is completely depleted, and they all die. They have only one choice - to make peace with the Federation, which will mean an end to 70 years of conflict. Captain James T. Kirk and crew are called upon to help in the negotiations because of their experience with the Klingons. Peace talks don't quite proceed, and Kirk and McCoy are convicted of assassinating the Klingon High Chancellor, and imprisoned on Rura Penthe, a snowy hard-labor prison camp. Will they manage to escape? And will there ever be peace with the Klingons? After a lunar cataclysm brings the Klingons to their knees, the foreign concept of peace with the Federation may be finally within reach. After 70 years of hostility, the Federation and the Klingon Empire prepare for a peace summit. Ironically, Captain James T. Kirk has been assigned as the first emissary to broker that peace. However, the prospect of intergalactic glasnost with sworn enemies is an alarming one. When the Klingon flagship is attacked and the USS Enterprise is held accountable, the dogs of war are unleashed again, as both worlds brace for what may be their final, deadly encounter.",
    "movie_genre": ""
},
{
    "movie_id": "tt1436562",
    "movie_title": "Rio",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTU2MDY3MzAzMl5BMl5BanBnXkFtZTcwMTg0NjM5NA@@.jpg",
    "movie_storyLines": "When Blu, a domesticated macaw from small-town Minnesota, meets the fiercely independent Jewel, he takes off on an adventure to Rio de Janeiro with the bird of his dreams. In Rio de Janeiro, baby macaw, Blu, is captured by dealers and smuggled to the USA. While driving through Moose Lake, Minnesota, the truck that is transporting Blu accidentally drops Blu's box on the road. A girl, Linda, finds the bird and raises him with love. Fifteen years later, Blu is a domesticated and intelligent bird that does not fly and lives a comfortable life with bookshop owner Linda. Out of the blue, clumsy Brazilian ornithologist, Tulio, visits Linda and explains that Blu is the last male of his species, and he has a female called Jewel in Rio de Janeiro. He invites Linda to bring Blu to Rio so that he and Jewel can save their species. Linda travels with Blu and Tulio to Rio de Janeiro and they leave Blu and Jewel in a large cage in the institute where Tulio works. While they are having dinner, smugglers break into the institute and steal Blu and Jewel to sell them. Linda and Tulio look everywhere for Blu, who is chained to Jewel and hidden in a slum. Meanwhile, Jewel and Blu escape from their captors and befriend a group of birds that help them to get rid of the chains. It is Carnival and the smugglers and mean cockatoo, Nigel, do not intend to give up Blu and Jewel, and chase the birds through the crowded streets. When Blu, a baby blue macaw that lives in Brazil, was captured by dealers and was smuggled to USA, a little girl named Linda decided to take care of him and it continues until they were adults. Unfortunately, because Blu was with Linda since he was little, he never learned to fly. And when an ornithologist named Tulio finds Blu and tells Linda that he is the last male of his kind, Tulio decided to bring Blu back to Brazil to breed with a female macaw named Jewel. But in the night Blu was captured again along with Jewel and must find his way back to Linda while trying to overcome his fear to learn how to fly with Jewel and a toucan, Rafael. By a tragic twist of fate, the bright-coloured blue macaw parrot, Blu, never had the chance to learn how to fly. Far away from sunny Brazil, Blu now lives in snow-covered Minnesota as the pet-friend of his human companion, Linda; however, as the last of his endangered species, the flightless bird will soon find himself in Rio de Janeiro to meet the last female of his kind--the feisty, Jewel. But, when calamity strikes again, and the feathery couple gets kidnapped, Blu must summon up the courage to finally believe in himself, if he wants to save his charming dream-girl. The question is, can he make it in time?",
    "movie_genre": "Animation/Adventure"
},
{
    "movie_id": "tt1130884",
    "movie_title": "Shutter Island",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BYzhiNDkyNzktNTZmYS00ZTBkLTk2MDAtM2U0YjU1MzgxZjgzXkEyXkFqcGdeQXVyMTMxODk2OTU@.jpg",
    "movie_storyLines": "In 1954, a U.S. Marshal investigates the disappearance of a murderer who escaped from a hospital for the criminally insane. In 1954, up-and-coming U.S. marshal Teddy Daniels is assigned to investigate the disappearance of a patient from Boston's Shutter Island Ashecliffe Hospital. He's been pushing for an assignment on the island for personal reasons, but before long he thinks he's been brought there as part of a twisted plot by hospital doctors whose radical treatments range from unethical to illegal to downright sinister. Teddy's shrewd investigating skills soon provide a promising lead, but the hospital refuses him access to records he suspects would break the case wide open. As a hurricane cuts off communication with the mainland, more dangerous criminals \"escape\" in the confusion, and the puzzling, improbable clues multiply, Teddy begins to doubt everything - his memory, his partner, even his own sanity. Federal Marshall Teddy Daniels and his new partner Chuck Aule travel to a government-run institution for the criminally insane on Shutter Island, near Boston, when there is a report that a prisoner has gone missing. Daniels, weighed down with his own baggage, has his own reasons for wanting to get to the island. He is still traumatized from what he saw when his army unit liberated one of the Nazi concentration camps at the end of World War II, and still haunted by his wife's more-recent death in a fire. The head of the hospital, Dr. John Cawley, treats him decently, but others give the agents a cooler reception. Daniels particularly wants to find out what goes on in the ward that's reserved for the most serious offenders. As he begins to peel away the layers of deceit, it becomes obvious that not all is as it seems. Assigned the thorny task of investigating the incomprehensible disappearance of a deranged child-murderess, troubled U.S. Marshal Teddy Daniels and his new partner, Chuck Aule, travel to Ashecliffe Hospital: Shutter Island's impregnable asylum for the criminally insane. Soon, within the dark purgatory's thick stone walls, indescribable nuances of medical malpractice suggest that the institution's cryptic senior psychiatrists must be hiding something. Then, a raging tempest traps patients and investigators alike in the dark off-shore prison, triggering Teddy's crippling migraines and gruesome flashbacks of a haunting past. Is the already perplexed detective losing his grip on reality? In 1954, Federal Marshal Teddy Daniels and his new partner Chuck Aule travel from Seattle to Shutter Island to investigate the disappearance of a patient there, Rachel Solando. She had been sectioned at the institution for dangerous criminals at Ashcliffe Hospital because she drowned her three kids. Teddy is a veteran WWII soldier, traumatized by the war experience in the liberation of the Dachau concentration camp and the loss of his beloved wife in a criminal fire. Teddy is unable to access the records of employees and patients and feels that the management by the Federal facility are obstructing ",
    "movie_genre": "Psychological Thriller"
},

{
    "movie_id": "tt21832076",
    "movie_title": "The Hobbit: The Battle of the Five Armies - Extended Edition Scenes",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BZGI4ZjA4MTEtY2ExYy00ZTg5LWFhMTctODI3OTY2OWU2ZWRjXkEyXkFqcGdeQXVyMTEwNDU1MzEy.jpg",
    "movie_storyLines": "Extended scenes from 'The Hobbit: The Battle of the Five Armies'.",
    "movie_genre": "Action/Adventure"
},
{
    "movie_id": "tt20235400",
    "movie_title": "Talking the Orville",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BNDc2Yjc3Y2EtMDkwNS00YjNlLWIwZGItOGI5ZGNiOTlmNWE1XkEyXkFqcGdeQXVyMjEwNDA5Mzk@.jpg",
    "movie_storyLines": "Talking The Orville is the #1 source for everything going on in the 25th century. Celebrate Seth MacFarlane's sci-fi, space series, The Orville, with your fellow fans.",
    "movie_genre": "Comedy"
},
{
    "movie_id": "tt0372784",
    "movie_title": "Batman Begins",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BOTY4YjI2N2MtYmFlMC00ZjcyLTg3YjEtMDQyM2ZjYzQ5YWFkXkEyXkFqcGdeQXVyMTQxNzMzNDI@.jpg",
    "movie_storyLines": "After training with his mentor, Batman begins his fight to free crime-ridden Gotham City from corruption. When his parents are killed, billionaire playboy Bruce Wayne relocates to Asia, where he is mentored by Henri Ducard and Ra's Al Ghul in how to fight evil. When learning about the plan to wipe out evil in Gotham City by Ducard, Bruce prevents this plan from getting any further and heads back to his home. Back in his original surroundings, Bruce adopts the image of a bat to strike fear into the criminals and the corrupt as the icon known as \"Batman\". But it doesn't stay quiet for long. As a child, a young Bruce Wayne witnesses the death of his parents at the hands of a crazed criminal. As an adult, Bruce travels the world seeking the means to fight injustice. He lives amongst the boroughs of criminals and thieves in central Asia. Eventually, he meets a mysterious figure named Ra's Al Guhl and joins his gang called the League of Shadows. Using his training, he is able to defeat his trainer. Finally meeting up with his estate caretaker Alfred Pennyworth, Bruce Wayne returns to Gotham. There, he becomes the new head of Wayne Enterprises. Together, with the help of the C.E.O. of the Wayne Enterprises Applied Sciences division, a man name Lucius Fox, he dons a new persona: Batman. As Batman takes on the criminals and organized crime underworld of Gotham, a sinister new underbelly of the city is exposed, and a new class of criminal is born. Will Batman be the one to stop them all, or does Gotham need a hero with a face? Bruce Wayne, who experiences the death of his parents at a very young age, relocates to Asia and trains with his mentors, Henri Ducard and Ra's Al Ghul in fighting injustice. He returns to a crime-ridden Gotham and with the help of his old butler and estate caretaker, Alfred, the C.E.O. of Wayne Enterprises Applied Science Division Lucius Fox, he dons a new persona, Batman, to strike fear into the hearts of the criminals and the corrupt. With the help of rising cop Gordon, and the Assistant District Attorney, and Bruce's love interest Rachel Dawes, he is able to take down the Mafia Don Falcone, and the twisted doctor/drug dealer Jonathan Crane a.k.a. The Scarecrow. With Ra's Al Ghul's return with his evil plan to destroy Gotham by inducing fear into the hearts of the people, Batman must defeat his mentor once again so as to bring peace in Gotham. As a boy, a young Bruce Wayne watched in horror as his millionaire parents were slain in front of his eyes, a trauma which led him to become obsessed with revenge, but his chance is cruelly taken away from him by fate. After disappearing to the East where he seeks counsel with the dangerous but honorable ninja cult leader known as Ra's Al-Ghul, he returns to his now decaying Gotham City overrun by organized crime and dangerous individuals manipulating the system while the company he inherited is slowly being pulled out from under him. The discovery of a cave under his mansion, and a prototype armored suit leads him to take on a new persona,",
    "movie_genre": "Action-Adventure"
},
{
    "movie_id": "tt1515091",
    "movie_title": "Sherlock Holmes: A Game of Shadows",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMTQwMzQ5Njk1MF5BMl5BanBnXkFtZTcwNjIxNzIxNw@@.jpg",
    "movie_storyLines": "Detective Sherlock Holmes is on the trail of criminal mastermind Professor Moriarty, who is carrying out a string of random crimes across Europe. With Dr. John Watson about to marry and end their partnership, a disconsolate Sherlock Holmes occupies his time investigating the schemes of his archenemy, Professor James Moriarty. However, when Moriarty warns that he considers the Watsons a legitimate target for his retaliation against the detective, Holmes must save them and get John involved in one last case. To do so, they join the Roma lady Madam Simza Heron's quest to find her missing brother, Renee, who may be the key to defeating Moriarty. Together, the trio find themselves involved in a dangerous international conspiracy led by the Napoleon of Crime in which the fate of all of Europe hangs in the balance. Sherlock Holmes is investigating terrorist attacks in London alone since his old partner Dr. John Watson will get married a few days later with Mary. His investigations point to Professor James Moriarty as the person responsible for the explosions. When Dr. Watson and Mary are attacked in the train while traveling for their honeymoon in Brighton, Holmes delivers Mary to the protection of his brother Mycroft. Soon Holmes and Dr. Watson disclose that Professor Moriarty has bought arms and ammunition factories and is trying to start a war in Europe killing political leaders and politicians. Now Sherlock and Watson have to stop Moriarty and his dangerous associate, the skilled former Colonel Sebastian Moran to avoid the imminent war. Against the backdrop of global unrest, shortly after the nearly supernatural events in  , the keenly observant detective and artist of deduction, Sherlock Holmes, along with his loyal comrade-in-arms, Dr Watson, find themselves drawn deeper and deeper into a sinister international conspiracy. As war closes in on 1891 Europe, a faint trail of breadcrumbs leads Sherlock to the cryptic Romani fortune-teller, Madame Simza Heron, and an unexpected but diabolical adversary: the mathematical genius and long-time arch-nemesis, Professor James Moriarty. Now, before the criminal mastermind's elaborate web of murder, no one is safe; especially those close to Holmes and Watson. Can the intrepid duo prevent collateral damage? Is the world prepared for Moriarty's sinister game of shadows? Sherlock Holmes, a now established master artist of deduction, is to take on his biggest challenge yet; navigating mysteries without the companion of his best friend, Dr. Watson, for he is getting married and decides to retire. As Holmes traverses a new web of atrocious crimes across 1891 Europe, he eventually traces it all back to the evil mastermind James Moriarty. With everyone around them being in grave danger, Holmes and Watson join forces for one last mystery. Are they prepared for Moriarty's sinister game of shadows, or are they but puppets he will skillfully play on their strings?",
    "movie_genre": "Action-Adventure"
},
{
    "movie_id": "tt5273612",
    "movie_title": "Furious 7: Tower Jumps",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BYTcxYTRhNjItYjJlNy00NTYyLTg4MjQtZGRiYjcxMGRhY2FkXkEyXkFqcGdeQXVyMjQ5NjgwMjA@.jpg",
    "movie_storyLines": "This piece focuses on another of the film's signature car stunt scenes.",
    "movie_genre": "Action"
},
{
    "movie_id": "tt0120784",
    "movie_title": "Payback",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BN2YxYTUyMTItYmU4ZS00OTIzLWIwMWQtMDY3NzRiMmIyMWMxXkEyXkFqcGdeQXVyMTQxNzMzNDI@.jpg",
    "movie_storyLines": "After a successful heist, Porter is left for dead. Once he recovers, he seeks vengeance and wants his share of the money. Porter is bad, but his neighbours are worse. Street-wise and tough, an ex-marine, he is betrayed by a one-time partner, and shot in the back by his junkie wife. He survives and returns, looking to recover his share from the robbery of an Asian crime gang. The money has passed into the hands of \"the Outfit\", a slick gangster organisation that runs the city. He has to make his way through a world populated by heroin dealers, prostitutes, sado-masochists, gunmen and crooked cops, a place where torture is a way of life. His only friend is a former employer, a prostitute, and her loyalty is in question, given she now works for the Outfit. He makes good early progress, but then falls into the hands of Fairfax, the crime boss. Val Resnick and Porter, two small time bandits, hit a Chinese gang together and manage to get $140,000. But Val Resnick needs 130 grand alone to buy himself back into his syndication. So, Val turns on Porter together with Porter's wife Lynn, who kills him with two shots in the back. But Porter survives and half a year later, he is back, seeking his share of $70,000. When he finally finds Val, Porter quickly learns that he has to go much further up the ladder in order to get his money from the guys who have it: The syndication. Working alone can't be realized any more, so Porter teams up with his flame and previous boss Rosie, a very exclusive prostitute. Together, they now start playing the teams against each other. Porter is a super-bad guy who is so despicable that he would steal a pan-handler's money and take a waitress' tip. He is quickly shown to keep even worst company though as his friend and junkie wife join together to kill him after a robbery from an Oriental gang. Nonetheless, he recovers after being gunned in the back by his wife. He then sets out for revenge against his \"friend\", who used the money to buy his way into the \"Syndicate\". This means he also has to to take on the Syndicate bosses which include, in line, Carter, Justin Fairfax, and Bronson. Meanwhile, crooked cops also come after him trying to get their share of what they believe is a big load of money related to drugs, the Oriental gang seeks revenge against the robbers, and a crooked little middle man tries to get his own piece. Porter is a small time but tough criminal, who's primary gig, is robbery. Now his friend Val Resnick needs $130,000 to pay back a criminal group known as \"The Outfit\". He tells Porter about some Asian couriers who carry $300,000, Porter agrees to it on the condition that they split the take. When they hit them, they discover that they only have $140,000, and Resnick says that, that's what they always carry. He pulls out a gun and shoots Porter in the back and leaves him to die. However, Porter manages to make it to a doctor, and get treated, when he recovers, he sets out to get Resnick and his share $70,000. He begins by approaching an associate of Resnick's. ",
    "movie_genre": "Action"
},
{
    "movie_id": "tt15179648",
    "movie_title": "It Wants Blood 2",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BZDFhMzRlYjgtN2IxMC00MzJkLTljNmYtOTlhMjYxOTM4NjYzXkEyXkFqcGdeQXVyODg5ODI3MzQ@.jpg",
    "movie_storyLines": "Two giant monsters are forced to battle head to head on the political circuit as they run against each other for a seat in the Senate.",
    "movie_genre": "Comedy"
},
{
    "movie_id": "tt4154756",
    "movie_title": "Avengers: Infinity War",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BMjMxNjY2MDU1OV5BMl5BanBnXkFtZTgwNzY1MTUwNTM@.jpg",
    "movie_storyLines": "The Avengers and their allies must be willing to sacrifice all in an attempt to defeat the powerful Thanos before his blitz of devastation and ruin puts an end to the universe. As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment, the fate of Earth and existence has never been more uncertain. Now that Earth has put its mark on the universe through the Avengers, all superheroes, including ones from other parts of the Galaxy, must join forces to stop the powerful Thanos from taking all the infinity stones and destroying the universe one planet at a time. The mad titan Thanos (Josh Brolin) begins his hunt for the most powerful objects in the universe, the Infinity Stones, in this movie. With the Space Stone, given by Loki (Tom Hiddleston), and the Power Stone, Thanos sends (Ebony Maw, Cull Obsidian to retrieve the Time Stone from Doctor Strange (Benedict Cumberbatch), sends Proxima Midnight, and Corvus Glaive) to retrieve the Mind Stone from Vision (Paul Bettany). Meanwhile, Tony Stark (Robert Downey, Jr.) meets up with Bruce Banner (Mark Ruffalo) and sorcerers Doctor Strange (Benedict Cumberbatch) and Wong (Benedict Wong). With help from Peter Parker/Spider-Man (Tom Holland), Stark and Strange join forces together and agree to stop Thanos. In space, Thor (Chris Hemsworth) also joins forces with the Guardians of the Galaxy, Star-Lord (Chris Pratt), Drax (Dave Bautista), Rocket (Bradley Cooper), Groot (Vin Diesel), Mantis (Pom Klementieff), and Gamora (Zoe Saldana), the daughter of Thanos who warns Thor of his power. Thor travels away to defeat Thanos with Rocket and Groot, while the other Guardians join forces with Stark, Strange, and Parker. In Wakanda, Steve Rogers (Chris Evans) and his team, Black Widow (Scarlett Johansson), Falcon (Anthony Mackie), Scarlet Witch (Elizabeth Olsen), War Machine (Don Cheadle), and Bruce Banner to protect Vision and the Mind Stone in his forehead. With protection given from King T'Challa/Black Panther (Chadwick Boseman), and his Wakandan army, Thanos will come for everyone to destroy half the universe. Two years after the Leipzig fight and immediately following the destruction of Asgard, the Avengers and the Guardians of the Galaxy learn that the Mad Titan Thanos is seeking to collect the Infinity Stones, which are said to be the most powerful artifacts in the universe. Facing an enemy too powerful to stop alone, the Avengers and the Guardians, alongside Doctor Strange, Black Panther, and Spider-Man must come together and stop Thanos from inflicting his power and destroying the universe. The mad titan Thanos has begun his quest to obtain all six Infinity Stones, which will give him the power to wipe out ha",
    "movie_genre": "Superhero"
},
{
    "movie_id": "tt0816711",
    "movie_title": "World War Z",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BNDQ4YzFmNzktMmM5ZC00MDZjLTk1OTktNDE2ODE4YjM2MjJjXkEyXkFqcGdeQXVyNTA4NzY1MzY@.jpg",
    "movie_storyLines": "Former United Nations employee Gerry Lane traverses the world in a race against time to stop a zombie pandemic that is toppling armies and governments and threatens to destroy humanity itself. Life for former United Nations investigator Gerry Lane and his family seems content. Suddenly, the world is plagued by a mysterious infection turning whole human populations into rampaging mindless zombies. After barely escaping the chaos, Lane is persuaded to go on a mission to investigate this disease. What follows is a perilous trek around the world where Lane must brave horrific dangers and long odds to find answers before human civilization falls. When former U.N. investigator Gerry Lane and his family get stuck in urban gridlock, he senses that it's no ordinary traffic jam. His suspicions are confirmed when, suddenly, the city erupts into chaos. A lethal virus, spread through a single bite, is turning healthy people into something vicious, unthinking and feral. As the pandemic threatens to consume humanity, Gerry leads a worldwide search to find the source of the infection and, with luck, a halt to it's spread. A virulent and unprecedented pandemic of global proportions which turns humans into rabid flesh-eating zombies takes the world by surprise. Under these circumstances, the retired United Nations special agent, Gerry Lane, must leave behind a peaceful family life, a wife and two daughters, to escort a team of scientists on a mission to find a cure, navigating through zombie-swarmed cities. However, as the deadly pathogen obliterates entire areas, incessantly giving birth to diseased masses of freshly-reanimated undead, the frail hope of finding a viable solution starts drifting away. Does humanity have enough time to wait for a miracle? Having retired as U.N. investigator, Gerry Lane devotes his time to wife Karin and their wining brat daughter Constance and Rachel in Philadelphia, until it becomes the next site of a globally spreading mystery epidemic turning bitten people into rabies-like zombies. His clueless former chief, deputy secretary general Thierry Umutoni, recalls him to the UN emergency team, thus offering the whole family a spot aboard the safe air carrier. Gerry joins though army veterans on reconnaissance to Korea, where a rogue CIA agent's suggestion proves worthless, then to Israel, where a Mossad 'contrarious tenth man' had the foresight to respond to a vague Indian pandemic threat by erecting a wall Jerusalem, only to see an undead flood overtake it. His last minute escape flight must deal drastically with an infected passenger before crashing in Cardiff, near a WHO research facility, where he combines and tests a daring out of the box 'camouflage' strategy inspired by weir observations. Retired U.N. investigator Gerry Lane (Brad Pitt) and his family are sitting in what appears to be a typical Philadelphia traffic jam when helicopters began to circle ominously overhead and an explosion throws the city into panic. In the blink of an eye, the streets are consumed by chaos. When ",
    "movie_genre": "Action-Horror"
},
{
    "movie_id": "tt5753856",
    "movie_title": "Dark",
    "movie_poster": "https://m.media-amazon.com/images/M/MV5BOTk2NzUyOTctZDdlMS00MDJlLTgzNTEtNzQzYjFhNjA0YjBjXkEyXkFqcGdeQXVyMjg1NDcxNDE@.jpg",
    "movie_storyLines": "A family saga with a supernatural twist, set in a German town where the disappearance of two young children exposes the relationships among four families. The first German production from the world's leading Internet TV Network is set in a present-day German town where the disappearance of two young children exposes the double lives and fractured relationships among four families. In 10 hour-long episodes, the story takes on a surprising twist that ties back to the same town in 1986. When two children go missing in a small German town, its sinful past is exposed along with the double lives and fractured relationships that exist among four families as they search for the kids. The mystery-drama series introduces an intricate puzzle filled with twists that includes a web of curious characters, all of whom have a connection to the town's troubled history--whether they know it or not. The story includes supernatural elements that tie back to the same town in 1986.",
    "movie_genre": "Drama/Mystery"
}]